{
    "page_size": 25,
    "page_count": 1,
    "count": 1,
    "next": null,
    "previous": null,
    "results": [
        {
            "id": 109249,
            "channel": "listed",
            "compatibility": {
                "thunderbird": {
                    "max": "3.0.*",
                    "min": "3.0"
                }
            },
            "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/sensitive-attachment-guard/versions/109249",
            "files": [
                {
                    "id": 90943,
                    "created": "2010-06-02T21:46:22Z",
                    "hash": "sha256:5627022e28d168e4bd90a7c4be469953ad60b284bb3a33e3e34f3e8498861f83",
                    "is_restart_required": true,
                    "is_webextension": false,
                    "is_mozilla_signed_extension": false,
                    "platform": "mac",
                    "size": 2228224,
                    "status": "public",
                    "url": "https://addons.thunderbird.net/thunderbird/downloads/file/90943/sensitive_attachment_guard-1.0-tb-macosx.xpi?src=",
                    "permissions": []
                },
                {
                    "id": 90944,
                    "created": "2010-06-02T21:46:34Z",
                    "hash": "sha256:5627022e28d168e4bd90a7c4be469953ad60b284bb3a33e3e34f3e8498861f83",
                    "is_restart_required": true,
                    "is_webextension": false,
                    "is_mozilla_signed_extension": false,
                    "platform": "windows",
                    "size": 2228224,
                    "status": "public",
                    "url": "https://addons.thunderbird.net/thunderbird/downloads/file/90944/sensitive_attachment_guard-1.0-tb-win.xpi?src=",
                    "permissions": []
                }
            ],
            "is_strict_compatibility_enabled": true,
            "license": {
                "id": 1129,
                "name": {
                    "en-US": "Custom License"
                },
                "text": {
                    "en-US": "Sensitive Attachment Guard v1.0 License\n\n\"Author\" herein refers to CECID. \"Software\" refers to all files included with Sensitive Attachment Guard (typically installed by the Cross Platform Installer (XPI) or extracted from a .xpi). \n\nExcept where otherwise noted, all of the documentation and Software is copyrighted by CECID. \n\nAll rights reserved. \n\nUse of the Software is permitted provided that all of the following terms are accepted:\n1.\tThe Author grants you a non-exclusive license to use the Software subject to your compliance with all of the terms and conditions of this License.\n2.\tYou are only granted a license for the machine-readable, object code portion of the Software. You will not modify, enhance, reverse engineer or otherwise alter the Software from its current state.\n3.\tYou will not have any proprietary rights of the Software. You acknowledge and agree that the Author retains all copyrights and other proprietary rights of the Software.\n4.\tThe Software is provided \"as-is,\" without any express or implied warranty. Without even the implied warranty of merchantability and fitness for a particular purpose. In no event shall the Author be held liable for any, direct or indirect, damages arising from the use of the Software.\n5.\tNone of the Software's files may be redistributed for profit or as part of another Software package without express written permission of the Author.\n6.\tUse of the Software within the scope of this license is free of charge and no royalty or licensing fees shall be payable by you. Use beyond the scope of this license shall constitute copyright infringement.\n7.\tThis license shall be effective and bind you upon your downloading of the Software.\n8.\tThe Author reserves his rights to modify this agreement in the future.\n\nIf you do not agree to all of the above terms, you are not permitted to use the Software in any way, and all copies of it must be deleted from your system(s). \n\nCECID is a research and development center promoting e-commerce infrastructure development and advancement. Please visit us at: <a href=\"http://www.cecid.hku.hk\" rel=\"nofollow\">http://www.cecid.hku.hk</a> \n\nApache License Version 2.0\n--------------------------\nCopyright 2010 CECID\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    <a href=\"http://www.apache.org/licenses/LICENSE-2.0\" rel=\"nofollow\">http://www.apache.org/licenses/LICENSE-2.0</a>\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\nDOM4J Version 1.6.1\n-------------------\nCopyright 2001-2005 (C) MetaStuff, Ltd. All Rights Reserved.\n\nRedistribution and use of this software and associated documentation\n(\"Software\"), with or without modification, are permitted provided\nthat the following conditions are met:\n\n1. Redistributions of source code must retain copyright\n   statements and notices.  Redistributions must also contain a\n   copy of this document.\n \n2. Redistributions in binary form must reproduce the\n   above copyright notice, this list of conditions and the\n   following disclaimer in the documentation and/or other\n   materials provided with the distribution.\n \n3. The name \"DOM4J\" must not be used to endorse or promote\n   products derived from this Software without prior written\n   permission of MetaStuff, Ltd.  For written permission,\n   please contact dom4j-info@metastuff.com.\n \n4. Products derived from this Software may not be called \"DOM4J\"\n   nor may \"DOM4J\" appear in their names without prior written\n   permission of MetaStuff, Ltd. DOM4J is a registered\n   trademark of MetaStuff, Ltd.\n \n5. Due credit should be given to the DOM4J Project - \n   <a href=\"http://www.dom4j.org\" rel=\"nofollow\">http://www.dom4j.org</a>\n\nTHIS SOFTWARE IS PROVIDED BY METASTUFF, LTD. AND CONTRIBUTORS\n``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT\nNOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL\nMETASTUFF, LTD. OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\nSTRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\nOF THE POSSIBILITY OF SUCH DAMAGE.\n\n\nSIMILE Project\n--------------\n(c) Copyright The SIMILE Project 2003-2005. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n\n3. The name of the author may not be used to endorse or promote products\n   derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\nIN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\nNOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nJAXEN Version 1.1.1\n-------------------\nCopyright 2003-2006 The Werken Company. All Rights Reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n * Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n\n * Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n\n * Neither the name of the Jaxen Project nor the names of its\n   contributors may be used to endorse or promote products derived \n   from this software without specific prior written permission..\n    \nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS\nIS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED\nTO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER\nOR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
                },
                "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/sensitive-attachment-guard/license/1.0"
            },
            "release_notes": {
                "en-US": "Initial version of Sensitive Attachment Guard\n\nTo start with the add-on, you may visit the <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/536e419985cc53d69e8e471676839cdbb9e9d6ce1a6868d4534da5d3faeb7b46/http%3A//community.cecid.hku.hk/index.php/product/sag/sensitive_attachment_guard_tutorial/\">tutorial</a> or follow the steps below\n1. Install add-on\n2. Download the template file to create your document\n3. Update the sensitive content to apply <b>confidential</b> characters style\n4. Save the document and send it as normal\n5. A dialog would prompt to warn you sensitive content is sending to unknown recipient(s)"
            },
            "reviewed": "2011-05-03T10:38:19Z",
            "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/sensitive-attachment-guard/versions/1.0",
            "version": "1.0"
        }
    ]
}