[
    {
        "id": 1346289,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "27.*",
                "min": "12.0"
            },
            "firefox": {
                "max": "56.*",
                "min": "12.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/1346289",
        "files": [
            {
                "id": 156537,
                "created": "2012-06-26T12:04:11Z",
                "hash": "sha256:9763de1ecd043e5490b1dc0ab18decff49aa3f3c056e366875220d448c6bf946",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 212819,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/156537/grocery_list_generator-2.3-tb+fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "- Rewritten innerHTML usages\n- No longer opens main app window after options are closed from about:addons"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/2.3.1-signed.1-let-fixed.1-signed",
        "version": "2.3.1-signed.1-let-fixed.1-signed"
    },
    {
        "id": 127669,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.1.*",
                "min": "1.0"
            },
            "firefox": {
                "max": "13.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/127669",
        "files": [
            {
                "id": 110238,
                "created": "2011-02-02T12:39:26Z",
                "hash": "sha256:564f33d8100f58d4886e7111121d1369d1d6d4407cbf99448d7ff9e0bd6813cb",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 168388,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/110238/grocery_list_generator-2.1.3-tb+fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "v Rewritten all setTimeout calls to use function arguments instead of strings.\nv Updated and rechecked translations."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/2.1.3.1-signed.1-signed",
        "version": "2.1.3.1-signed.1-signed"
    },
    {
        "id": 105659,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0.*",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.6.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/105659",
        "files": [
            {
                "id": 88119,
                "created": "2010-05-02T03:25:09Z",
                "hash": "sha256:138b5638363b6e56e349e4429e48ffb0dd768280866b06d0436c7592166c99ae",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 155648,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/88119/grocery_list_generator-2.1-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "v Added automated recipe import for foodandwine.com, wholefoodsmarket.com, sfmarkets.shoptocook.com, epicurious.com, simplyrecipes.com, about.com, myrecipes.com, chow.com, campbellskitchen.com, pillsbury.com\nv Bugfix: Toolbar button is fixed on the far right side of the toolbar, can't move it, can't remove it.\nv Bugfix: allrecipes.com import appears to be broken.\nv Bugfix: The \"Add item type\" line is invisible because the list of available item types no longer shows a scrollbar...\nv Bugfix: Item types that have no matching items when filtered will now also be hidden.\nv Bugfix: Bullet image no longer showed in a generated recipe."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/2.1",
        "version": "2.1"
    },
    {
        "id": 87255,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.6.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/87255",
        "files": [
            {
                "id": 72365,
                "created": "2009-12-10T13:05:51Z",
                "hash": "sha256:a79e05d84bcc803a54b416ae9ea8cb52be6d19f0b05da8f4e05db353b4ce6279",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 152576,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/72365/grocery_list_generator-2.0.3-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "v Safe the trees, reduced the generated grocery list's total size by about 35%.\nv Bugfix: Fix the \"Could not find the selected item.\" error when switching from the details tab to the overview tab in some cases."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/2.0.3",
        "version": "2.0.3"
    },
    {
        "id": 86213,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.6.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/86213",
        "files": [
            {
                "id": 71501,
                "created": "2009-12-01T11:59:08Z",
                "hash": "sha256:04565c886097dfe2edff8e283ae5ef6cc99ac7f318060485b5c89511cac54603",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 152576,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/71501/grocery_list_generator-2.0.2-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "v Bugfix: Editing the category labels from within the options window was broken.\nv Bugfix: Removed AMO policy violating string prototype extension.\nv Bugfix: Added a type to the list's iframe element as per AMO policy (even though it was not used for viewing pages).\nv Bugfix: Clicking the \"Get more recipes\" link gave an error when the GLG was opened via the add-on manager."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/2.0.2",
        "version": "2.0.2"
    },
    {
        "id": 85683,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.6.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/85683",
        "files": [
            {
                "id": 71057,
                "created": "2009-11-26T10:48:36Z",
                "hash": "sha256:e54a0c0a9a3b74b2776d1576ebfa37e6d82929a4cafb25a6553cd35ff38359e4",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 152576,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/71057/grocery_list_generator-2.0.1-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "v Added Automated Recipe Import from allrecipes.com and foodnetwork.com\nv Added prices to items, the total of your grocery list is computed and shown at the bottom while you are creating your list.\nv Replaced the single \"New Item\" method by a bulk insert allowing you to quickly add multiple items.\nv Added a more advanced search feature, now filtering the matching results, and when searching for dishes their ingredients are also searched.\nv Added a \"Notes\" field to the generated grocery list so you can add last minute notes to it before printing.\nv Save the no. items in a file instead of in a preference so people can more easily be portable with the GLG.\nv Bugfix: Editing the category labels from within the options window was broken.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/2.0.1",
        "version": "2.0.1"
    },
    {
        "id": 67822,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.5.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/67822",
        "files": [
            {
                "id": 52564,
                "created": "2009-05-05T10:45:54Z",
                "hash": "sha256:2a7e346d918b0be58b3cf658e478ecac5ec540279179eb3ed4d8ea685ce1395d",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 146432,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/52564/grocery_list_generator-1.6.4-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "v Bugfix: Changing data folder no longer worked.\nv Tested on Firefox 3.5b4."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.6.4",
        "version": "1.6.4"
    },
    {
        "id": 65085,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.5b4pre",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/65085",
        "files": [
            {
                "id": 49576,
                "created": "2009-03-23T12:16:26Z",
                "hash": "sha256:c97cd434fae7289e12e545938800e804e15072534be3ba37713ffd098b0e0876",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 146432,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/49576/grocery_list_generator-1.6.3-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Bugfix: New detail refresh code did not refresh enough, at least items needed for a dish did not update when adding/deleting.\nv Bugfix: In some situations you would get a \"Could not find the item...\" error when switching tabs or closing the GLG."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.6.3",
        "version": "1.6.3"
    },
    {
        "id": 63920,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.1b2",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/63920",
        "files": [
            {
                "id": 48341,
                "created": "2009-03-05T11:19:55Z",
                "hash": "sha256:d2d3c115fd7e9c0e6c682537326c54bc0362cd796659b0aa2299a777047bca59",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 146432,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/48341/grocery_list_generator-1.6.2-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Bugfix: Startup conversion routines (for upgrading from an older version) could corrupt your database when you moved an already up to date database to a new GLG installation.\nv Made compatible with Firefox 3.1, tested on 3.1b2.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.6.2",
        "version": "1.6.2"
    },
    {
        "id": 47604,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.0.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/47604",
        "files": [
            {
                "id": 31089,
                "created": "2008-06-18T13:51:08Z",
                "hash": "sha256:df94e24178d9a586c5dbbdc531c490f094722294b70ff7b566174edcad477fb1",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 146432,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/31089/grocery_list_generator-1.6.1-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v After moving an item type in the overview, scroll the overview back to that item type...\nv Remember last selected type when adding items.\nv Made compatible with Firefox 3\nv Bugfix: \"Get more recipes\" link does not work in Thunderbird."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.6.1",
        "version": "1.6.1"
    },
    {
        "id": 36361,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.0a1",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/36361",
        "files": [
            {
                "id": 19655,
                "created": "2007-09-29T13:10:12Z",
                "hash": "sha256:013a705a54fe821643f5a3120d6786f3dedb5ab32f9d62d00de06a153ec21edf",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 145408,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/19655/grocery_list_generator-1.6-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Built the grocerylistgenerator.com website to create a place where GLG users can share their recipes.\nv Added publish/import routines to publish recipes to the new grocerylistgenerator.com website, and to import recipes found on that website.\nv Added possibility to add a picture of your recipe\nv Added a quantity description to items needed for a recipe, e.g. 1 tablespoon.\nv Implemented a new way of adding items to a dish which makes it more easy to understand whether you are adding a new or an existing item.\nv Added option to generate your grocery list in a single column layout.\nv LX restyled all icons.\nv Restyled the user interface.\nv Added a \"Reset\" button to clear the running list of selected items.\nv Added sv-SE and zh-CN translations.\nv No longer show the page title + url + page numbers when printing your Grocery List.\nv Bugfix: No longer remove unused item types (there used to be a reason for this, but not anymore)\nv Bugfix: Fixed encoding/charset problems with the loading of the initial multilingual set of sample dishes.\nv Bugfix: When you deleted an item when displaying it on the details tab, it appeared as if the item/dish was not deleted at all (though it was, it just did not refresh).\nv Bugfix: Clear the running list of items only after you printed/exported your list (not directly after generating it)\nv Bugfix: You could not delete the 1st item type in the list."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.6",
        "version": "1.6"
    },
    {
        "id": 32608,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "firefox": {
                "max": "3.0a1",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/32608",
        "files": [
            {
                "id": 15841,
                "created": "2007-05-19T12:41:17Z",
                "hash": "sha256:c26c879bd367209a6564c56d30849bf3159ea5a0061d5464f86722eb3f3bd5e9",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 102400,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/15841/grocery_list_generator-1.5-fx+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Update user interface and added new icons.\nv Added an info tooltip for items in the overview so you can easily see why an item has been selected n times + it's comments.\nv Added option to rearrange the item types in the options screen with Drag &amp; Drop.\nv Added option so minimize 1 of the overviews (dishes or items) so you can have a bigger view of 1 of them.\nv Added more keyboard controls: DEL resets the currently selected row's number of items, + and - keys increase and decrease them. (Up/Down and menu shortcuts where already available)\nv Made compatible with Thunderbird.\nv Bugfix: After moving item categories in the overview, the status message (Refreshing...) would sometimes not hide.\nv Bugfix: Fixed memory leaks."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.5",
        "version": "1.5"
    },
    {
        "id": 31096,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/31096",
        "files": [
            {
                "id": 14304,
                "created": "2007-03-27T12:02:28Z",
                "hash": "sha256:fe59f5f1d7ab07e3486203e1c4691b243de3003b10cd7a4432b19a7d2f0fe0e0",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 91136,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/14304/grocery_list_generator-1.4.3-fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Bugfix: Unicode support got completely lost somewhere in my e-mail from work -&gt; home."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.4.3",
        "version": "1.4.3"
    },
    {
        "id": 25947,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/25947",
        "files": [
            {
                "id": 5861,
                "created": "2007-03-05T13:14:00Z",
                "hash": "sha256:5825646e7a2df4375dc6718f1ce45d54dd9fd306e70855da8521f4b2d114ed30",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 91136,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/5861/grocery_list_generator-1.4.2.1-fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v If the printer settings could not be retrieved, the printer setup window is shown.\nv Always start the generated list's 2nd column with an item type instead of stopping at the bottom of the 1st column and continuing at the top of the 2nd."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.4.2.1",
        "version": "1.4.2.1"
    },
    {
        "id": 23998,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/23998",
        "files": [
            {
                "id": 5860,
                "created": "2007-03-05T13:14:00Z",
                "hash": "sha256:74d4856a9dee80813bb0e2bdf83d488bdddeee492f5505cdcafff1881eb96d28",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 91136,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/5860/grocery_list_generator-1.4-fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Added unicode support (UTF8).\nv Generated list now has 2 columns, and is valid HTML 4.0.1.\nv Format recipe comments if they contain *'s (/).\nv Added an option to clear the running list after you generate a grocery list. (off by default)\nv Added CTRL+SHIFT hotkeys to all toolbar actions.\nv Don't display status messages that take less then 200ms. (e.g. when switching tabs).\nv Added el-GR, nb-NO, tr-TR and hr-HR translations.\nv Made compatible with Firefox 2.0 (fixed some small UI problems)\nv Bugfix: Autosave does not work when you press a toolbar button directly after typing.\nv Bugfix: Save all data before generating a list/recipe.\nv Bugfix: Sorting problems made item types show up duplicate in some combinations, thanks Megan."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.4",
        "version": "1.4"
    },
    {
        "id": 14963,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/14963",
        "files": [
            {
                "id": 5859,
                "created": "2007-03-05T13:14:00Z",
                "hash": "sha256:c3424c7cf15150cfa08ac6063e01c0e3c50f53f4e9b4506d282e998121b32439",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 66560,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/5859/grocery_list_generator-1.3.0-fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Resize the comments box along with the resize of the window.\nv Add option to include an item's comments on your grocery list.\nv Add \"Generate Recipe\" when a dish' details tab is selected.\nv Add a \"Don't show this message again\" option to the \"Are you sure you want to delete this item\" message.\nv Faster Faster Faster... (If it's fast enough, users will be less bugged by the \"Refreshing...\" message.)\nv Sort the \"Items needed for this dish\" alphabetically.\nv Also make top and left of the main GLG window persistent (with a minimum of 525x575).\nv Removed pre Firefox 1.5 support so I could implement the xul scrollbox (instead of a html:div), this was needed to speed up things (approx 50% faster refreshing).\nv Removed a lot of redundant refreshes.\nv Bugfix forgot to apply the stylesheet to the customize toolbar window, causing all Ff icons to show.\nv Added pt-BR translation."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.3.0",
        "version": "1.3.0"
    },
    {
        "id": 11655,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/11655",
        "files": [
            {
                "id": 5858,
                "created": "2007-03-05T13:14:00Z",
                "hash": "sha256:ebbd5d775eec3557dfb5bd15b395b6088cc72f6e53d489e9edb2fb31c98e1a01",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 62464,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/5858/grocery_list_generator-1.21-fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Bugfix: Copy paste bug, ja-JP was accidentally set as the locale name of es-AR in chrome.registry. This caused the GLG to show in es-AR on ja Firefoxes. Sorry for the inconvenience Japanese users, and AMO reviewer."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.21",
        "version": "1.21"
    },
    {
        "id": 10659,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/10659",
        "files": [
            {
                "id": 5857,
                "created": "2007-03-05T13:13:59Z",
                "hash": "sha256:ff2845babbc7939f07d862f033e6a2972e6e0a07b7fb4537b0666cac5c6b8953",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 62464,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/5857/grocery_list_generator-1.2-fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Made it some 40% faster, still a bit too slow, but it is and will always stay javascript...\nv Added \"Keep a running list\" feature. On by default from now.\nv Bugfix: The list of selected items was cleared as soon as you went to the options screen.\nv Bugfix: It should now be impossible to get duplicate item types when editing them.\nv Bugfix: Include contentAreaUtils to be able to use it's saveDocument function for the list export function (was required for Firefox 1.5).\nv Bugfix: Added checks on startup/close to see if the itemtypes are still alright (non duplicate/non missing).\nv Bugfix: Fixed problem with numeric (itemtype index) + character (item name) sorting/grouping of the items, causing it to look as if a lot of types where duplicate."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.2",
        "version": "1.2"
    },
    {
        "id": 9431,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/9431",
        "files": [
            {
                "id": 5856,
                "created": "2007-03-05T13:13:59Z",
                "hash": "sha256:1866361721dff124759d6e28ff0089796e371190c0bff99ef167614a704da695",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 61440,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/5856/grocery_list_generator-1.1-fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "v Add a description field to both dishes and items.\nv Autosave standard.\nv Change data directory option.\nv Editable item types.\nv Sort items in \"Add item to dish\" dropdown on the Dishes' details tab, alphabeticaly.\nv Remember glg list export directory if possible.\nv Fix small UI problems with Firefox 1.5.\nv Bugfix: Decrease a dish to 0 and the items will not decrease with it. (Same goes for increase to 99)."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.1",
        "version": "1.1"
    },
    {
        "id": 6695,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.4",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/grocery-list-generator/versions/6695",
        "files": [
            {
                "id": 5855,
                "created": "2007-03-05T13:13:59Z",
                "hash": "sha256:87dc0416c9d44d53bc0f85c8023e029ab466907053b2c54064ddc31223558595",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 55296,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/5855/grocery_list_generator-1.0-fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "First release."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/grocery-list-generator/versions/1.0",
        "version": "1.0"
    }
]