[
    {
        "id": 2091275,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "10.0a1",
                "min": "3.0"
            },
            "seamonkey": {
                "max": "2.7a1",
                "min": "2.0"
            },
            "firefox": {
                "max": "56.*",
                "min": "3.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/2091275",
        "files": [
            {
                "id": 639647,
                "created": "2017-04-30T14:12:50Z",
                "hash": "sha256:1ff1f36be78d5cb6ac6c2126016138c094cb3098cf85a860aab77fe3a41773d7",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 80687,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/639647/certificate_patrol-2.0.16-fx+sm+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Some UX improvements."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/2.0.16",
        "version": "2.0.16"
    },
    {
        "id": 1282101,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "19.*",
                "min": "3.0"
            },
            "seamonkey": {
                "max": "2.10a1",
                "min": "2.0"
            },
            "firefox": {
                "max": "14.0",
                "min": "3.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/1282101",
        "files": [
            {
                "id": 134629,
                "created": "2011-10-14T13:19:22Z",
                "hash": "sha256:342425190902bc7e2ebf609e80e5fb8476784e6552160ceb88f6d390791762ab",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 80051,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/134629/certificate_patrol-2.0.14-tb+sb+fx+sm.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Updated maxversions"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/2.0.14.1-signed.1-signed",
        "version": "2.0.14.1-signed.1-signed"
    },
    {
        "id": 1270422,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "10.0a1",
                "min": "3.0"
            },
            "seamonkey": {
                "max": "2.7a1",
                "min": "2.0"
            },
            "firefox": {
                "max": "10.0a1",
                "min": "3.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/1270422",
        "files": [
            {
                "id": 131926,
                "created": "2011-09-15T08:19:40Z",
                "hash": "sha256:c325cc3f075924a5c9bdabadbeec5c0915cc35d955577dc56a534f0a9e703e1d",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 80046,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/131926/certificate_patrol-2.0.12-tb+sb+sm+fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "<ul><li>Fix for new cert popup dialog</li><li>Fix for dialog open in Thunderbird so notifications show up again</li></ul>"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/2.0.12.1-signed.1-signed",
        "version": "2.0.12.1-signed.1-signed"
    },
    {
        "id": 1262963,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "9.0a1",
                "min": "3.0"
            },
            "seamonkey": {
                "max": "2.6a1",
                "min": "2.0"
            },
            "firefox": {
                "max": "9.0a1",
                "min": "3.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/1262963",
        "files": [
            {
                "id": 128091,
                "created": "2011-08-03T19:57:32Z",
                "hash": "sha256:9ff9e481fb72c6e8d3df4c45618817b0d0af353d37e44ceb361a0cb868fd2ce3",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 79915,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/128091/certificate_patrol-2.0.10-sm+tb+sb+fx.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "<ul><li>Added ignore list to preferences and an ignore button to the change notification dialog</li><li>Added a setting for suppressing notifications about new certificates.</li><li>Added a notify timeout setting (10s by default)</li><li>Added \"Stored since\" to the change notification dialog.</li><li>Fixed a problem with new wildcard host notification</li></ul>"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/2.0.10.1-signed.1-signed",
        "version": "2.0.10.1-signed.1-signed"
    },
    {
        "id": 1258636,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "7.0a1",
                "min": "3.0"
            },
            "seamonkey": {
                "max": "2.4a1",
                "min": "2.0"
            },
            "firefox": {
                "max": "8.*",
                "min": "3.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/1258636",
        "files": [
            {
                "id": 126738,
                "created": "2011-07-19T10:10:05Z",
                "hash": "sha256:f78271724ba7b58af8b26db009f1e10971e2dd93b3156f3cdf3204384201270d",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 78067,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/126738/certificate_patrol-2.0.8-tb+fx+sm+sb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "fixed prefs window in thunderbird"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/2.0.8.1-signed.1-signed",
        "version": "2.0.8.1-signed.1-signed"
    },
    {
        "id": 1257248,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "7.0a1",
                "min": "3.0"
            },
            "seamonkey": {
                "max": "2.4a1",
                "min": "2.0"
            },
            "firefox": {
                "max": "7.0a1",
                "min": "3.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/1257248",
        "files": [
            {
                "id": 126171,
                "created": "2011-07-13T10:43:07Z",
                "hash": "sha256:ed7195cc2f468c90230e7a536ad0649f58e9885ffcb24f4ea4bbe586165c0eb5",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 77773,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/126171/certificate_patrol-2.0.6-tb+sm+fx+sb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "<ol><li>Since the hierarchy of certification authorities is the safest information\n   we have about certificates, we now store it entirely and show it first,\n   even before the text, which has been put into the certificate and may be\n   falsified if the hierarchy is bogus. We explain this in more detail on\n   our website.</li><li>We now use \"HTTP observers\" instead of web page \"onLoad\" which means that\n   now we check every single included element on a page, so you may be seeing\n   certificates for servers you didn't know you were visiting before.</li><li>Added a checkbox to the change dialog for \"checking issuer only\" in future,\n   this helps with annoying domains that run on messed up certificates. As\n   long as they don't mess with the certification hierarchy, it's okay.</li><li>We allow users to reject a new or changed certificate. This won't stop\n   the loading of the page, since we are not in charge of that, but it will\n   warn you again, next time you bump into the same bogus website.</li><li>The certificate dialogs have been reorganized. The change dialog has a diff-like layout so you don't have to compare the certificates yourself. Patrol highlights what has changed.</li><li>By adopting the standard certificate view details wizards, you can look at certificates in every little detail and also export certificates into a file on your desktop.</li><li>Added CertPatrol to the 'Clear Recent History' dialog which deletes recently inserted/updated or all certs from the database.</li><li>Added CertPatrol to the 'View Certificates' dialog in Preferences/Advanced/Encryption where you can view and delete the certificates stored by CertPatrol.</li><li>Added a checkbox to its own preferences dialog for allowing CertPatrol to save certificates even when in Private Browsing Mode.</li><li>We added green/yellow/red threat level indicators.</li></ol>"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/2.0.6.1-signed.1-signed",
        "version": "2.0.6.1-signed.1-signed"
    },
    {
        "id": 1241750,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.3a4pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.2a1pre",
                "min": "1.1"
            },
            "firefox": {
                "max": "6.*",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/1241750",
        "files": [
            {
                "id": 121024,
                "created": "2011-05-22T05:39:31Z",
                "hash": "sha256:d123b2f2d49950122124235fcc5227ff754fda302319b4ec0d9f563d604c774d",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 22482,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/121024/certificate_patrol-1.8.3-tb+fx+sm+sb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Fixed wildcard match option, thanks Peter for noticing!"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.8.3.1-signed.1-signed",
        "version": "1.8.3.1-signed.1-signed"
    },
    {
        "id": 711823,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.3a4pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "1.5a",
                "min": "1.1"
            },
            "firefox": {
                "max": "6.0a2",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/711823",
        "files": [
            {
                "id": 115326,
                "created": "2011-03-24T08:41:12Z",
                "hash": "sha256:36aff28e5d23d4c02ac1d3b911a893b9dd3d0744e711b21fa38527c212fcd246",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 22598,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/115326/certificate_patrol-1.8.1-fx+tb+sm+sb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": null,
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.8.1.1-signed.1-signed",
        "version": "1.8.1.1-signed.1-signed"
    },
    {
        "id": 112353,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.2a1pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.1a3",
                "min": "1.1"
            },
            "firefox": {
                "max": "4.0b2pre",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/112353",
        "files": [
            {
                "id": 93681,
                "created": "2010-07-09T01:41:13Z",
                "hash": "sha256:6139a1d8a313145117a22b8ed4b0bbb364fe1e2af13b4d866b6016a6b63ae162",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 17408,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/93681/certificate_patrol-1.4-fx+mz+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Display events of lesser importance using notification boxes. Allow to return to old behaviour using option switches in the new Preferences dialog. Sorry, should this annoy any users that got used to the old behaviour, but there has been so much criticism about so-called 'false positives' that it should better be the default not to show pop-ups for unimportant events. Just change the prefs if you're paranoid like me.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.4",
        "version": "1.4"
    },
    {
        "id": 111166,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.2a1pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.1a1pre",
                "min": "1.1"
            },
            "firefox": {
                "max": "3.7a4pre",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/111166",
        "files": [
            {
                "id": 92534,
                "created": "2010-06-23T03:41:16Z",
                "hash": "sha256:eb01ff2fa1acd733f36317f43808c4cf22f079aaa101072994e52ae7287b1622",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 17408,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/92534/certificate_patrol-1.2.7-fx+mz+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Repaired support for German Firefox.",
            "de": "Unterstützung für deutschen Firefox repariert."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.2.7",
        "version": "1.2.7"
    },
    {
        "id": 106967,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.2a1pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.1a1pre",
                "min": "1.1"
            },
            "firefox": {
                "max": "3.7a4pre",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/106967",
        "files": [
            {
                "id": 89163,
                "created": "2010-05-13T10:56:29Z",
                "hash": "sha256:7d79801abc3b9691cbdcffba4fc9e3c47ea6bfb1fcc5a6b053052fbc0f82cd74",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 18432,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/89163/certificate_patrol-1.2.6-fx+mz+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Fix for a race condition that may get certificates confused on\nsome platforms in some funny situations."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.2.6",
        "version": "1.2.6"
    },
    {
        "id": 105527,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.2a1pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.1a1pre",
                "min": "1.1"
            },
            "firefox": {
                "max": "3.7a4pre",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/105527",
        "files": [
            {
                "id": 88013,
                "created": "2010-05-01T00:53:40Z",
                "hash": "sha256:9681ac4557779a2983f7dde9488a8667dc1e357aede092900f6dff48cfe00f65",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 16384,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/88013/certificate_patrol-1.2.5-fx+mz+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Fix for the date display.\nFurther enhancements postponed."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.2.5",
        "version": "1.2.5"
    },
    {
        "id": 102165,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.2a1pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.1a1pre",
                "min": "1.1"
            },
            "firefox": {
                "max": "3.7a4pre",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/102165",
        "files": [
            {
                "id": 85268,
                "created": "2010-04-02T03:06:10Z",
                "hash": "sha256:cdc9af560829cdb8171a8be60ce6a92a1639f91110dfa6fb4e8197f2c10ade8d",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 14336,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/85268/certificate_patrol-1.2.3-fx+mz+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Patrol now gives a few hints on what may be wrong about\na certificate change, like expiry not being due or issuer\nhaving changed and it makes an estimate on a possible\nthreat level.\n\nAlso, validity dates are shown using ISO standard notation\nas the American mm/dd/yy order used by X.509 is quite\nconfusing for everybody else.\n\nExpiration and issuance dates are also shown as number of\ndays in the future or past from now.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.2.3",
        "version": "1.2.3"
    },
    {
        "id": 101247,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.2a1pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.1a1pre",
                "min": "1.1"
            },
            "firefox": {
                "max": "3.7a4pre",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/101247",
        "files": [
            {
                "id": 84392,
                "created": "2010-03-25T16:21:41Z",
                "hash": "sha256:bf02a41c937752c8a7407cba2df4c06389b7100c4abbdcf2f0004576d86f527a",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 12288,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/84392/certificate_patrol-1.1-fx+mz+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Some tweaks in the dialog GUI and a fix for a rare race condition\nthat has been reported to us by honeybee. Thanks!\nGood luck with your factorbee!!!!  ;)\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.1",
        "version": "1.1"
    },
    {
        "id": 93724,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.2a1pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.1a1pre",
                "min": "1.1"
            },
            "firefox": {
                "max": "3.7a1pre",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/93724",
        "files": [
            {
                "id": 78060,
                "created": "2010-01-30T09:11:03Z",
                "hash": "sha256:ef2b4727897d291b62a037179c01ce69137545b341ec61d711bd672670545f88",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 12288,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/78060/certificate_patrol-1.0-fx+mz+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "0.7 has proven such a stable release candidate, the time has come for 1.0 release."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/1.0",
        "version": "1.0"
    },
    {
        "id": 69250,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.1a1pre",
                "min": "2.0a1"
            },
            "seamonkey": {
                "max": "2.0b1",
                "min": "1.1"
            },
            "firefox": {
                "max": "3.6a1pre",
                "min": "2.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/certificate-patrol/versions/69250",
        "files": [
            {
                "id": 54144,
                "created": "2009-05-28T11:09:30Z",
                "hash": "sha256:871ec2e35198bb6bc23c1d7133cabba2bda556d49bd5e7e011cb1abe3a61ee0c",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 12288,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/54144/certificate_patrol-0.7-fx+mz+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Allow to copy &amp; paste data from pop-up.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/certificate-patrol/versions/0.7",
        "version": "0.7"
    }
]