{
    "id": 15102,
    "authors": [
        {
            "id": 343,
            "name": "Jonathan Protzenko",
            "url": "https://addons.thunderbird.net/en-US/thunderbird/user/mozjonathan/",
            "username": "mozjonathan",
            "picture_url": "https://addons.thunderbird.net/user-media/userpics/0/0/343.png?modified=1505246946"
        }
    ],
    "average_daily_users": 188068,
    "categories": {
        "thunderbird": [
            "message-and-news-reading"
        ]
    },
    "contributions_url": "https://paypal.me/protzenko",
    "current_version": {
        "id": 2472672,
        "compatibility": {
            "thunderbird": {
                "max": "*",
                "min": "68.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/manually-sort-folders/versions/2472672",
        "files": [
            {
                "id": 1015755,
                "created": "2019-09-26T20:28:21Z",
                "hash": "sha256:e30a4bbe14370001608844cb46bd6322ff4a0bfdab7a162bc3069b1e26b841ae",
                "is_restart_required": true,
                "is_webextension": true,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 76342,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/1015755/manually_sort_folders-2.0.2-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 13,
            "name": {
                "el": "GNU General Public License, έκδοση 2.0",
                "vi": "Giấy phép Công cộng GNU, phiên bản 2.0",
                "ca": "Llicència GPL (General Public License) de GNU, version 2.0",
                "it": "Licenza GNU General Public License, versione 2.0",
                "cs": "GNU General Public License, verze 2.0",
                "eu": "GNU General Public License, 2.0 bertsioa",
                "id": "GNU General Public License, versi 2.0",
                "es": "Licencia pública GNU, versión 2.0",
                "ru": "GNU General Public License, версия 2.0",
                "nl": "GNU General Public License, versie 2.0",
                "pl": "GNU General Public Licence, wersja 2.0",
                "de": "GNU General Public License, Version 2.0",
                "en-US": "GNU General Public License, version 2.0",
                "fa": "مجوز عمومی کلی گنو، نسخهٔ ۲٫۰",
                "ja": "GNU General Public License バージョン 2.0",
                "pt-PT": "GNU General Public License, versão 2.0",
                "zh-TW": "GNU General Public License，版本 2.0",
                "sq": "Leje e Përgjithshme Publike GNU, version 2.0",
                "ga-IE": "GNU General Public License, leagan 2.0",
                "sk": "GNU General Public License, verzia 2.0",
                "zh-CN": "GNU 通用公共授权，版本 2.0",
                "uk": "GNU General Public License, версія 2.0"
            },
            "url": "http://www.gnu.org/licenses/gpl-2.0.html"
        },
        "release_notes": {
            "en-US": "This is an updated version for compatibility with Thunderbird 68. A huge thanks to Maxime Rijnders who contributed most of the changes for this release. Version 2.0.1 contains a fix for the startup folder feature that was also broken in 2.0.0\n\n- In some cases, it appears that restarting Thunderbird a couple times may help if the dialog doesn't work on first try. If you experience this issue and have a way to reproduce, please file a bug report.\n- The ability to pick Local Accounts as the default account to force it to appear first seems to have disappeared a couple Thunderbird releases ago.\n\nNote that this is not backwards-compatible for Thunderbird 60 (please use the previous version reachable via the \"all versions\" link somewhere near the bottom of this page)."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/manually-sort-folders/versions/2.0.2",
        "version": "2.0.2"
    },
    "default_locale": "en-US",
    "description": {
        "ru": "Это расширение добавляет пункт «Сортировка папок вручную» в меню «Инструменты» Thunderbird.\n\nПо умолчанию Thunderbird сортирует папки учётной записи в алфавитном порядке. Это расширение позволяет вам выбрать собственный порядок сортировки папок, например, поместив в начале списка самые важные или переупорядочить их вручную.\n\nЭто расширение также изменяет способ автоматической сортировки папок. При этом, в отличие от стандартного способа, учитываются специальные символы Юникода. Если вы не хотите сортировать все папки вручную, добавьте юникод-символ (например, звёздочка «✸») в начале имени тех папок, которые должны находиться на вершине списка.\n\nЭто также работает для групп новостей в учётных записях блогов и лент новостей и папок любого уровня вложенности.\n\nК тому же, вы можете аналогичным способом переупорядочить и учётные записи, теперь для этого есть специальная вкладка.",
        "fr": "<b>Cette extension permet de trier manuellement les dossiers dans la liste des dossiers de Thunderbird. Voir \"Manually sort folders\" dans le menu \"Outils\".</b>\n\nUne autre possibilité offerte par cette extension est de trier automatiquement les dossiers mais en prenant en compte (contrairement à Thunderbird par défaut) les caractères Unicode. Ceci permet, par exemple, de mettre une étoile unicode ✸ au début d'un nom de dossier de manière à le faire apparaître en haut de la liste. Avec des caractères unicode différents, on peut ainsi faire de petites catégories de dossiers sans s'encombrer d'un tri manuel ou de sous-dossiers.\n\nIl est à noter que depuis la version 0.3 cette extension permet aussi de réordonner les comptes et plus seulement les dossiers d'un compte donné.",
        "en-US": "<b>This extension adds a \"Manually Sort Folders\" entry in the \"Tools\" menu of Thunderbird.</b>\n\nBy default Thunderbird sorts the folders of an account alphabetically. This extension allows you to choose a specific sort order for your folders, allowing you to put the most important ones on top, and manually order them.\n\nThis extension also offers another method for automatically sorting folders. Unlike Thunderbird's default, the extension's sort method takes into account Unicode special characters. If you do not wish to sort everything manually, you can use Unicode symbols at the beginning of your folder names to put them on top. For instance, you can put a Unicode star ✸ at the beginning of your folder name to put it on top of the list without having to sort everything manually.\n\nThis also works for newsgroups inside a news accounts, and also works for sub-folders, and sub-subfolders, etc.\n\nAs a bonus feature, <b>you can also re-order accounts as well</b>, there's an extra tab for that now. The latest version now also allows you to <b>choose the default startup folder</b>.\n\n(Note: there have been reports that running the addon through <a href=\"http://addonconverter.fotokraina.com/\" rel=\"nofollow\">http://addonconverter.fotokraina.com/</a> makes it compatible with SeaMonkey.)",
        "pl": "Rozszerzenie dodaje do w menu „Narzędzia” element „Sortuj foldery ręcznie”.\n\nThunderbird domyślnie sortuje foldery alfabetycznie. Dzięki temu rozszerzeniu można ręcznie określić kolejność folderów umieszczając na górze najważniejsze.\n\nManually Sort Folders oferuje również inną metodę automatycznego sortowania folderów niż domyślna. Rozszerzenie stosuje metodę sortowania uwzględniającą znaki specjalne Unicode. Jeśli nie chce się porządkować wszystko ręcznie, można użyć symboli Unicodee na początku nazw folderu, aby umieścić je na górze. Na przykład można umieścić na początku nazwy folderu symbol Unicode w postaci gwiazdki, by umieścić folder na szczycie listy.\n\nTa funkcja działa również na grupach dyskusyjnych w obrębie kont, a także w folderach podrzędnych itp.\n\nRozszerzenie umożliwia również <b>zmianę kolejności wyświetlania kont</b>.",
        "sv-SE": "<b>Detta tillägg lägger till posten \"Sortera mappar manuellt\" i Thunderbirds Verktyg-meny.</b>\n\nSom standard sorterar Thunderbird mappar under ett konto i alfabetisk ordning. Detta tillägg låter dig välja en specifik sorteringsordning för dina mappar, vilket ger dig möjligheten att placera de viktigaste mapparna överst och sortera dem manuellt.\n\nDetta tillägg erbjuder även en metod för automatisk sortering av mappar. Till skillnad från Thunderbirds standardmetod, tar tilläggets sorteringsmetod hänsyn till Unicode-specialtecken. Om du inte vill sortera allting manuellt, kan du använda Unicode-symboler i början av dina mappnamn för att placera dem överst. Du kan, exempelvis, ange en Unicode-stjärna (✸) i början av ett mappnamn för att placera mappen överst i listan utan att behöva sortera allting manuellt.\n\nDet här fungerar även för diskussionsgrupper under diskussionsgruppskonton och för undermappar, underundermappar, o.s.v.\n\nSom en bonusfunktion kan du även sortera om konton, det finns en extra flik för det nu. Den senaste versionen låter dig dessutom välja vilken standardstartmapp som skall visas vid programstart."
    },
    "developer_comments": null,
    "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/manually-sort-folders/edit",
    "guid": "tbsortfolders@xulforum.org",
    "has_eula": false,
    "has_privacy_policy": false,
    "homepage": {
        "sv-SE": "http://wiki.github.com/protz/Manually-Sort-Folders/",
        "en-US": "https://github.com/protz/Manually-Sort-Folders/"
    },
    "icon_url": "https://addons.thunderbird.net/user-media/addon_icons/15/15102-64.png?modified=1569186668",
    "icons": {
        "32": "https://addons.thunderbird.net/user-media/addon_icons/15/15102-32.png?modified=1569186668",
        "64": "https://addons.thunderbird.net/user-media/addon_icons/15/15102-64.png?modified=1569186668"
    },
    "is_disabled": false,
    "is_experimental": false,
    "is_featured": false,
    "is_source_public": true,
    "last_updated": "2019-10-01T19:26:45Z",
    "name": {
        "sv-SE": "Manually sort folders",
        "fr": "Trier manuellement les dossiers",
        "en-US": "Manually sort folders"
    },
    "previews": [
        {
            "id": 38073,
            "caption": {
                "sv-SE": "De här mapparna har sorterats manuellt så att de viktigaste mapparna ligger överst. Det är omöjligt att göra detta i Thunderbirds standardversion.",
                "fr": "Ces dossiers ont été triés manuellement. Sans cette extension, ces dossiers auraient été dans le désordre le plus complet.",
                "en-US": "These folders have been manually sorted in the folder pane to put my preferred ones on top. It is impossible to achieve this in default Thunderbird."
            },
            "image_size": [
                236,
                217
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/38/38073.png?modified=1530208633",
            "thumbnail_size": [
                218,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/38/38073.png?modified=1530208633"
        },
        {
            "id": 46954,
            "caption": {
                "sv-SE": "Ny funktion (fr.o.m. version 0.6): Välj vilken startmapp som skall visas vid programstart.",
                "en-US": "New feature (0.6 series): choose the startup folder"
            },
            "image_size": [
                562,
                500
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/46/46954.png?modified=1530208634",
            "thumbnail_size": [
                225,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/46/46954.png?modified=1530208634"
        },
        {
            "id": 46955,
            "caption": {
                "sv-SE": "Detta är dialogrutan som används för att sortera mapparna under ett visst konto.",
                "en-US": "This is the dialog that's used to sort the folders inside a given account"
            },
            "image_size": [
                562,
                500
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/46/46955.png?modified=1530208634",
            "thumbnail_size": [
                225,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/46/46955.png?modified=1530208634"
        },
        {
            "id": 46956,
            "caption": {
                "sv-SE": "Bonusfunktion: Du kan även ändra ordningen på kontona i mappanelen.",
                "en-US": "Bonus feature, you can also sort the accounts in the folder pane"
            },
            "image_size": [
                562,
                500
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/46/46956.png?modified=1530208634",
            "thumbnail_size": [
                225,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/46/46956.png?modified=1530208634"
        }
    ],
    "public_stats": true,
    "ratings": {
        "bayesian_average": 3.7145,
        "count": 361,
        "average": 3.7175,
        "text_count": 361
    },
    "ratings_url": "https://addons.thunderbird.net/en-US/thunderbird/addon/manually-sort-folders/reviews/",
    "requires_payment": false,
    "review_url": "https://addons.thunderbird.net/en-US/reviewers/review/15102",
    "slug": "manually-sort-folders",
    "status": "public",
    "summary": {
        "ru": "Расширение, которое позволит вам изменить порядок сортировки папок в панели папок Thunderbird.",
        "fr": "Cet extension permet de trier manuellement les dossiers d'un compte dans Thunderbird ou bien d'utiliser un meilleur tri automatique. Cette extension permet également de réordonner les comptes.",
        "en-US": "This extension allows you to manually sort (order) your folders in the folder pane of Thunderbird or automatically sort them, but in a better way. This extension also allows you to re-order accounts in the folder pane.",
        "it": "Permette di ordinare manualmente sia gli account che le relative cartelle nel pannello laterale tramite la finestra delle impostazioni accedendovi selezionando il menu principale di Thunderbird \"Strumenti -&gt; Impostazioni di Manually sort folders…\"",
        "da": "En udvidelse der lader dig ændre den måde hvorpå Thunderbird sorterer mapper i mappeoversigten.",
        "sv-SE": "Detta tillägg låter dig sortera dina mappar i Thunderbirds mappanel manuellt eller sortera dem automatiskt, fast på ett bättre sätt. Tillägget låter dig även ändra ordningen på konton i mappanelen.",
        "ja": "この拡張機能は手動または自動のどちらか好きな方法で Thunderbird のフォルダペインのフォルダの並び替えを可能にします。 またフォルダペインのアカウントも並び替えることができます。",
        "pl": "Rozszerzenie umożliwia ręczne sortowanie (zmianę kolejności) folderów w panelu folderów Thunderbirda lub ich automatyczne sortowanie, ale w lepszy sposób. Umożliwia także zmianę kolejności wyświetlania kont."
    },
    "support_email": {
        "en-US": "jonathan.protzenko@gmail.com"
    },
    "support_url": {
        "en-US": "https://github.com/protz/Manually-Sort-Folders/wiki"
    },
    "tags": [
        "accounts",
        "firefox57",
        "folder pane",
        "order",
        "reorder",
        "sort",
        "unicode"
    ],
    "type": "extension",
    "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/manually-sort-folders/",
    "weekly_downloads": 3364,
    "xpilib": {
        "ext_comp": {
            "compNoMax": true,
            "mext": true,
            "comp68": true,
            "comp60pv": true,
            "comp60pv_date": "2016-05-01T21:09:15Z"
        }
    }
}