{
    "id": 333301,
    "authors": [
        {
            "id": 5700246,
            "name": "dangerouswoo",
            "url": "https://addons.thunderbird.net/en-US/thunderbird/user/danwoo/",
            "username": "danwoo",
            "picture_url": "https://addons.thunderbird.net/user-media/userpics/5/5700/5700246.png?modified=1492139499"
        }
    ],
    "average_daily_users": 23,
    "categories": {
        "thunderbird": [
            "miscellaneous"
        ]
    },
    "contributions_url": null,
    "current_version": {
        "id": 1270488,
        "compatibility": {
            "thunderbird": {
                "max": "31.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/dweasysubject/versions/1270488",
        "files": [
            {
                "id": 131997,
                "created": "2011-09-16T18:17:49Z",
                "hash": "sha256:4064099de815453ab6cfa45ad75b03f3c89571c0d360f6a65e9547d0bc9957ec",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 13312,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/131997/dweasysubject-0.0.5-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 12,
            "name": {
                "el": "GNU Lesser General Public License, έκδοση 3.0",
                "vi": "Giấy phép Công cộng Ít hơn GNU, phiên bản 3.0",
                "ca": "Llicència LGPL (Lesser General Public License) de GNU, versió 3.0",
                "it": "Licenza GNU Lesser General Public License, versione 3.0",
                "cs": "GNU Lesser General Public License, verze 3.0",
                "eu": "GNU Lesser General Public License, 3.0 bertsioa",
                "id": "GNU Lesser General Public License, versi 3.0",
                "es": "Licencia pública menor GNU Lesser, versión 3.0",
                "ru": "GNU Lesser General Public License, версия 3.0",
                "nl": "GNU Lesser General Public License, versie 3.0",
                "pl": "GNU Lesser General Public License, wersja 3.0",
                "de": "GNU Lesser General Public License, Version 3.0",
                "en-US": "GNU Lesser General Public License, version 3.0",
                "fa": "مجوز عمومی کلی کاهش‌یافتهٔ گنو، نسخهٔ ۳٫۰",
                "ja": "GNU Lesser General Public License バージョン 3.0",
                "pt-PT": "GNU Lesser General Public License, versão 3.0",
                "zh-TW": "GNU Lesser General Public License，版本 3.0",
                "sq": "Leje e Përgjithshme Publike Më e Pakët GNU, version 3.0",
                "ga-IE": "GNU Lesser General Public License, leagan 3.0",
                "sk": "GNU Lesser General Public License, verzia 3.0",
                "zh-CN": "GNU 较宽松公共许可证（LGPL），版本 3.0",
                "uk": "GNU Lesser General Public License, версія 3.0"
            },
            "url": "http://www.gnu.org/licenses/lgpl-3.0.html"
        },
        "release_notes": {
            "en-US": "Variables were leaked to the global scope, the declaration added.",
            "ja": ""
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/dweasysubject/versions/0.0.5",
        "version": "0.0.5"
    },
    "default_locale": "en-US",
    "description": {
        "ru": "Когда вы вводите тему, тема хорошая новость для людей с аналогичными времени.\nЭто дополнение, выбрав предметом сообщения, отправленные в прошлом, вы можете легко войти.\nТема поле ввода, что-то типа и одной буквы, отправлены по электронной почте с пометкой в прошлом всплывает, просто нажмите на него.\nИстория будет продолжать это делать при установке добавить тему от предмета, прежде чем устанавливать дополнения не будут отображаться.\nЧтобы добавить к своей истории, единственное сходство ниже установленного значения по сравнению с предметом в истории, нажмите кнопку Добавить.\nТаким образом, устанавливая сходство значение 100 будет добавлен во все истории.",
        "en-US": "When you type a subject, the subject is good news for people with a similar time.\nThis add-on by selecting the subject of email sent in the past, you can easily enter.\nSubject input box, type something and one letter, sent by email with the subject in the past pops up, just click on it.\nHistory will continue to do so when you install an add a subject from the subject before you install an add-on will not be displayed.\nTo add to the history, only similarity is below a set value compared to the subject in history, then click Add.\nTherefore, by setting a similarity value of 100 will be added to all of history.",
        "de": "Wenn Sie ein Thema geben, ist das Thema eine gute Nachricht für Menschen mit einer ähnlichen Zeit.\nDieses Add-on, indem Sie das Thema E-Mail in die Vergangenheit geschickt, können Sie einfach eingeben.\nBetreff Eingabefeld geben Sie etwas und ein Brief, per E-Mail mit dem Betreff geschickt in der Vergangenheit erscheint, klicken Sie einfach darauf.\nDie Geschichte wird dies auch weiterhin tun, wenn Sie ein Add ein Thema aus dem Thema, bevor Sie ein Add-on werden nicht angezeigt installieren.\nSo fügen Sie die Geschichte, die einzige Ähnlichkeit unten ist eine Menge Wert im Vergleich zu dem Thema in der Geschichte, dann klicken Sie auf Hinzufügen.\nDaher wird, indem eine Ähnlichkeit Wert von 100, alle von der Geschichte aufgenommen werden.",
        "ko": "이 주제를 입력하면, 주제는 비슷한 시간에 사람들을위한 좋은 소식입니다.\n이것은 과거에 보낸 이메일의 제목을 선택하여 추가, 당신은 쉽게 입력하실 수 있습니다.\n과거에 제목과 함께 이메일로 보내 제목 입력 상자에 뭔가를 하나의 편지는, 팝업, 그냥 클릭합니다.\n역사 당신이 표시되지 않습니다 애드 온 (add - on) 설치하기 전에이 주제에서 주제를 추가 설치할 때 그렇게 할 것입니다.\n역사에 추가할에만 유사 아래 역사 주제에 비해 설정 값으로, 다음 추가를 누릅니다.\n따라서 100의 유사성 값을 설정하여 역사의 모든에 추가됩니다.",
        "zh-CN": "当你键入一个主题，主题是相似的时间与一个人的好消息。\n这附加选择在过去发送的电子邮件的主题，你可以很容易地进入。\n主题输入框中，键入的东西，一个字母，在过去通过电子邮件发送与主题弹出，只要按一下就可以了。\n历史将继续这样做，当您安装一个附加从主题的主题，然后再安装一个附加的将不被显示。\n要添加到的历史，唯一的相似之处是低于设定值时相比，在历史的主体，然后单击添加。\n因此，通过设置一个100的相似性值将被添加到所有的历史。",
        "ar": "عند كتابة الموضوع ، والموضوع هو أنباء طيبة بالنسبة للأشخاص الذين يعانون من وقت مماثل.\nهذا إضافة على طريق اختيار هذا الموضوع من البريد الإلكتروني التي أرسلت في الماضي، يمكنك ان تدخل بسهولة.\nموضوع مربع الإدخال، وهو نوع والرسالة واحدة وإرسالها عبر البريد الإلكتروني مع هذا الموضوع في الماضي ينبثق، فقط اضغط عليه.\nالتاريخ سوف تواصل القيام بذلك عند تثبيت إضافة موضوع من هذا الموضوع قبل تثبيت إحدى الوظائف الإضافية لن يتم عرضه.\nإضافة إلى التاريخ ، والتشابه الوحيد هو أقل من قيمة مجموعة مقارنة للموضوع في التاريخ ، ثم انقر فوق إضافة.\nولذلك، سوف عن طريق تحديد قيمة تشابه 100 يمكن ان تضاف الى كل من التاريخ.",
        "pt-BR": "Quando você digita um assunto, o assunto é uma boa notícia para as pessoas com um tempo similar.\nEste add-on, selecionando o assunto do e-mail enviado no passado, você pode facilmente entrar.\nCaixa Assunto de entrada, algo do tipo e uma carta, enviada por e-mail com o assunto no passado aparece, basta clicar sobre ele.\nA história vai continuar a fazê-lo quando você instala um add um assunto do assunto antes de instalar um add-on não será exibido.\nPara adicionar à história, apenas semelhança é abaixo de um valor definido em relação ao tema da história, clique em Adicionar.\nPortanto, definindo um valor de similaridade de 100 serão adicionados à toda a história.",
        "ja": "件名を入力する時に、いつも似たような件名を付ける人に朗報です。\nこのアドオンは、過去に送信したメールの件名から候補を選択することで、簡単に入力することができます。\n件名入力ボックスで、一文字何かを入力すると、過去に送信したメール件名が、ポップアップするので、それをクリックするだけです。\nアドオンをインストールした時から件名を履歴化していきますので、アドオンをインストールする前の件名は、表示されません。\n履歴に追加する場合、履歴内の件名と比較して類似性設定値を下回る場合のみ、追加します。\n従って、類似性設定値を100にすることで、全て履歴に追加することになります。",
        "es": "Cuando se escribe un tema, el tema es una buena noticia para las personas con un tiempo similar.\nEste add-on al seleccionar el tema del correo electrónico enviado en el pasado, usted puede entrar fácilmente.\nCasilla de entrada, escriba algo y una letra, enviada por correo electrónico con el asunto en el pasado aparece, haga clic sobre él.\nLa historia continuará haciéndolo cuando se instala un complemento de un tema el tema antes de instalar un add-on no se mostrará.\nPara añadir a la historia, la similitud es sólo por debajo de un valor determinado en comparación con los sujetos de la historia, a continuación, haga clic en Agregar.\nPor lo tanto, mediante el establecimiento de un valor de similitud de 100 se añadirá a la historia."
    },
    "developer_comments": {
        "en-US": "Is scheduled to globalization.\nOrder history will be considered.",
        "ja": "国際化を予定しています。\n履歴順序を考慮します。"
    },
    "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/dweasysubject/edit",
    "guid": "{FFACB012-A78A-4ae1-8B20-43962EE778A2}",
    "has_eula": false,
    "has_privacy_policy": false,
    "homepage": {
        "ru": "http://homebase.gotdns.org/home/",
        "en-US": "http://homebase.gotdns.org/home/",
        "de": "http://homebase.gotdns.org/home/",
        "ko": "http://homebase.gotdns.org/home/",
        "zh-CN": "http://homebase.gotdns.org/home/",
        "ar": "http://homebase.gotdns.org/home/",
        "pt-BR": "http://homebase.gotdns.org/home/",
        "ja": "http://homebase.gotdns.org/home/index.php?option=com_content&view=article&id=97:thunderbird&catid=42:pc&Itemid=53",
        "es": "http://homebase.gotdns.org/home/"
    },
    "icon_url": "https://addons.thunderbird.net/user-media/addon_icons/333/333301-64.png?modified=1492343310",
    "icons": {
        "32": "https://addons.thunderbird.net/user-media/addon_icons/333/333301-32.png?modified=1492343310",
        "64": "https://addons.thunderbird.net/user-media/addon_icons/333/333301-64.png?modified=1492343310"
    },
    "is_disabled": false,
    "is_experimental": false,
    "is_featured": false,
    "is_source_public": true,
    "last_updated": "2011-09-23T09:45:09Z",
    "name": {
        "ru": "dwEasySubject",
        "fr": "dwEasySubject",
        "en-US": "dwEasySubject",
        "pt-PT": "dwEasySubject",
        "zh-TW": "dwEasySubject",
        "de": "dwEasySubject",
        "ko": "dwEasySubject",
        "it": "dwEasySubject",
        "zh-CN": "dwEasySubject",
        "ar": "dwEasySubject",
        "pt-BR": "dwEasySubject",
        "ja": "dwEasySubject",
        "es": "dwEasySubject",
        "he": "dwEasySubject"
    },
    "previews": [
        {
            "id": 61605,
            "caption": null,
            "image_size": [
                561,
                525
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/61/61605.png?modified=1530209060",
            "thumbnail_size": [
                214,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/61/61605.png?modified=1530209060"
        }
    ],
    "public_stats": false,
    "ratings": {
        "bayesian_average": 2.92089,
        "count": 4,
        "average": 3.5,
        "text_count": 0
    },
    "ratings_url": "https://addons.thunderbird.net/en-US/thunderbird/addon/dweasysubject/reviews/",
    "requires_payment": false,
    "review_url": "https://addons.thunderbird.net/en-US/reviewers/review/333301",
    "slug": "dweasysubject",
    "status": "public",
    "summary": {
        "ru": "Когда вы входите в пункт назначения, вы редактируете неполный адрес, почтовый поможет вам компенсировать последнее слово при использовании автозаполнения.\nВы можете ввести легким автозаполнения теме выбора отправляется в прошлое.",
        "fr": "Lorsque vous entrez une destination, vous modifiez une adresse incomplète, mailer vous aider à compenser le dernier mot par l'usage auto-complétion.\nVous pouvez entrer facilement par l'auto-complétion choix ligne d'objet envoyé dans le passé.",
        "en-US": "When you enter a destination, you are editing incomplete address, mailer help you compensate last word by use auto-complete. However, Subject is not used auto-complete. it is enter easy by auto-complete subject line choice sent in the past.",
        "pt-PT": "Quando você inserir um destino, que você está editando endereço incompleto, mailer ajudá-lo a compensar a última palavra pelo uso de auto-completar.\nVocê pode entrar fácil pela auto-complete escolha linha de assunto enviado no passado.",
        "zh-TW": "當你進入一個目的地，你正在編輯不完整的地址，郵件幫助您使用自動完成的最後一個字補償。\n您可以輸入容易送過去的主題行自動完成選擇。",
        "de": "Wenn Sie ein Ziel eingeben, die Sie bearbeiten, unvollständige Adresse, helfen Sie Mailer kompensieren letzte Wort durch Verwendung auto-complete.\nSie können durch auto-complete Betreffzeile Wahl in der Vergangenheit schickte einfach.",
        "ko": "당신이 목적지를 입력하면 불완전한 주소를 편집하고, 우편물은 사용 자동 완성 기능에 의해 마지막으로 단어를 보상하는 데 도움이됩니다.\n당신은 과거에 보낸 자동 완성 제목 라인의 선택에 의해 쉽게 입력할 수 있습니다.",
        "it": "Quando si entra in una destinazione, si sta modificando indirizzo incompleto,mailer aiutare a compensare l'ultima parola con l'uso auto-complete\nÈ possibile immettere facile con il completamento automatico scelta del soggetto riga inviata in passato",
        "zh-CN": "当你进入一个目的地，你正在编辑不完整的地址，邮件帮助您使用自动完成的最后一个字补偿。\n您可以输入容易送过去的主题行自动完成选择。",
        "ar": "عند إدخال الوجهة، وتقوم بتحرير عنوان غير مكتملة، الإرسال تساعدك على تعويض الكلمة الأخيرة عن طريق استخدام الإكمال التلقائي.\nيمكنك ان تدخل بسهولة عن طريق الإكمال التلقائي موضوع اختيار خط أرسلت في الماضي.",
        "pt-BR": "Quando você inserir um destino, que você está editando endereço incompleto, mailer ajudá-lo a compensar a última palavra pelo uso de auto-completar.\nVocê pode entrar fácil pela auto-complete escolha linha de assunto enviado no passado.",
        "ja": "メール作成の時に、送信先の入力では、補完してくれるのに、件名はしてくれません。\nそこで、メール件名を入力する時に、過去に送信した件名候補からオートコンプリートできるようにします。　事前に面倒な件名の登録作業もいりません。",
        "es": "Al introducir un destino, que se está editando la dirección incompleta, gestor de correo ayudan a compensar la última palabra por el uso de la función de autocompletar.\nUsted puede entrar fácil auto-completar la elección asunto enviado en el pasado.",
        "he": "בעת הזנת יעד, אתה עורך את כתובת מלאה, מיילר לעזור לך לפצות המילה האחרונה על ידי שימוש השלמה אוטומטית.\nאתה יכול להיכנס בקלות על ידי בחירה אוטומטית מלאה שכותרתה נשלח בעבר."
    },
    "support_email": {
        "en-US": "dangerouswoo@gmail.com",
        "ja": "dangerouswoo@gmail.com"
    },
    "support_url": {
        "en-US": "https://homebase.server-on.net/home/index.php?option=com_content&view=article&id=97:thunderbird&catid=42:pc&Itemid=53",
        "ja": "http://homebase.gotdns.org/home/"
    },
    "tags": [
        "auto",
        "autocomplete",
        "compose",
        "subject"
    ],
    "type": "extension",
    "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/dweasysubject/",
    "weekly_downloads": 21,
    "xpilib": {
        "ext_comp": {
            "mext": false,
            "compOther": true
        }
    }
}