[
    {
        "id": 1282191,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "16.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/1282191",
        "files": [
            {
                "id": 134725,
                "created": "2011-10-16T07:08:23Z",
                "hash": "sha256:4cbe400079f98e48c2e79c23d09046b470fafafd897779b7d8d3e8764e5990c5",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 231424,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/134725/attachmentextractor-1.3.5.1-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 3338,
            "name": {
                "en-US": "Mozilla Public License, version 2.0"
            },
            "text": {
                "en-US": "This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of the MPL was not distributed with this file, You can obtain one at <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/cfa1520767b4bc45590e23d48de7bec652c237ee0ad206608dfa16f2a0e21c8d/http%3A//mozilla.org/MPL/2.0/\">http://mozilla.org/MPL/2.0/</a>."
            },
            "url": "http://www.mozilla.org/MPL/2.0/"
        },
        "release_notes": {
            "en-US": "Just a very minor bug fix for a breaking change in Thunderbird7 (displayName was changed to name in the attachments object)."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.3.5.1",
        "version": "1.3.5.1"
    },
    {
        "id": 85954,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "6.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/85954",
        "files": [
            {
                "id": 71279,
                "created": "2009-11-29T09:34:13Z",
                "hash": "sha256:3f2cd6e9c6755692acd04b0f5f7eee93669f32a9b396a145d5a77b1529ea8ef3",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 231424,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/71279/attachmentextractor-1.3.5-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "<ul><li> bug fix: folder 'extract all' fails in TB2 [<a rel=\"nofollow\" href=\"/\">bug #131</a>]</li><li> bug fix: ~~~ was being apended to filenames in some cases [<a rel=\"nofollow\" href=\"/\">bug #138</a>]</li><li>bug fix: detach mode wasn't being respected for indivual attachment extract. [<a rel=\"nofollow\" href=\"/\">bug #153</a>]</li></ul>"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.3.5",
        "version": "1.3.5"
    },
    {
        "id": 69787,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0b2",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/69787",
        "files": [
            {
                "id": 54733,
                "created": "2009-06-06T03:08:35Z",
                "hash": "sha256:167ec1a143956897f7a7eaa43f09306e8219ba70af9f692985d704daa8b6902d",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 231424,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/54733/attachmentextractor-1.3.3-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "* bug fix: extracts all inbox attachments rather than just selected.  Bug also broken MRU menu on indivual extract. [bug #100]\n* bug fix: detaching multiple emails failed.  (Change in TB3) [bug #99]"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.3.3",
        "version": "1.3.3"
    },
    {
        "id": 69495,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0b2",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/69495",
        "files": [
            {
                "id": 54415,
                "created": "2009-06-01T13:22:37Z",
                "hash": "sha256:8af23f8c0f279e90c79c31b9512823b366a420d845c16b11eda93931189651b2",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 231424,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/54415/attachmentextractor-1.3.2-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "ru": "исправление ошибки:индивидуальное извлечение mru и обзор не работало",
            "en-US": "bug fix: individual extract MRU and browse broken"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.3.2",
        "version": "1.3.2"
    },
    {
        "id": 62899,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0b2",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/62899",
        "files": [
            {
                "id": 47225,
                "created": "2009-02-17T12:34:37Z",
                "hash": "sha256:6dc69117d3d920e8ba108298e6b4eeede12ce93aef0d9ba3d58eb5d31024b253",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 221184,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/47225/attachmentextractor-1.2.2-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "*improvement: stopped loading images in the background prior to saving them as this can be very slow, especially in Thunderbird 3. My tests showed an up to 200% boost by blocking images. Can be reenabled if nessecary by setting (hidden) preference attachmentextractor.dontloadimages to false.\n* bug fix: cleartag with autoextract now correctly clearing tag. [bug #36]\n* bug fix: Detaching failed on macOS (in 1.2.1 changelog, missing from release) [bug #59]\n* bug fix: Multiple email sequence fail (collision) with auto-extract. (in 1.2.1 changelog, missing from release) [bug #52]\n",
            "de": "Verbesserung: Schaltfläche für die neue hrd-Leisten-Schaltfläche in Thunderbird 3 hinzugefügt. \n* Verbesserung: AE sollte jetzt vollständig kompatibel zu Thunderbird 3 Beta 1 sein. \n* Verbesserung: Abgetrennte Anhänge werden jetzt gespeichert (undokumentierte Änderung in 1.2). \n* Verbesserung: #count#-Prüfung fügt #count# jetzt vor dem letzten \".\" ein, falls #extpart# (Dateiendung) nicht im Dateinamenmuster genutzt wird.\n* Verbesserung: Zusätzliche Merkmale hinzugefügt, die #date#-Anweisung (Zeitstempel) unterstützten ('N','w','y','a','A','g','h','U') - lesen Sie die Hinweise, um alle Details zu erfahren. \n* Änderung: Überprüfung auf neue Nachrichten sollte verlässlicher sein (undokumentierte Änderung in 1.2). \n* Fehlerkorrektur: Speichern von externen Anhängen schlug fehl, wenn die abgetrennte Date nicht existiert. [Bug #58]. \n* Fehlerkorrektur: Der zuletzt ausgewählte Ordner wird nicht aktualisiert, nachdem ein neuer Ordner ausgewählt wurde. [Bug#55]\n* Fehlerkorrektur: Abtrennen aller Unterordner in einen angegebenen Ordner funktionierte nicht - legte ausgewählte Nachricht stattdessen in angegebenem Ordner ab [Bug #40] (undokumentierte Änderung in 1.2) \n* Fehlerkorrektur: Abtrennen scheiterte unter Mac OS [Bug #59] \n* Fehlerkorrektur: Abtrennen aus einen leeren Ordner (auch wenn Unterordner E-Mails enthielten) führte zum Absturz von AE [Bug #60] \n* Fehlerkorrektur: Art und Weise, wie Beispieldatum im Einstellungsfenster berechnet wird, wurde geändert, um ein potentielles Problem mit nicht-englischen Sprachen zu lösen. \n* Fehlerkorrektur: Automatisches Abtrennen von mehreren Anhängen nacheinander scheiterte. [Bug #52] \n* Fehlerkorrektur: AE konnte eingebundenen Anhang (RFC 822) nicht abtrennen. [Bug #35]\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.2.2",
        "version": "1.2.2"
    },
    {
        "id": 58140,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "3.0a3",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/58140",
        "files": [
            {
                "id": 42125,
                "created": "2008-12-01T12:07:36Z",
                "hash": "sha256:416fe9aa93069181b41dddceb09df7b4740ab74cd8f1e922ebbb27d715142664",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 205824,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/42125/attachmentextractor_-1.2.0.1-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": " * improvement: AttachmentExtractor can now extract RSS feed attachments (enclosures).  A third progress bar for file download has been added for RSS.\n* improvement: added #folder# token to file name pattern.\n* improvement: moved all the entries in the 'tools' menu to more relevant menus for better integration. Also moved context menu items to be consistent.\n* improvement: rewrote the pattern settings tab to be more user friendly and self explainitory.  Some of the example can be modified to see how the pattern would change.  Moved the Date pattern to be in a seperate dialog.\n* improvement: added a 'add token' button to pattern settings dialog and patternextract dialog.\n* improvement: AE can now send out read-reciepts when mark-read, including optional preference overriding for 'ask me' settings.\n* improvement: added 'from' to html report generated [bug #2]\n* change: reworded reportgen settings text to indicate that an absolute path can be used as well as a relative one.\n* bug-fix: '\"Save message txt to file\" function does not work' fixed [bug #23]\n* bug-fix: 'files with extension *.K$$ are saved as *.K$' fixed [bug #24]\n* bug fix: 'huge security hole: javascript execution' fixed [bug #34]\n* bug-fix: AE deletes the content of .doc files [bug #30]\n* technical-change: rewrote some code in an iterative rather than recursive style and changed main classes to prototypes to try and speed up/reduce memory usage. Other code changes/optimisation.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.2.0.1",
        "version": "1.2.0.1"
    },
    {
        "id": 48344,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/48344",
        "files": [
            {
                "id": 31837,
                "created": "2008-06-23T15:29:50Z",
                "hash": "sha256:157fbac6ec16bc742759dc780d5797e69355f32f8cadcc3401ffb3f125992372",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 234496,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/31837/attachment_extractor-1.1.1-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "    * bug fix: fixed broken Japanese locale.\n    * bug fix: fixed context-menu not working .\n    * bug fix: both AE and Thunderbrowse were using the same coding shorthand (Cc and Ci).\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.1.1",
        "version": "1.1.1"
    },
    {
        "id": 44011,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/44011",
        "files": [
            {
                "id": 27448,
                "created": "2008-04-27T09:39:48Z",
                "hash": "sha256:2384a37675010be87e0a7e163b2c6f49275e4fd94aeddc6ea96afc7699403706",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 198656,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/27448/attachment_extractor-1.1-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "    * improvement: there is now the ability to execute an external application after extraction with the attachments saved.\n    * improvement: each attachment can be executed individually with their registered application also.\n    * improvement: there is an option to extract the email text/html also, with the same filename pattern options. Inline attachment code is changed to point to the saved attachment\n    * improvement: whole folder extraction can now optionally include sub-folders via an additional menu item.\n    * improvement: you can now specify an absolute path for the report name in ReportGen settings. The intention was always just to have a 'name' rather than a full path but given the frequent bug reports to me caused by people setting this incorrectly it seems to be a required feature. Settings gui will be changed in a later version to reflect this addition.\n    * improvement: with individual message extraction there is now progress text in the status bar text as there's no progress dialog.\n    * improvement: finished off adding MRU to everywhere (toolbar button, individual attachment context menu, etc).\n    * improvement: any user set preferences are saved to debug log every time to aid discovering problems.\n    * change: moved the specialised 'with custom filename pattern' default option into the custom filename pattern menu (when MRU is enabled) to reduce menu clutter.\n    * change: queued requests are now enabled by default. Its safer.\n    * bug fix: a broken aereport.html (e.g. blank) caused errors.\n    * bug fix: AE no longer activates twice if you use the toolbar button and select one of the MRU task items.\n    * bug fix: it was possible to enter a broken filename pattern in the custom dialog but not the settings dialog - put #count# fix in custom dialog too.\n    * bug fix: handled error in internal detaching code which should fix most of the error reports about messages being deleted when detaching. It won't reduce detaching failures but at least the message shouldn't disappear if it happens.\n    * bug fix: fixed an issue where detaching wouldn't work when the message wasn't deleted afterwards. Mainly seemed to affect IMAP.\n    * technical change: removed dependency on attachmentextractor-prefs.dtd in main overlays by relocating 'browse...' string to attachmentextractor.dtd.\n    * technical change: made the MRU menus dynamically disable/enable on every popup so I don't have to have a hard-coded list of elements to change.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.1",
        "version": "1.1"
    },
    {
        "id": 38996,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/38996",
        "files": [
            {
                "id": 22340,
                "created": "2008-01-01T08:42:31Z",
                "hash": "sha256:fbfb676d6fd3bc6701a04fde1b6f58fcbfe784bb1624b85d1ec6624b4a5e51b8",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 176128,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/22340/attachment_extractor-1.0.1-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "    * improvement: added the token #fromemail# to the possible patterns and changed #from# to only output the senders name rather than both.\n    * improvement: added some menu options in the Tools|Extract Attachments menu to just delete attachments without doing any extracting work.\n    * improvement: there's now an option to not extract if minimum file size not met, with AE file saving anyway.\n    * improvement: AE now skips emails without attachments (with auto-extract) - thanks to Lukas Durfina who suggested a quick way of avoiding loading the whole window for attachment-less messages.\n    * improvement: added settings gui to enable/disable queued requests.\n    * improvement: reduce time spent on empty emails - very slight change.\n    * improvement: added MRU folder list to the toolbar button as well as reworking the code to generate on the fly.\n    * change: worked around 'attachment sizes' incompatibility by changing the way the event 'onpopupshown' is handled.\n    * change: changed settings gui &amp; pref structure with attachment file saving so 'disable saving' is one of the check box items.\n    * bug fix: fixed auto extract not working when no active folder showing in main window.\n    * bug fix: fixed bug in Russian localisation (possibly non-Latin in general) when the MRU list was getting corrupted.\n    * bug fix: overcame a bug in Thunderbird where detached attachments with commas in the filenames weren't able to be opened.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.0.1",
        "version": "1.0.1"
    },
    {
        "id": 38408,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/38408",
        "files": [
            {
                "id": 21747,
                "created": "2007-12-09T07:10:24Z",
                "hash": "sha256:643271a5780dc15847070a53f1e84eed99fec405ec764981eb67782b8b29790f",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 177152,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/21747/attachment_extractor-1.0-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "1.0\n\n    * improvement: Added capability to use AttachmentExtractor on individual attachments in the attachment area in preview pane and message windows. Individual extracting doesn't delete or mark the message read afterwards but otherwise follows the same settings.\n    * improvement: AE's toolbar button is automatically added the first time you install AE if you've not already got it there. This will only happen once and if you remove it then it won't come back.\n    * improvement: The progress dialog now has progress bars as well as filenames and subjects. You can turn off the filenames and subject display in the settings dialog if you wish.\n    * improvement: Extraction requests can now be queued, rather than creating a new process. At the moment this isn't enable by default but can be by setting the preference attachmentextractor.queuerequests to true\n    * improvement: Invalid filename patterns, where the #count# token is missing, are 'fixed' automatically in the settings dialog so the user can't accidentally break AE.\n    * bug fix: fixed bug in clear MRU code which always cleared off the last MRU item either on restart or settings change.\n    * bug fix: not having a default TB download folder specified doesn't now cause problems.\n    * bug fix: AE will now fail silently if a RSS feed message or an external attachment (a previously detached attachment) is attempted."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/1.0",
        "version": "1.0"
    },
    {
        "id": 34842,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/34842",
        "files": [
            {
                "id": 18122,
                "created": "2007-08-01T16:07:55Z",
                "hash": "sha256:7f5875c223404ab650d56e330a265001335183bf225f205a90588461ac748547",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 163840,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/18122/attachment_extractor-0.9.6-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "    * improvement: Added settings gui to enable/disable MRU, which you can now do without restarting.\n    * improvement: You can now specify in the settings how many MRU folders you want to remember.\n    * improvement: MRU can be cleared with a clear button in the setting dialog.\n    * bug fix: Reorganised MRU code to minimize startup errors.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.9.6",
        "version": "0.9.6"
    },
    {
        "id": 34498,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/34498",
        "files": [
            {
                "id": 17775,
                "created": "2007-07-22T06:17:56Z",
                "hash": "sha256:2203f392df42ae13fa12427ac1b3209c645625cc3b8c50fcc8c64c351cc8d708",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 156672,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/17775/attachment_extractor-0.9.5.4-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "    * improvement: Now works properly with search folders.\n    * improvement: AE's toolbar button and menus now enable and disable based on the current selection.\n    * improvement: The toolbar button has been enhanced with a drop-drown menu for different options to be selected.\n    * improvement: Added a settings option to set the attachment saved date to the email date if required.\n    * improvement/bug fix: Works better with newsgroups. Used to truncate files sometimes.\n    * improvement: Added a 5 most recently used folders in a submenu to extract to again quickly. Enabled by default but There's no settings gui for it but can be disabled with the preference \"attachmentextract.savepathmru\". Requires a restart to disable/enable.\n    * improvement: The changelog loads off the website the first time AE is run or upgraded.\n    * improvement: Changed main overlay to use  tags rather than 'oncommand' attribute so I can enable/disable more efficiently.\n    * bug fix: fixed bug with \"'\" occurring in the attachment filename.\n    * bug fix: fixed bug with last used folder not being retrieved with folder selector dialogs.\n    * bug fix: slightly changed default sizes used for pref window, defined the em's rather than px's and let the user resize the window (when opened via tools menu).\n    * bug fix: fix a memory leak - by wrapping an object before I passed it to c++ code.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.9.5.4",
        "version": "0.9.5.4"
    },
    {
        "id": 32261,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/32261",
        "files": [
            {
                "id": 15492,
                "created": "2007-05-06T08:31:12Z",
                "hash": "sha256:3050a33416af74fff8594c06f51be24530e383ff4bde3d42fe970710f2c47010",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 130048,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/15492/attachment_extractor-0.9.1.1-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "    * improvement: replaced Thunderbird's file saving code with my own streaming code so I can control it and continue as soon as saving is complete. This is much more efficient than checking every few milliseconds if everything is done.\n    * improvement: enabled detach for auto-extract. Personally I thought it was a dangerous option to have but its been asked for so it can now be enabled, albeit with a strongly worded warning first.\n    * improvement: reports are now localised like the rest of the user interface.\n    * improvement: reorganised the settings dialog to make detach/deleting options more intuitive. Previously it needed 3 options in 2 different tabs to be checked to enable detaching.\n    * improvement: if desired, the actual saving part of AttachmentExtractor can be disabled.\n    * improvement: error logging to a file, (something enabled during development but disabled for release), can now be turned on with a preference.\n    * improvement: attachment files can now have their date set to the date of the email (only with AE's internal saving code). There's no gui in this version but you can set the preference attachmentextractor.setdatetoemail to true to enable.\n    * improvement: if there's an error in AttachmentExtractor then a message is now shown indicating that something has gone wrong.\n    * bug fix: rewrote main attachmentextractor class in an alternative coding style to fix a bug when sometimes getPref fails.\n    * bug fix: converting code for 0.8-0.9 include/exclude (user-defined) preferences was broken - it generated string in the form .ext rather than *.ext. Fixed for future versions and also reconverted from 0.9 to fix.\n    * bug fix: freezes were reported by some users so removed the fix in 0.9 (using download manager) and replaced with code to check if the attachment size is greater than 0 (i.e. has started extracting). Seems to work fine. If internal saving is enabled then this is skipped anyway.\n    * bug fix: compact folders being turned on broke AE if it happened to trigger during extraction so now the preference is disabled during extraction.\n    * contribution: Matteo F Zazzetta contributed a large amount (100+ lines) of code to handle generated filenames that are longer than 255 characters in windows, while maintaining the #count# strings properly.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.9.1.1",
        "version": "0.9.1.1"
    },
    {
        "id": 31447,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/31447",
        "files": [
            {
                "id": 14662,
                "created": "2007-04-09T15:10:34Z",
                "hash": "sha256:c5f10c24895c04a8e561acce0c006449de94586114cabc3e3b5b3ee8c135cd73",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 134144,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/14662/attachment_extractor-0.9-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "    * improvement: AttachmentExtractor can now auto-extract on email receipt, either individually or after all the messages have been downloaded. AttachmentExtractor can optionally only auto-extract when the email is tagged with a matching specified tag, and optionally clear that tag once the attachments have been saved.\n    * improvement: auto-extract has its own range of after-extract actions and a file replacement strategy, along with a optional separate download location.\n    * improvement: integrated a companion extension I wrote previously, ae_reportgen, directly into attachmentextractor. This extension generated a (x)html report every time attachment extractor was run. Either a new report is generated or the new extraction information is added to the previous report.\n    * improvement: report generation can be styled with a standard css style sheet that can be specified. Any existing report is updated with the current style sheet settings.\n    * improvement: regular expressions can now be specified directly for the include/exclude filename settings. Any pattern starting with \"/\" is treated as a reg-ex. They must be well formed or things will break so if you are clever enough to use them then use them with care!\n    * improvement: reworked cleanSubjectLine after Matteo F Zazzetta suggested an improved version.\n    * change: removed downloads.rdf delete on startup code as no longer necessary in tb2.0.\n    * change: changed separator character in include/exclude patterns to \";\" from \",\" as \",\" is a control character in reg-ex's.\n    * change: changed internal detaching code to reflect changes in nsMessenger, which its based upon.\n    * optimisation: optimised some of the images. shaved off 5k.\n    * bug fix: slightly reworking because changes in nsMessenger in between tb2 beta2 and tb2 rc1 versions broke AttachmentExtractor completely. Thanks guys!\n    * bug fix: the author &amp; subject strings are now filtered to stop # codes and folder separator characters from accidentally getting through. Double quotes in author are stored as \\\" thus they used to break the filename saving code.\n    * bug fix: attachments were sometimes cut short on large files so now the download manager is checked to only continue when all saving files have finished.\n    * contribution: Matteo F Zazzetta contributed a bug fix for a mistake in AttachmentFileMaker constructor.\n    * contribution: Matteo F Zazzetta contributed modified code in aewindow.js, adding try catch statements around some methods to help ae recover from single errors.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.9",
        "version": "0.9"
    },
    {
        "id": 30566,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0b2",
                "min": "1.5b"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/30566",
        "files": [
            {
                "id": 13769,
                "created": "2007-03-09T12:52:44Z",
                "hash": "sha256:450866d99442a466621094e7c7f806e5676741bba150f83857e6c7b82f610224",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 120832,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/13769/attachment_extractor-0.8-thunderbird.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "full changelog on website.\n\n    * improvement: replaced Thunderbird attachment detaching code with my own internal version written in Javascript. The 400-500 lines of C++ were rewritten by hand into JavaScript so it should work exactly the same way as Thunderbird's own, but without any pesky confirmation boxes.\n    * improvement: if the internal detaching is used then attachments can be 'detached' (deleted but a link left to the detached file) rather than just 'deleted'.\n    * improvement: upgraded the exclude/include settings that previously just checked file extensions to now test for whole filename string. Use the fairly straightforward windows *.* notation.\n    * improvement: rewrote quite a lot of the filename generating code. Technical explanation: rewrote the code in an iterative rather than recursive style. As much as I liked the mathematically correct concise recursive functions, this is the real world and some people have reported errors where Thunderbird is complaining about too much recursion.\n    * improvement: added a 'clean' subject example in settings dialog.\n    * bug-fix: fixed a potential (but unreported) but when extract to default is used without setting the default folder first.\n    * change: reduced default next message and next attachment delay times because there is more control over the processes now so I don't need so much tolerance. Speeded it up basically.\n    * change: reorganised the settings dialog into 3 different panes rather than 2. This is to move the (now) more advanced filename filtering options into advanced and to give filename patterns its own pane.\n    * contribution: ejo rewrote the settings dialog xul. This hasn't been used 'as is' due to a bug with tabbed panes but I have adopted parts of his contribution.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.8",
        "version": "0.8"
    },
    {
        "id": 29844,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/29844",
        "files": [
            {
                "id": 2759,
                "created": "2007-03-05T13:12:15Z",
                "hash": "sha256:73224eece023e5ffacc88099c776e2be5b62635556f3dc415d8d56b75b7e0c9d",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 102400,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2759/attachment_extractor-0.7.2.1-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "see changelog for full details."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.7.2.1",
        "version": "0.7.2.1"
    },
    {
        "id": 28590,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "2.0.0.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/28590",
        "files": [
            {
                "id": 2757,
                "created": "2007-03-05T13:12:15Z",
                "hash": "sha256:ad0f2e9533d0f3d738561449c31ae1aece5b18b139873bebd19643da3e67e558",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 101376,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2757/attachment_extractor-0.7-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": null,
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.7",
        "version": "0.7"
    },
    {
        "id": 12948,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/12948",
        "files": [
            {
                "id": 2756,
                "created": "2007-03-05T13:12:15Z",
                "hash": "sha256:db98a3ef47c16937de5799d0843aa4a3d7d3bdbeba09d67974607b43d1c39d7b",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 81920,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2756/attachment_extractor-0.6.5-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "changelog for 0.6.5:\n\n0.6.5\n* Not going to fix detaching for now as will require major rewrite.\n* improvement: Toolbar button. Left click to extract selected to default, right click to a folder you select.\n* improvement: Instead of using Thunderbird's default download folder, you can now set a special AE default folder\n* improvement: Animated progres dialog image :-)\n* improvement: You can now add the email subject (\"#subject#\") and email date (\"#date#\") into the filename pattern. Proper setting gui in next version, honest.\n* improvement: Attachment Extractor now always generates filenames using the filename pattern.\n* improvement: Added ability to specify filename pattern preference every time extraction is carried out via a new menu item.\n* localisation: Chinese Traditional locale contributed."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.6.5",
        "version": "0.6.5"
    },
    {
        "id": 11834,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.5"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/11834",
        "files": [
            {
                "id": 2755,
                "created": "2007-03-05T13:12:15Z",
                "hash": "sha256:2cc85eaa48140a3e36ed909fdeb066bbe9da25963188f5a7ba631a7223289d7d",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 52224,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2755/attachment_extractor-0.6-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "see homepage for changelog."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.6",
        "version": "0.6"
    },
    {
        "id": 11125,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "1.5",
                "min": "0.8"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/11125",
        "files": [
            {
                "id": 2754,
                "created": "2007-03-05T13:12:15Z",
                "hash": "sha256:50b988ee3271cf71eed87c46c05cf6089a76954a4187a4bdb8ffed3ec3dbcecf",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 41984,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2754/attachment_extractor-0.5.2-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Detaching is disabled because its broken."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.5.2",
        "version": "0.5.2"
    },
    {
        "id": 6061,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "1.0+",
                "min": "0.8"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/6061",
        "files": [
            {
                "id": 2753,
                "created": "2007-03-05T13:12:15Z",
                "hash": "sha256:64ecbd83a2e232f4c4900dfbf3f6dd456d514c8336e8e6790e55f3276633e1a2",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 38912,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2753/attachment_extractor-0.5-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": null,
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.5",
        "version": "0.5"
    },
    {
        "id": 2461,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "1.0+",
                "min": "0.8"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/2461",
        "files": [
            {
                "id": 2752,
                "created": "2007-03-05T13:12:15Z",
                "hash": "sha256:f371cce99672ead3942c91fc3f4cc4ed985a6c2e6ca869bf53c3549bab226f8b",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 33792,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2752/attachment_extractor-0.4-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "New: Notifies you when its done extracting, if more than 1 message is selected.\nSee my website for full change-log."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.4",
        "version": "0.4"
    },
    {
        "id": 1914,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "1.0",
                "min": "0.7"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/attachmentextractor/versions/1914",
        "files": [
            {
                "id": 2751,
                "created": "2007-03-05T13:12:15Z",
                "hash": "sha256:f3d7baee7ceaabc5d1e2d3a7586e85d64d4177c17f7408ad3ced3754b7525cfa",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 29696,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2751/attachment_extractor-0.3.2-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": null,
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/attachmentextractor/versions/0.3.2",
        "version": "0.3.2"
    }
]