[
    {
        "id": 2473229,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "73.0",
                "min": "68.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/zoiper-thunderbird-plugin/versions/2473229",
        "files": [
            {
                "id": 1016341,
                "created": "2020-01-17T18:55:46Z",
                "hash": "sha256:33ab8197bd3c1af9177cf27417d02bf1c2572883157404667f60e682b1ad94b2",
                "is_restart_required": true,
                "is_webextension": true,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 9601,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/1016341/zoiper_thunderbird_plugin-2.0-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 6361,
            "name": {
                "en-US": "Zoiper standard terms and conditions"
            },
            "text": {
                "en-US": "Zoiper Standard Terms and Conditions\n\nI. ACCEPTANCE OF TERMS\n\nThese ZOIPER STANDARD TERMS AND CONDITIONS are a bonding contract between SECURAX EOOD (hereinafter referred to as “Licensor”), a company duly organized under the laws of Bulgaria, with registration number (registered under Bulgaria’s National Tax Register) BG131273941, with its business address at 33 Simeonovsko shose, fl.4, office 8,1700 Sofia, Bulgaria and you (hereinafter referred to as “Licensee”), who is:\n\n(i) the company entering into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(ii) the natural person entering into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(iii) the legal person who on behalf of the company enters into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(iv) the natural person who on behalf of the company enters into these ZOIPER STANDARD TERMS AND CONDITIONS;\nand who is (i) a company (or representing a company) requesting Licensor’s Services and Licensor’s Software Licensing or developing the Licensee’s Application or, who is (ii) the natural person, requesting Licensor’s Services and Licensor’s Software Licensing or developing the Licensee’s Application.\n\nLICENSEE SHOULD READ THESE ZOIPER STANDARD TERMS AND CONDITIONS CAREFULLY, IN THEIR ENTIRETY PRIOR TO ACCESSING AND/OR USING THE SOFTWARE.\n\nBY INSTALLING, DOWNLOADING AND/OR USING THIS SOFTWARE OR LICENSOR’S SERVICES OR AUTHORIZING OTHERS TO DO SO, ON BEHALF OF LICENSEE AND THE ENTITY FROM WHOM LICENSEE IS INSTALLING, DOWNLOADING AND/OR USING THE SOFTWARE, LICENSEE AGREES TO THESE ZOIPER STANDARD TERMS AND CONDITIONS AND CREATES A BINDING CONTRACT BETWEEN LICENSEE AND LICENSOR.\n\nANY USE OF THE SOFTWARE WILL CONSTITUTE LICENSEE’S ASSENT TO THESE ZOIPER STANDARD TERMS AND CONDITIONS (OR RATIFICATION OF PREVIOUS CONSENT).\nII. APPLICABILITY\n\nTHESE ZOIPER STANDARD TERMS AND CONDITIONS FORM AN INTEGRAL PART OF EACH CONTRACT BETWEEN LICENSOR AND LICENSEE AND APPLY TO ALL SUBSEQUENT CONTRACTS RESULTING FROM OR LEADING TO CONTRACT/S, AND TO ALL QUOTATIONS, OFFERS, LETTERS OF INTENT, ORDERS, ORDER CONFIRMATIONS AND OTHER DOCUMENTS AND ACTS MADE AND/OR DONE IN PREPARATION FOR AND/OR PRIOR TO AND/OR IN CONNECTION WITH CONTRACT/S.\n\nIn the event of conflict between the ZOIPER STANDARD TERMS AND CONDITIONS and the provisions of a Contract between the Parties, the provisions of the Contract will prevail.\n\nThe most recent version of the ZOIPER STANDARD TERMS AND CONDITIONS is applicable. The most recent version may be uploaded and found on Licensor’s website.\nIII. DEFINITIONS\n\n1. “Contract/s” is separate written agreement/s between Licensor and Licensee, and could be relating to without limitation: product usage, product licensing, and/or services.\n\n2. “Effective date” means the date a Contract is signed in hardcopy by Licensee or, in the absence of hardcopy or signature, the Contract shall be effective from the date an order/purchase is placed by Licensee.\n\n3. “Extension date” means: (i) the date of the anniversary of the Effective date and (ii) the date of the extension of a Contract between the Parties, according to the Contract’s extension terms and conditions.\n\n4. “Contract year” means (i) the period of one (1) year commencing on the Effective date and continuing until the Extension date and (ii) the period of one (1) year between Extension dates.\n\n5. “Parties” means both together Licensee and Licensor, and “Party” means either Licensee or Licensor separately.\n\n6. “Third Party/s” – means party/parties that is/are neither Licensor nor Licensee, and could be without limitation: (i) party/parties providing services, hardware, software, (ii) government institutions and/or authorities, (iii) servers hardware, software, and/or server-related services providers – VoIP and/or WEB, (iv) any equipment and/or infrastructure hardware, software, and/or service providers, (v) the third parties who own and/or administer the Online Distribution Stores.\n\n7. “End-user” – means a consumer and a natural person obtaining the Software and/or the Services.\n\n8. “Licensor’s Product/s”– means Licensor’s Zoiper software application/s subject to these ZOIPER STANDARD TERMS AND CONDITIONS and subject to Contract/s between the Parties, and available for free or for paid download through Licensor’s Official Distribution Channels, and the Documentation related to Licensor’s Products.\n\n9. “Online Distribution Stores” – the Third Party managed Online Distribution Stores where Licensor’s Product and/or the Software are uploaded to in order to be made available to End-users. For the purposes of the relationship between the Parties, the Online Distribution Stores include but are not limited to:\n\na) Google play application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/0a1d20e1dda9c808535d7d23e8551feebc5eaebfd581957e882809aa74aa59c3/https%3A//play.google.com\">https://play.google.com</a> ),\n\nb) Apple’s iTunes application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/e0b7f788a860e31bc3abe7cee616b02826abf993d9422c775a576702fbc5c327/https%3A//itunes.apple.com\">https://itunes.apple.com</a> ),\n\nc) Windows Phone application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/9a2a82d55ac64093c5b7e71ccf6a1bb9707f4b2fd7f7670377d95d229d38b8eb/http%3A//www.windowsphone.com/en-us/store\">http://www.windowsphone.com/en-us/store</a> ).\n\nLicensor is not affiliated to any of the Third parties managing and/or administrating the Online Distribution Stores. The web addresses to the Third Party Online Distribution Stores provided herein are for informational purposes only and changes may apply. Licensor bears no responsibility for any of the Third parties’ actions, including without limitation: the Third parties’ applying any changes to their Online Distribution Stores, including without limitation: changing their web addresses, their upload/download Online distribution store policies, and/or any of their policies and requirements, including without limitation: requirements for uploading and approving applications.\n\n10. “SDK” – means Licensor’s Software Development Kit and all related Documentation\n\n11. “Documentation” means any technical or specifications or documentation that Licensor may make available or provide to Licensee relating to, or for use in, or with, the Software, including without limitation: SDK documentation, programmer guides, manuals, materials and information appropriate or necessary for use in connection with the Software.\n\n12. “SOW” – stands for Statement Of Work and is a document constituting the entire requirements (and no other requirements) of Licensee related to customization of Licensor’s Product/s.\n\n13. “Software” – for the purposes of these ZOIPER STANDARD TERMS AND CONDITIONS and for the purposes of Contract/s between the Parties, the definition “Software” means either one or all of the definitions below, and is applicable to the entire relationship between the Parties. “Software” could mean all or either one of the following, whichever is applicable to Contract/s between the Parties:\n\na) “SOW Software” – Licensor’s Product/s modified as per the SOW;\n\nb) “SDK Software” means Licensor’s proprietary product: software and files, which may contain either one or a combination of several or all: object code, software libraries, source code, executables, Application Programming Interfaces, software tools, specifications and example source code, and the related to the SDK Software documentation,\n\nc) “Licensor’s Product/s”.\n\n14. “Build” – is a Software file with the following possible extensions (when applicable): .apk for Android,.ipa for iOS, .xap for Windows Phone, .exe for Windows, .dmg for Mac OS X, .tar for Linux, or a compressed file with any of the extensions listed herein.\n\n15. “Services” – means maintenance, technical support, customization services, branding, or any other services performed or to be performed, if any, by Licensor as per Contract/s between the Parties. Some Services require a separate SOW to be executed between the Parties.\n\n16. “Customization” means mutually agreed with Contract/s between the Parties modification to the Software, applied or to be applied by Licensor, resulting in change of the behavior and/or the graphical user interface of Licensor’s Product/s.\n\n17. “Licensee’s software” means one of these definitions or all:\n\na) the application that Licensee has the right to develop, in which the Software will be incorporated. In relation to this definition, “Licensee’s application” means one or more software programs developed by Licensee under Licensee’s trademark or brand and which will be provided to End-users’ computers, tablets and smartphones.\n\n18. “Licensor’s Official Distribution Channels” are (i) Licensor’s website: <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/ac4da812f8031413ca4aa9de971d20669f64db64b8f8949579ecb5bd0c848cd4/http%3A//www.zoiper.com\">www.zoiper.com</a> , and (ii) the Online Distribution Stores.\n\n19. “Confidential Information” means information disclosed, or to be disclosed, by Licensee or Licensor under Contract/s between the Parties, including without limitation: Licensor’s Software information, Software documentation, Software example, SDK documentation, SDK versions, information regarding Licensee’s or Licensor’s technical plans, marketing and financial data.\n\n20. ”Day/s” – means business day/s outside of Licensor’s location Holidays and outside of weekend days as per Licensor’s headquarters address.\n\n21. “Hour/s” – means business hour/s, and where hours are not specified, they shall be considered business hours.\n\n22. “Activation Credentials” means the identification information, e.g. username and/or password, or certificate, used to identify Licensee’s use or the End-users’ utilizing Licensee’s services use of the Software.\n\n23. “Update” – the act of applying a patch or point release (i.e. update version 4.1 to version 4.2) to fix or improve existing functionality, also without limitation: bug fixes, modifications, enhancements, supplements.\n\n24. “Updated Version” – an updated Build of the Software.\n\n25. “Updates License” – means the right to request and receive Updated Versions of the Software twice per contract year per Software during the term of Contract/s with which Licensor provides an Updates License to Licensee, if such contract is signed between the Parties.\n\n26. “Updated Versions Pool” – means the set allowance of two Updated Versions per Software per Updates License of the Software for the period of one (1) contract year during the term of Contract/s with which Licensor provides an Updates License to Licensee, if such contract is signed between the Parties.\n\n27. “New Licensor’s Product Release Version” – an updated build of Licensor’s Product\n\n28. “Upgrade” – means the act of moving from one major release to another (i.e. upgrade from Release 4 to Release 5) during the term of Contract/s with which Licensor provides Upgrades to Licensee, if such contract is signed between the Parties.\n\nUpgrades may involve changes in data structures, program processes, general interface changes, and therefore are more likely to impact a functioning application than an update.\n\n29. “Upgraded Version” means an Upgraded Version of the Software\n\n30. “Fault” – a malfunction of the Software where (i) the faulty behaviour has business impact on a production or test system, restraining at least 10% of Licensee’s end-users or testers to use the Software for making or receiving calls; and (ii) is reproducible on a clean install of the operating system in Licensee’s and Licensor’s environments, independent of specific environment setups; and (iii) occurs regardless of the end-device, the version of the mobile operating system or the server mode, firmware revision or configuration; and (iv) is independent of specific environment setups, third-party hardware, peripherals and/or drivers; and (v) is particularly limited to the licensor product’s standard engine and standard interface.\n\nSEVERITY CLASSIFICATION OF THE FAULTS:\n\nThe Severity Classification of the Faults is intended to describe the severity of the Fault:\n\na) “Critical Fault” – is a Critical Severity Fault of the Software, violating RFC 3261 (SIP) and/or RFC 3550 (RTP), where the faulty behaviour has significant to critical business impact on a production system and is resulting in Licensee’s production system to being either down, or functioning at a significantly reduced capacity\n\nb) “Medium Fault” is a Medium Severity Fault of the Software that has some business impact on a production system, resulting in some functionality loss on Licensee’s production system. The Software is usable, but does not provide a function in a convenient or expeditious manner.\n\nc) “Low Fault” – a Low Severity Fault of the Software occurring in test or non- production environments and is related to questions and issues including general usage questions, issues related to a test or non-production environment, or feature requests. There is no impact on the quality, performance or functionality on Licensee’s production system.\n\n31. “Stock-version of an operating system” – non-modified version of an operating system, as provided by either of the manufacturers, namely: Microsoft, Google, Apple, and without Third Party modifications by device manufacturers.\n\n32. “Purchase Order” means an order issued by Licensee to Licensor for Software or Services to be purchased, licensed or provided under a TERMS OF SALE Contract or under Contract/s between the Parties.\n\n33. “Proforma Invoice” is a document, issued by Licensor, preceding Licensee’s payment towards Licensor and indicating Licensee’s due amounts for payment. In the absence of a Proforma Invoice all other indication methods apply. The absence of a Proforma Invoice does not release Licensee of Licensee’s payment obligations.\n\n34. “Distributable software” means the Software in the form of binary object files, software library, linkable object files or dynamic link library, and/or executable files.\n\n35. “Example Source Code” means example software program in source code format or a sample source code included in the SDK, provided the source code is compiled into a software program and is not distributed in human-readable form.\n\n36. “API” means the Zoiper Application Programming Interfaces contained in the Software, including documentation, header files and related information.\nIV. CONFIDENTIALITY\n\nLicensee acknowledges that the Software and any other technical and/or commercial information not in the public domain obtained by Licensee are regarded as confidential by Licensor.\n\nAny Activation Credentials issued by Licensor to Licensee are confidential and shall be treated in accordance with these ZOIPER STANDARD TERMS AND CONDITIONS or any Mutual Non-Disclosure Agreement (“MNDA”) signed between the Parties or Contract/s signed between the Parties. Licensee agrees to take all reasonable measures to protect all Confidential Information including the Software, Documentation, Activation Credentials using at least the same degree of care that Licensee protects its own confidential information, however not less than a reasonable degree of care.\n\nLicensee agrees to use the Confidential Information and the Activation Credentials solely for the purpose of exercising Licensee’s rights and performing Licensees obligations under the business relationship between Licensee and Licensor, and Licensee agrees (i) to not disclose the Confidential Information to any Third Party and (ii) to not use the Confidential Information or the Activation Credentials for any other purpose, without Licensor’s prior written notice of consent.\n\nLicensee agrees not to permit or authorize access to, or disclosure of the Software to any person or entity other than employees of Licensee who (i) have signed in writing to be bound by these ZOIPER STANDARD TERMS AND CONDITIONS and who (ii) have a need to access the Software for the performance of Licensee’s rights and obligations. Licensee shall take appropriate measures by instruction and agreement prior to disclose to such employees to assure against unauthorized use or disclosure.\n\nAny applicable distribution rights will be governed by an additional contract for distribution license rights.\n\nAny press release or publication regarding these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties is subject to prior review and written approval by Licensor.\n\nThe obligations of confidentiality shall not apply to information which has entered the public domain except where such entry is the result of Licensee’s breach of these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties, or is required to be disclosed pursuant to a court order, so long as Licensor is given adequate notice and the ability to challenge such required disclosure.\n\nIf a MNDA is signed between the Parties prior to applying of these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties, (i) the confidentiality relationship between the Parties is subject to the MNDA, (ii) the MNDA signed between the parties prior to these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract becomes an integral part of these ZOIPER STANDARD TERMS AND CONDITIONS and Contract/s between the Parties, (iii) in case of conflict between the MNDA and this CONFIDENTIALITY clause, the MNDA will take predominance.\n\nV. PROPRIETARY SOFTWARE\n\nLicensor’s Products are closed source software. No portions of any of Licensor’s Products source code will be made available to Licensee.\n\nVI. TRADEMARK\n\n“Zoiper” is a registered trade mark and all applicable laws in relation to protection and use of Zoiper’s trademark apply.\n\nVII. OWNERSHIP AND INTELLECTUAL PROPERTY RIGHTS\n\nAll ownership and intellectual property rights in the Software and any copies or derivative works thereof (regardless of form or media in or which the original copies may exist), including but not limited to patents, design rights, copyrights, trademarks, trade-secrets and proprietary know-how, shall be owned by and vested in Licensor and nothing in these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties shall constitute or be interpreted as a transfer of such rights from Licensor to Licensee.\n\nLicensee acknowledges that the structure and the source code of the Software are valuable trade secrets of Licensor and shall remain the sole property of Licensor.\n\nVIII. COPYRIGHT AND INTELLECTUAL PROPERTY NOTICES\n\nCertain software programs or libraries included in the Software may contain software (including open source software) distributed under Third Party agreements (“Third Party Components”), which may contain terms that expand or limit rights to use certain portions of the Software (“Third Party Terms”).\n\nAny use, reproduction and distribution of components of the Software licensed under an open source software license are governed solely by the terms of such open source software license and not to these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties.\n\nLicensor’s intellectual property right and copyright notices as per Licensor’s sole discretion are and shall be integral part of the “About box” of the Software, together with the following Third Party copyrights information:\n\nTHIRD PARTY TECHNOLOGIES THAT ARE OR MAY BE USED BY LICENSOR’S PRODUCT/S:\n\n    Securax EOOD\n    JThread, Copyright (C) 2000-2005 Jori Liesenborgs (jori@lumumba.uhasselt.be)\n    JRTPLIB, part of JRTPLIB Copyright (C) 1999-2005 Jori Liesenborgs\n    GSM, Copyright 1992, 1993, 1994 by Jutta Degener and Carsten Bormann, Technische Universitaet Berlin\n    iLBC, iLBC Speech Coder ANSI-C Source Code iLBC_define.h Copyright (C) The Internet Society (2004). All Rights Reserved.\n    SPEEX The Xiph OSC and the Speex Parrot logos are trademarks (TM) of <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/39820572d7164f0b84796aed13521d9e02a4ee193c87c928d344d269e850e69b/http%3A//Xiph.Org\">Xiph.Org</a>\n    OpenLDAP, Copyright 1999-2003 The OpenLDAP Foundation, Redwood City, California, USA. All Rights Reserved.\n    PortAudio, Copyright (C) 1999-2002 Ross Bencina and Phil Burk\n    PortMixer, PortMixer, Windows WMME Implementation, Copyright (C) 2002, Written by Dominic Mazzoni and Augustus Saunders\n    Resiprocate, The Vovida license The Vovida Software License, Version 1.0, Copyright (C) 2000 Vovida Networks, Inc. All rights reserved.\n    This product includes cryptographic software written by Eric Young (eay@cryptsoft.com)\n    This product includes software written by Tim Hudson (tjh@cryptsoft.com)\n    This product is using the gloox XMPP library - Copyright by Jakob Schroeter\n    This product is using ReorderListBox written by Jason Gincherau\n    This product is using <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/18b679f066fcfbbd112ac31f4601ce8a6e2c9c6ac5319244783d024d360d1721/http%3A//ZXing.net\">ZXing.net</a> written by Michael Jahn\n    This product is using Coding4Fun Toolkit\n    This product is using C# port of libphonenumber by Erez A. Korn (<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/1b16cdbf7c883dc6dc74142cb484f1e9df82f758fb8d28a09e4860d150aaffe3/https%3A//github.com/erezak\">https://github.com/erezak</a>)\n\nIf Licensee is entitled to an Update of the Software and if the Software includes additional Third Party technology, Licensor has the right to add to the “About box” the additional intellectual property right information and copyright information, and, when handled by Licensee, Licensee is obliged to update the “About box”.\n\nLicensee shall not remove, obscure or alter proprietary rights notices (including without limitation: copyright and trademark notices) that may be in the copies of the Software.\n\nRedistribution in binary form, to the extent permitted by Contract/s between the Parties, must also reproduce Licensor’s copyright as well as Third Party copyrights incorporated in the Software, trademark or other Licensor or Third Party proprietary notices as incorporated in the Software in any associated Documentation or startup application images “Splash screens” or “About box” that display Licensee copyright notices.\n\nInformation identifying the copyright holders of the Third Party Components and the Third Party Terms that apply are available in the Documentation and/or in these ZOIPER STANDARD TERMS AND CONDITIONS and/or in Contract/s between the Parties.\n\nIX. NO TRANSFER OF INTELLECTUAL PROPERTY RIGHTS\n\nExcept for the rights granted by Licensor to Licensee with Contract/s, no other rights, including without limitation: no intellectual property and/or no intellectual property rights, are transferred to Licensee.\n\nX. NON-ASSERTION BY LICENSEE\n\nLicensee agrees not to assert in any way any patent owned by Licensee arising out of or in connection with this Software or modifications made thereto or applications developed using the Software against Licensor, Licensor’s subsidiaries and/or affiliates and/or their customers, direct or indirect, agents and contractors (collectively, the “Licensor Product Users”) for the manufacture, use, import, licensing, offer for sale or sale of any Licensor’s Products.\n\nXI. LIMITED WARRANTY\n1. NO SOFTWARE WARRANTY\n\nLICENSOR PROVIDES AND LICENSES THE SOFTWARE (AND/OR THE SOURCE CODE EXAMPLES IF APPLICABLE) “AS IS”. LICENSOR MAKES NO REPRESENTATIONS OR WARRANTIES AND THERE ARE NO CONDITIONS, ENDORSEMENTS, GUARANTEES, REPRESENTATIONS OR WARRANTIES OF ANY KIND EITHER EXPRESS OR IMPLIED, (INCLUDING WITHOUT LIMITATION ANY EXPRESS OR IMPLIED WARRANTIES OR CONDITIONS OF QUALITY, PERFORMANCE, RESULTS, FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY, MERCHANTABLE QUALITY, DURABILITY, TITLE, NON-INFRINGEMENT OR ARISING BY STATUTE OR OTHERWISE IN LAW OR FROM A COURSE OF DEALING OR USAGE OF THE TRADE) ARISING OUT OF OR RELATED TO THESE ZOIPER STANDARD TERMS AND CONDITIONS AND/OR AN EXISTING CONTRACT OR VALID TERMS BETWEEN THE PARTIES OR ARISING OUT OF OR RELATED TO ANY SOFTWARE, SOFTWARE INFORMATION OR THEIR PERFORMANCE OR FAILURE TO PERFORM.\n\nLICENSEE AGREES TO ASSUME ALL RISKS ASSOCIATED WITH LICENSEE AND LICENSEE’S AUTHORIZED USERS’ USE OF THE SOFTWARE. LICENSEE IS RESPONSIBLE FOR TAKING PRECAUTIONARY MEASURES TO PREVENT THE LOSS OR DESTRUCTION OF LICENSEE’S DATA AND DATABASES SUCH AS, FOR EXAMPLE MAKING REGULAR BACKUPS AND VERIFYING THE RESULTS OBTAINED FROM ANY SOFTWARE’S, AND LICENSOR WILL HAVE NO OBLIGATIONS OR LIABILITY WHATSOEVER WITH RESPECT TO ANY SUCH LOSS OR DESTRUCTION.\n\n2. LIMITED SERVICES WARRANTY\n\nSERVICES PROVIDED WITH CONTRACT/S BETWEEN THE PARTIES SHALL BE PERFORMED IN A WORKMANLIKE MANNER CONSISTENT WITH INDUSTRY STANDARDS.\n\nLICENSEE MUST NOTIFY LICENSOR PROMPTLY, BUT IN NO EVENT MORE THAN FOURTEEN (14) DAYS AFTER COMPLETION OF THE SERVICES, OF ANY CLAIMED BREACH OF THIS WARRANTY.\n\nLICENSEE’S SOLE AND EXCLUSIVE REMEDY FOR BREACH OF THIS WARRANTY SHALL BE, AT LICENSOR’S OPTION, RE-PERFORMANCE OF THE SERVICES, OR TERMINATION OF THE CONTRACT/S AND THESE ZOIPER STANDARD TERMS AND CONDITIONS, OR THE APPLICABLE SERVICE AND RETURN OF THE SERVICE FEES PAID TO LICENSOR BY LICENSEE FOR SUCH NON-CONFORMING SERVICE. THE PROVISION OF SERVICES UNDER CONTRACT/S BETWEEN THE PARTIES OR THESE ZOIPER STANDARD TERMS AND CONDITIONS DO NOT EXTEND THE WARRANTIES PROVIDED WITH ANY SOFTWARE ORDERED/PURCHASED BY LICENSEE.\n\nXII. PUBLICITY\n\nUnless otherwise prohibited in writing between the Parties, these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties give either Party the right to use for marketing purposes the other Party’s trade names, trademarks, service marks, domain names, and/or other distinctive brand features, except as may be contained in the Software.\n\nXIII. USE OF BRAND NAMES, TRADEMARKS, LOGOS\n\nWhen agreed in writing between the PARTIES, the PARTIES may, initiate mutual positive marketing campaigns, execute mutual marketing efforts, including without limitation, link to each other’s websites, create and distribute press releases, reference to the other Party, and execute other positive marketing practices.\n\nWith respect to mutual positive marketing campaigns and referencing, the Parties agree as follows:\n\n(a) each Party agrees to use the brands, trademarks, logos, and all information and mentions of the other Party’s brand name and services in good faith and solely with the purpose of the business relationship between the Parties and\n\n(b) upon confirmation of the mutual positive marketing campaign by each Party, each Party provides the right of use of its brands, trademarks, logos of the Party’s brand name and services for the purposes of the positive marketing campaign. This right can be terminated for whatever reason by the Party providing this right with five (5) business days’ notice send by certified mail to the address provided by the Party obtaining the right in the separate written agreement, return receipt required, to the Party obtaining the right. In case of such termination of this right, the Party obtaining the right should cease the use of the brands, trademarks, logos, and all information and mentions of the other Party’s brand name and services within five (5) business days following receipt of such notice.\n\nLicensee is responsible and liable for all the intellectual property rights and copyrights, related to the used materials, for example without limitation: logos, images, trademarks, provided to Licensor by Licensee to be used for the performance of activities governed by Contract/s between the Parties.\n\nXIV. LIMITATION, EXCLUSION OF LIABILITY AND INDEMNIFICATION\n\nREFERENCES TO LIABILITY IN THIS LIMITATION, EXCLUSION OF LIABILITY AND INDEMNIFICATION SECTION INCLUDES WITHOUT LIMITATION: LIABILITY ARISING FROM AGREEMENT, CONTRACT, TORT (INCLUDING NEGLIGENCE), UNDER ANY INDEMNITY, STRICT LIABILITY OR OTHERWISE, IN EACH CASE EVEN IF LICENSOR HAS BEEN INFORMED OF THE POSSIBILITY OF THAT LIABILITY.\n\nSOME STATES AND COUNTRIES, INCLUDING MEMBER COUNTRIES OF THE EUROPEAN UNION, DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES AND, THEREFORE, THE FOLLOWING LIMITATION OR EXCLUSION MAY NOT APPLY IN THOSE STATES AND COUNTRIES.\n\nTO THE MAXIMUM EXTENT PERMITTED BY THE APPLICABLE LAW AND REGARDLESS OF WHETHER ANY REMEDY SET OUT HEREIN FAIL OF THEIR ESSENTIAL PURPOSE, IN NO EVENT SHALL LICENSOR BE LIABLE TO LICENSEE FOR ANY SPECIAL, CONSEQUENTIAL, INDIRECT OR SIMILAR DAMAGES OR LOSS OF PROFITS, REVENUE, TOLL FRAUD, BUSINESS SAVINGS OR GOODWILL, REPUTATION, DATA, FEES, EXPENSES OF ANY KIND OR NATURE, LICENSEE’S OBLIGATION TO COMPENSATE A THIRD PARTY, ARISING OUT OF THE PURCHASE OR INABILITY TO PURCHASE THE SOFTWARE EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nNOTWITHSTANDING ANY OTHER PROVISIONS IN THESE ZOIPER STANDARD TERMS AND CONDITIONS OR AN EXISTING CONTRACT OR VALID TERMS BETWEEN THE PARTIES, IF ENFORCED BY THE APPLICABLE LAW, LICENSOR’S LIABILITY TO LICENSEE SHALL BE LIMITED TO THE AMOUNTS PAID BY LICENSEE TO LICENSOR FOR THE SPECIFIC SOW SOFTWARE OR FOR THE SPECIFIC SDK SOFTWARE OR FOR THE SPECIFIC LICENSOR’S PRODUCT OR FOR THE SPECIFIC SERVICE FOR A SPECIFIC SOW SOFTWARE OR SDK SOFTWARE, AND EXCLUDING (I) PAYMENTS TO THIRD PARTIES AND (II) THIRD-PARTY LICENSE FEES AND (III) ADDITIONAL EXPENSES MADE TO THIRD PARTIES, SUCH AS BUT NOT LIMITED TO THIRD-PARTY COMPANIES FOR PERFORMANCE OF EITHER PARTY’S SERVICES.\n\nNOTHING HEREIN LIMITS OR EXCLUDES THE LIABILITY OF LICENSEE TO LICENSOR ARISING OUT OF (I) LICENSEE’S BREACH OF THESE ZOIPER STANDARD TERMS AND CONDITIONS; (II) LICENSEE’S BREACH OF ANY CONTRACT BETWEEN THE PARTIES; (III) LICENSEE’S BREACH OF LICENSE AGREEMENT BETWEEN THE PARTIES, AND/OR (III) ANY AMOUNTS DUE TO LICENSOR UNDER ANY CONTRACT, AND/OR (IV) THIRD PARTY FEES, INCLUDING BUT NOT LIMITED TO THIRD PARTY LICENSE FEES. THIRD PARTY FEES SHALL, TO THE EXTENT PRACTICAL AND IF POSSIBLE, BE BILLED BY LICENSOR TO LICENSEE AS A SEPARATE ITEM.\n\nLICENSEE SHALL INDEMNIFY AND HOLD LICENSOR AND LICENSOR’S AFFILIATES, OFFICERS, DIRECTORS, AGENTS, SUPPLIERS, CUSTOMERS AND EMPLOYEES HARMLESS FROM AND AGAINST ALL CLAIMS, DAMAGES, LOSSES, LIABILITIES, COSTS, CHARGES AND EXPENSES (INCLUDING ATTORNEYS’ FEES), SETTLEMENT FEES AND EXPENSES (INCLUDING REASONABLE FEES OF ATTORNEYS AND OTHER PROFESSIONALS) ARISING OUT OF LICENSEE’S PURCHASE AND/OR USE OF THE SOFTWARE, AND/OR INCURRED BY BREACH OF THESE ZOIPER STANDARD TERMS AND CONDITIONS OR BY BREACH OF ANY CONTRACT BETWEEN THE PARTIES OR BY REASON OF ANY CLAIM IN RESPECT OF THE DISTRIBUTION OR SALE OF SOFTWARE OR OTHER PRODUCTS (INCLUDING BUT NOT LIMITED TO APPLICATIONS, INTERFACES AND APPLICATION PROGRAMMING INTERFACES) DEVELOPED UTILIZING THE SOFTWARE, INCLUDING BUT NOT LIMITED TO: PRODUCTS, LIABILITY CLAIMS AND CLAIMS OF INFRINGEMENT OF THIRD PARTY INTELLECTUAL RIGHTS.\n\nLICENSOR MAKES NO REPRESENTATION OR WARRANTY AS TO THE VALIDITY OR ENFORCEABILITY OF THE TRADE MARKS, NOR AS TO WHETHER THESE INFRINGE ANY INTELLECTUAL PROPERTY RIGHTS OF THIRD PARTIES.\n\nXV. FORCE MAJEURE\n\nLicensor shall not be liable for any delay or failure in performance due to events outside Licensor’s reasonable control, besides the understanding of this term in jurisdiction and case law, all external causes, which cannot be influenced by Licensor but though which Licensor is unable to carry out its commitments, including, without limitation:\n\n    War, riots, civil or military insurrection and political coups;\n    Natural disasters such as earthquakes, fire, storms and floods;\n    Governmental acts and omissions;\n    Terrorism and sabotage;\n    Labor disputes\n    Industry-wide shortages of supplies, delays in common carriers\n    Epidemics\n\nThe obligations and rights of Licensor shall be extended for a period equal to the period during which such event prevented Licensor’s performance.\n\nLicensee’s obligation to pay monies due and owing to Licensor cannot be delayed or failed due to Force Majeure circumstances and thus no Force Majeure circumstances cure Licensee from Licensee’s duty to pay the amounts due and owing to Licensor.\n\nXVI. HIGH RISK ACTIVITIES\n\nTHE SOFTWARE IS NOT FAULT-TOLERANT AND IS NOT DESIGNED, MANUFACTURED OR INTENDED FOR ANY USE REQUIRING FAIL-SAFE PERFORMANCE IN WHICH THE FAILURE OF A PRODUCT COULD LEAD TO DEATH, SERIOUS PERSONAL INJURY, SEVERE PHYSICAL OR ENVIRONMENTAL DAMAGE (“HIGH RISK ACTIVITIES”). THIS INCLUDES THE OPERATION OF AIRCRAFT OR NUCLEAR FACILITIES, EMERGENCY RESPONSE.\n\nLICENSEE AGREES NOT TO USE, OR LICENSE THE USE OF, THE SOFTWARE OR DERIVED LICENSEE SOFTWARE IN CONNECTION WITH ANY HIGH RISK ACTIVITIES.\n\nXVII. THIRD-PARTY EQUIPMENT / SOFTWARE\n\nLicensee is responsible, at own risk for proper equipment, including Third Party infrastructure and other facilities that provide access to the network at which Licensee can receive the provided Software by Licensor, for instance without limitation devices and necessary equipment on which Licensee will use the Software.\n\nXVIII. GENERAL AGREEMENT PROVISIONS\n1. SIGNATURE VALIDITY\n\nIn the event that any Party’s signature is delivered by facsimile transmission, such signature shall create a valid and binding obligation of the Party executing (or on whose behalf such signature is executed), with the same force and effect as if such facsimile signature page were an original thereof.\n\n2. CHOICE OF LAW\n\nTHESE ZOIPER STANDARD TERMS AND CONDITIONS are governed by and construed in accordance with the laws of the Kingdom of Belgium.\n\n3. NUMBERING\n\nThe numbering in these ZOIPER STANDARD TERMS AND CONDITIONS is solely for the convenience of the Parties.\n\n4. SURVIVAL\n\nALL CLAUSES HEREIN SURVIVE EXPIRATION OR EARLIER TERMINATION OF THESE ZOIPER STANDARD TERMS AND CONDITIONS OR ANY CONTRACT BETWEEN THE PARTIES.\n\n5. APPLICABILITY\n\nIf any portion of these ZOIPER STANDARD TERMS AND CONDITIONS is found invalid or unenforceable under judicial decree or decision of a Court, the remainder of these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties shall remain valid and enforceable to the extent according to their terms and the invalid clause shall be replaced by Licensor by a clause which reflects the object of the original clause as close as possible. The other provisions of these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties will remain in full force and effect.\n\n6. COMPLIANCE WITH LAWS AND EXPORT RESTRICTIONS\n\nLICENSEE IS ADVISED THAT THE SOFTWARE MAY CONTAIN ENCRYPTION ALGORITHMS THAT MAY BE LIMITED FOR EXPORT WITHOUT A LICENSE ISSUED BY THE U.S. BIS, THE EUROPEAN UNION OR ANY OTHER COUNTRY’S GOVERNMENTAL AGENCIES WHERE APPLICABLE.\n\nADDITIONALLY, LICENSEE IS ADVISED THAT OBTAINING THE SOFTWARE THROUGH THIRD PARTY APPLICATION STORES SUCH AS, BUT NOT LIMITED TO WINDOWS PHONE STORE, GOOGLE PLAY AND ITUNES APP STORE, MAY BE SUBJECT TO ADDITIONAL REGULATIONS SUCH AS BUT NOT LIMITED TO U.S. EXPORT ADMINISTRATION REGULATIONS (EAR). LICENSEE IS RESPONSIBLE FOR ADHERING TO THE APPLICABLE REGULATIONS.\n\nLICENSEE IS AWARE AND AGREES THAT THE SOFTWARE MAY ONLY BE USED FOR CIVIL PURPOSES AND THE SOFTWARE MUST NEVER BE USED FOR ANY DIRECT OR INDIRECT MILITARY OR OTHER PURPOSE PROHIBITED UNDER ANY APPLICABLE REGULATION.\n\nLICENSEE AGREES NOT TO DIRECTLY OR INDIRECTLY EXPORT, RE-EXPORT, IMPORT OR TRANSMIT THE SOFTWARE CONTRARY TO THE LAWS AND REGULATIONS OF ANY GOVERNMENTAL ENTITY (NATIONAL, SUBNATIONAL AND/OR SUPRANATIONAL) THAT HAS JURISDICTION OR AUTHORITY OVER THE COUNTRIES FROM OR TO WHICH THE SOFTWARE IS BEING IMPORTED, EXPORTED, TRANSMITTED OR USED.\n\nLICENSEE HEREBY REPRESENTS THAT TO THE BEST OF LICENSEE’S KNOWLEDGE, LICENSEE IS ELIGIBLE TO RECEIVE THE SOFTWARE UNDER APPLICABLE LAW.\n\nIF LICENSEE MOVES ANY SOFTWARE, AND AS A RESULT OF SUCH MOVE, A JURISDICTION IMPOSES A DUTY, TAX, LEVY OR FEE (INCLUDING WITHHOLDING TAXES, FEES, CUSTOMS, OR OTHER DUTIES FOR IMPORT AND EXPORT OF ANY SUCH SOFTWARE), THEN LICENSEE IS SOLELY LIABLE FOR ANY SUCH DUTY, TAXES, LEVY OR OTHER FEES AND LICENSEE IS SOLELY RESPONSIBLE FOR, AND WILL PAY, ANY SUCH DUTY, TAXES, LEVY, OR OTHER FEES.\n\n7. NATURE OF RELATIONSHIP\n\nThese ZOIPER STANDARD TERMS AND CONDITIONS or any Contracts between the Parties shall not create or be construed as creating a joint venture, co-ownership, partnership, employment or agency relationship, unless specifically created to create such.\n\nThe Parties acknowledge and agree that these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties does not create, and shall not be construed to create any employment relationship between Licensee and Licensor’s own employees.\n\n8. EXCLUSIVITY\n\nNeither Party provides exclusivity rights to the other with these ZOIPER STANDARD TERMS AND CONDITIONS and with any Contract between the Parties, unless specifically created to provide such.\n\n9. WAIVER\n\nNo failure or delay by either Party to exercise or enforce any of its rights, powers or remedies under these ZOIPER STANDARD TERMS AND CONDITIONS and under any Contract between the Parties will act as a waiver of such rights, powers or remedies and no waiver of a breach in a particular situation shall be held to be a waiver of any other or subsequent breach and nor will any partial exercise preclude any further exercise of the same, or of some other right, power or remedy.\n\n10. DISPUTES\n\nAll disputes between the Parties arising from these ZOIPER STANDARD TERMS AND CONDITIONS, any Contract between the Parties, other agreements, and commitments, must be settled in a court of competent jurisdiction in Belgium.\n\n11. COSTS\n\nEach Party shall bear all costs and expenses incurred by it or in connection with these ZOIPER STANDARD TERMS AND CONDITIONS and with any Contract between the Parties, unless stated otherwise.\n\n12. PROFESSIONAL SERVICES - SUPPORT AND CUSTOM DEVELOPMENT\n\nNothing in these ZOIPER STANDARD TERMS AND CONDITIONS shall be construed to require Licensor to provide support services or updates, upgrades, bug fixes, modifications, custom development, development services to Licensee. All professional services offered by Licensor require Contract/s between the Parties.\n\nLicensee will be solely responsible for providing support to Licensee’s end users for the Licensee Software distributed by Licensee.\n\n13. TRANSFER OF THE AGREEMENT\n\nLicensee is not entitled to transfer these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties to Third Parties, including but not limited to Licensee’s rights and obligations, without the written consent of Licensor.\n\n14. ASSIGNMENT\n\nLicensee may not assign these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties or any interest or rights granted hereunder to any Third Party without the written consent of Licensor. A change of control or reorganization of Licensee pursuant to a merger, sale of assets or stock shall be deemed to be an assignment under these ZOIPER STANDARD TERMS AND CONDITIONS and under Contract/s between the Parties. Notwithstanding any assignment by Licensee, Licensee shall remain liable for the payment of all amounts due under any agreement between the Parties.\n\n15. NOTICES\n\nLicensor keeps the right to change these ZOIPER STANDARD TERMS AND CONDITIONS without prior notice. The valid ZOIPER STANDARD TERMS AND CONDITIONS are made available by Licensor on Licensor’s website and updated accordingly by Licensor, and shall be deemed accepted by Licensee shall Licensee continue to apply its rights according to any Contract between Licensee and Licensor.\n\nNotwithstanding the foregoing, notices regarding changes in pricing, license terms, policies or programs may be by posting on <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/ac4da812f8031413ca4aa9de971d20669f64db64b8f8949579ecb5bd0c848cd4/http%3A//www.zoiper.com\">www.zoiper.com</a> or by e-mail.\n\n16. FEEDBACK\n\nLicensee agrees to provide any comments and suggestions regarding the performance of the Software on the e-mail address support@zoiper.com\n\nLicensor agrees to monitor this mailbox, but is under no obligation to implement any of the suggestions and/or proposals, or be required to respond to any questions asked in the e-mail/s.\n\nLicensor and/or its affiliates will be free to use any information Licensee provides, including comments, problem reports, suggestions or enhancement requests, to Licensor for any purpose, subject to any applicable patents or copyrights.\n\nCONTACT\n\nFor any questions arising out of these ZOIPER STANDARD TERMS AND CONDITIONS, please send a valid certified letter mail to the address provided herein, or call the numbers provided herein to receive more information on how to address your questions.\n\nCOMPANY NAME: Securax EOOD\nADDRESS: 33 Simeonovsko shose, fl.4, office 8, 1700 Sofia, Bulgaria\nTELEPHONE NUMBER/S: +1 415 9065157 ; +352 20333140"
            },
            "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/zoiper-thunderbird-plugin/license/2.0"
        },
        "release_notes": {
            "en-US": "Added support for Thunderbird 68."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/zoiper-thunderbird-plugin/versions/2.0",
        "version": "2.0"
    },
    {
        "id": 2468724,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "60.*",
                "min": "24.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/zoiper-thunderbird-plugin/versions/2468724",
        "files": [
            {
                "id": 1011956,
                "created": "2018-10-17T12:39:07Z",
                "hash": "sha256:2e9340e5269f5f20125aae5c8d319f2ae19d70ec222d0d5d15025f7099bd3326",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 11002,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/1011956/zoiper_thunderbird_plugin-1.06-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 6361,
            "name": {
                "en-US": "Zoiper standard terms and conditions"
            },
            "text": {
                "en-US": "Zoiper Standard Terms and Conditions\n\nI. ACCEPTANCE OF TERMS\n\nThese ZOIPER STANDARD TERMS AND CONDITIONS are a bonding contract between SECURAX EOOD (hereinafter referred to as “Licensor”), a company duly organized under the laws of Bulgaria, with registration number (registered under Bulgaria’s National Tax Register) BG131273941, with its business address at 33 Simeonovsko shose, fl.4, office 8,1700 Sofia, Bulgaria and you (hereinafter referred to as “Licensee”), who is:\n\n(i) the company entering into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(ii) the natural person entering into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(iii) the legal person who on behalf of the company enters into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(iv) the natural person who on behalf of the company enters into these ZOIPER STANDARD TERMS AND CONDITIONS;\nand who is (i) a company (or representing a company) requesting Licensor’s Services and Licensor’s Software Licensing or developing the Licensee’s Application or, who is (ii) the natural person, requesting Licensor’s Services and Licensor’s Software Licensing or developing the Licensee’s Application.\n\nLICENSEE SHOULD READ THESE ZOIPER STANDARD TERMS AND CONDITIONS CAREFULLY, IN THEIR ENTIRETY PRIOR TO ACCESSING AND/OR USING THE SOFTWARE.\n\nBY INSTALLING, DOWNLOADING AND/OR USING THIS SOFTWARE OR LICENSOR’S SERVICES OR AUTHORIZING OTHERS TO DO SO, ON BEHALF OF LICENSEE AND THE ENTITY FROM WHOM LICENSEE IS INSTALLING, DOWNLOADING AND/OR USING THE SOFTWARE, LICENSEE AGREES TO THESE ZOIPER STANDARD TERMS AND CONDITIONS AND CREATES A BINDING CONTRACT BETWEEN LICENSEE AND LICENSOR.\n\nANY USE OF THE SOFTWARE WILL CONSTITUTE LICENSEE’S ASSENT TO THESE ZOIPER STANDARD TERMS AND CONDITIONS (OR RATIFICATION OF PREVIOUS CONSENT).\nII. APPLICABILITY\n\nTHESE ZOIPER STANDARD TERMS AND CONDITIONS FORM AN INTEGRAL PART OF EACH CONTRACT BETWEEN LICENSOR AND LICENSEE AND APPLY TO ALL SUBSEQUENT CONTRACTS RESULTING FROM OR LEADING TO CONTRACT/S, AND TO ALL QUOTATIONS, OFFERS, LETTERS OF INTENT, ORDERS, ORDER CONFIRMATIONS AND OTHER DOCUMENTS AND ACTS MADE AND/OR DONE IN PREPARATION FOR AND/OR PRIOR TO AND/OR IN CONNECTION WITH CONTRACT/S.\n\nIn the event of conflict between the ZOIPER STANDARD TERMS AND CONDITIONS and the provisions of a Contract between the Parties, the provisions of the Contract will prevail.\n\nThe most recent version of the ZOIPER STANDARD TERMS AND CONDITIONS is applicable. The most recent version may be uploaded and found on Licensor’s website.\nIII. DEFINITIONS\n\n1. “Contract/s” is separate written agreement/s between Licensor and Licensee, and could be relating to without limitation: product usage, product licensing, and/or services.\n\n2. “Effective date” means the date a Contract is signed in hardcopy by Licensee or, in the absence of hardcopy or signature, the Contract shall be effective from the date an order/purchase is placed by Licensee.\n\n3. “Extension date” means: (i) the date of the anniversary of the Effective date and (ii) the date of the extension of a Contract between the Parties, according to the Contract’s extension terms and conditions.\n\n4. “Contract year” means (i) the period of one (1) year commencing on the Effective date and continuing until the Extension date and (ii) the period of one (1) year between Extension dates.\n\n5. “Parties” means both together Licensee and Licensor, and “Party” means either Licensee or Licensor separately.\n\n6. “Third Party/s” – means party/parties that is/are neither Licensor nor Licensee, and could be without limitation: (i) party/parties providing services, hardware, software, (ii) government institutions and/or authorities, (iii) servers hardware, software, and/or server-related services providers – VoIP and/or WEB, (iv) any equipment and/or infrastructure hardware, software, and/or service providers, (v) the third parties who own and/or administer the Online Distribution Stores.\n\n7. “End-user” – means a consumer and a natural person obtaining the Software and/or the Services.\n\n8. “Licensor’s Product/s”– means Licensor’s Zoiper software application/s subject to these ZOIPER STANDARD TERMS AND CONDITIONS and subject to Contract/s between the Parties, and available for free or for paid download through Licensor’s Official Distribution Channels, and the Documentation related to Licensor’s Products.\n\n9. “Online Distribution Stores” – the Third Party managed Online Distribution Stores where Licensor’s Product and/or the Software are uploaded to in order to be made available to End-users. For the purposes of the relationship between the Parties, the Online Distribution Stores include but are not limited to:\n\na) Google play application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/0a1d20e1dda9c808535d7d23e8551feebc5eaebfd581957e882809aa74aa59c3/https%3A//play.google.com\">https://play.google.com</a> ),\n\nb) Apple’s iTunes application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/e0b7f788a860e31bc3abe7cee616b02826abf993d9422c775a576702fbc5c327/https%3A//itunes.apple.com\">https://itunes.apple.com</a> ),\n\nc) Windows Phone application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/9a2a82d55ac64093c5b7e71ccf6a1bb9707f4b2fd7f7670377d95d229d38b8eb/http%3A//www.windowsphone.com/en-us/store\">http://www.windowsphone.com/en-us/store</a> ).\n\nLicensor is not affiliated to any of the Third parties managing and/or administrating the Online Distribution Stores. The web addresses to the Third Party Online Distribution Stores provided herein are for informational purposes only and changes may apply. Licensor bears no responsibility for any of the Third parties’ actions, including without limitation: the Third parties’ applying any changes to their Online Distribution Stores, including without limitation: changing their web addresses, their upload/download Online distribution store policies, and/or any of their policies and requirements, including without limitation: requirements for uploading and approving applications.\n\n10. “SDK” – means Licensor’s Software Development Kit and all related Documentation\n\n11. “Documentation” means any technical or specifications or documentation that Licensor may make available or provide to Licensee relating to, or for use in, or with, the Software, including without limitation: SDK documentation, programmer guides, manuals, materials and information appropriate or necessary for use in connection with the Software.\n\n12. “SOW” – stands for Statement Of Work and is a document constituting the entire requirements (and no other requirements) of Licensee related to customization of Licensor’s Product/s.\n\n13. “Software” – for the purposes of these ZOIPER STANDARD TERMS AND CONDITIONS and for the purposes of Contract/s between the Parties, the definition “Software” means either one or all of the definitions below, and is applicable to the entire relationship between the Parties. “Software” could mean all or either one of the following, whichever is applicable to Contract/s between the Parties:\n\na) “SOW Software” – Licensor’s Product/s modified as per the SOW;\n\nb) “SDK Software” means Licensor’s proprietary product: software and files, which may contain either one or a combination of several or all: object code, software libraries, source code, executables, Application Programming Interfaces, software tools, specifications and example source code, and the related to the SDK Software documentation,\n\nc) “Licensor’s Product/s”.\n\n14. “Build” – is a Software file with the following possible extensions (when applicable): .apk for Android,.ipa for iOS, .xap for Windows Phone, .exe for Windows, .dmg for Mac OS X, .tar for Linux, or a compressed file with any of the extensions listed herein.\n\n15. “Services” – means maintenance, technical support, customization services, branding, or any other services performed or to be performed, if any, by Licensor as per Contract/s between the Parties. Some Services require a separate SOW to be executed between the Parties.\n\n16. “Customization” means mutually agreed with Contract/s between the Parties modification to the Software, applied or to be applied by Licensor, resulting in change of the behavior and/or the graphical user interface of Licensor’s Product/s.\n\n17. “Licensee’s software” means one of these definitions or all:\n\na) the application that Licensee has the right to develop, in which the Software will be incorporated. In relation to this definition, “Licensee’s application” means one or more software programs developed by Licensee under Licensee’s trademark or brand and which will be provided to End-users’ computers, tablets and smartphones.\n\n18. “Licensor’s Official Distribution Channels” are (i) Licensor’s website: <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/ac4da812f8031413ca4aa9de971d20669f64db64b8f8949579ecb5bd0c848cd4/http%3A//www.zoiper.com\">www.zoiper.com</a> , and (ii) the Online Distribution Stores.\n\n19. “Confidential Information” means information disclosed, or to be disclosed, by Licensee or Licensor under Contract/s between the Parties, including without limitation: Licensor’s Software information, Software documentation, Software example, SDK documentation, SDK versions, information regarding Licensee’s or Licensor’s technical plans, marketing and financial data.\n\n20. ”Day/s” – means business day/s outside of Licensor’s location Holidays and outside of weekend days as per Licensor’s headquarters address.\n\n21. “Hour/s” – means business hour/s, and where hours are not specified, they shall be considered business hours.\n\n22. “Activation Credentials” means the identification information, e.g. username and/or password, or certificate, used to identify Licensee’s use or the End-users’ utilizing Licensee’s services use of the Software.\n\n23. “Update” – the act of applying a patch or point release (i.e. update version 4.1 to version 4.2) to fix or improve existing functionality, also without limitation: bug fixes, modifications, enhancements, supplements.\n\n24. “Updated Version” – an updated Build of the Software.\n\n25. “Updates License” – means the right to request and receive Updated Versions of the Software twice per contract year per Software during the term of Contract/s with which Licensor provides an Updates License to Licensee, if such contract is signed between the Parties.\n\n26. “Updated Versions Pool” – means the set allowance of two Updated Versions per Software per Updates License of the Software for the period of one (1) contract year during the term of Contract/s with which Licensor provides an Updates License to Licensee, if such contract is signed between the Parties.\n\n27. “New Licensor’s Product Release Version” – an updated build of Licensor’s Product\n\n28. “Upgrade” – means the act of moving from one major release to another (i.e. upgrade from Release 4 to Release 5) during the term of Contract/s with which Licensor provides Upgrades to Licensee, if such contract is signed between the Parties.\n\nUpgrades may involve changes in data structures, program processes, general interface changes, and therefore are more likely to impact a functioning application than an update.\n\n29. “Upgraded Version” means an Upgraded Version of the Software\n\n30. “Fault” – a malfunction of the Software where (i) the faulty behaviour has business impact on a production or test system, restraining at least 10% of Licensee’s end-users or testers to use the Software for making or receiving calls; and (ii) is reproducible on a clean install of the operating system in Licensee’s and Licensor’s environments, independent of specific environment setups; and (iii) occurs regardless of the end-device, the version of the mobile operating system or the server mode, firmware revision or configuration; and (iv) is independent of specific environment setups, third-party hardware, peripherals and/or drivers; and (v) is particularly limited to the licensor product’s standard engine and standard interface.\n\nSEVERITY CLASSIFICATION OF THE FAULTS:\n\nThe Severity Classification of the Faults is intended to describe the severity of the Fault:\n\na) “Critical Fault” – is a Critical Severity Fault of the Software, violating RFC 3261 (SIP) and/or RFC 3550 (RTP), where the faulty behaviour has significant to critical business impact on a production system and is resulting in Licensee’s production system to being either down, or functioning at a significantly reduced capacity\n\nb) “Medium Fault” is a Medium Severity Fault of the Software that has some business impact on a production system, resulting in some functionality loss on Licensee’s production system. The Software is usable, but does not provide a function in a convenient or expeditious manner.\n\nc) “Low Fault” – a Low Severity Fault of the Software occurring in test or non- production environments and is related to questions and issues including general usage questions, issues related to a test or non-production environment, or feature requests. There is no impact on the quality, performance or functionality on Licensee’s production system.\n\n31. “Stock-version of an operating system” – non-modified version of an operating system, as provided by either of the manufacturers, namely: Microsoft, Google, Apple, and without Third Party modifications by device manufacturers.\n\n32. “Purchase Order” means an order issued by Licensee to Licensor for Software or Services to be purchased, licensed or provided under a TERMS OF SALE Contract or under Contract/s between the Parties.\n\n33. “Proforma Invoice” is a document, issued by Licensor, preceding Licensee’s payment towards Licensor and indicating Licensee’s due amounts for payment. In the absence of a Proforma Invoice all other indication methods apply. The absence of a Proforma Invoice does not release Licensee of Licensee’s payment obligations.\n\n34. “Distributable software” means the Software in the form of binary object files, software library, linkable object files or dynamic link library, and/or executable files.\n\n35. “Example Source Code” means example software program in source code format or a sample source code included in the SDK, provided the source code is compiled into a software program and is not distributed in human-readable form.\n\n36. “API” means the Zoiper Application Programming Interfaces contained in the Software, including documentation, header files and related information.\nIV. CONFIDENTIALITY\n\nLicensee acknowledges that the Software and any other technical and/or commercial information not in the public domain obtained by Licensee are regarded as confidential by Licensor.\n\nAny Activation Credentials issued by Licensor to Licensee are confidential and shall be treated in accordance with these ZOIPER STANDARD TERMS AND CONDITIONS or any Mutual Non-Disclosure Agreement (“MNDA”) signed between the Parties or Contract/s signed between the Parties. Licensee agrees to take all reasonable measures to protect all Confidential Information including the Software, Documentation, Activation Credentials using at least the same degree of care that Licensee protects its own confidential information, however not less than a reasonable degree of care.\n\nLicensee agrees to use the Confidential Information and the Activation Credentials solely for the purpose of exercising Licensee’s rights and performing Licensees obligations under the business relationship between Licensee and Licensor, and Licensee agrees (i) to not disclose the Confidential Information to any Third Party and (ii) to not use the Confidential Information or the Activation Credentials for any other purpose, without Licensor’s prior written notice of consent.\n\nLicensee agrees not to permit or authorize access to, or disclosure of the Software to any person or entity other than employees of Licensee who (i) have signed in writing to be bound by these ZOIPER STANDARD TERMS AND CONDITIONS and who (ii) have a need to access the Software for the performance of Licensee’s rights and obligations. Licensee shall take appropriate measures by instruction and agreement prior to disclose to such employees to assure against unauthorized use or disclosure.\n\nAny applicable distribution rights will be governed by an additional contract for distribution license rights.\n\nAny press release or publication regarding these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties is subject to prior review and written approval by Licensor.\n\nThe obligations of confidentiality shall not apply to information which has entered the public domain except where such entry is the result of Licensee’s breach of these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties, or is required to be disclosed pursuant to a court order, so long as Licensor is given adequate notice and the ability to challenge such required disclosure.\n\nIf a MNDA is signed between the Parties prior to applying of these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties, (i) the confidentiality relationship between the Parties is subject to the MNDA, (ii) the MNDA signed between the parties prior to these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract becomes an integral part of these ZOIPER STANDARD TERMS AND CONDITIONS and Contract/s between the Parties, (iii) in case of conflict between the MNDA and this CONFIDENTIALITY clause, the MNDA will take predominance.\n\nV. PROPRIETARY SOFTWARE\n\nLicensor’s Products are closed source software. No portions of any of Licensor’s Products source code will be made available to Licensee.\n\nVI. TRADEMARK\n\n“Zoiper” is a registered trade mark and all applicable laws in relation to protection and use of Zoiper’s trademark apply.\n\nVII. OWNERSHIP AND INTELLECTUAL PROPERTY RIGHTS\n\nAll ownership and intellectual property rights in the Software and any copies or derivative works thereof (regardless of form or media in or which the original copies may exist), including but not limited to patents, design rights, copyrights, trademarks, trade-secrets and proprietary know-how, shall be owned by and vested in Licensor and nothing in these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties shall constitute or be interpreted as a transfer of such rights from Licensor to Licensee.\n\nLicensee acknowledges that the structure and the source code of the Software are valuable trade secrets of Licensor and shall remain the sole property of Licensor.\n\nVIII. COPYRIGHT AND INTELLECTUAL PROPERTY NOTICES\n\nCertain software programs or libraries included in the Software may contain software (including open source software) distributed under Third Party agreements (“Third Party Components”), which may contain terms that expand or limit rights to use certain portions of the Software (“Third Party Terms”).\n\nAny use, reproduction and distribution of components of the Software licensed under an open source software license are governed solely by the terms of such open source software license and not to these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties.\n\nLicensor’s intellectual property right and copyright notices as per Licensor’s sole discretion are and shall be integral part of the “About box” of the Software, together with the following Third Party copyrights information:\n\nTHIRD PARTY TECHNOLOGIES THAT ARE OR MAY BE USED BY LICENSOR’S PRODUCT/S:\n\n    Securax EOOD\n    JThread, Copyright (C) 2000-2005 Jori Liesenborgs (jori@lumumba.uhasselt.be)\n    JRTPLIB, part of JRTPLIB Copyright (C) 1999-2005 Jori Liesenborgs\n    GSM, Copyright 1992, 1993, 1994 by Jutta Degener and Carsten Bormann, Technische Universitaet Berlin\n    iLBC, iLBC Speech Coder ANSI-C Source Code iLBC_define.h Copyright (C) The Internet Society (2004). All Rights Reserved.\n    SPEEX The Xiph OSC and the Speex Parrot logos are trademarks (TM) of <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/39820572d7164f0b84796aed13521d9e02a4ee193c87c928d344d269e850e69b/http%3A//Xiph.Org\">Xiph.Org</a>\n    OpenLDAP, Copyright 1999-2003 The OpenLDAP Foundation, Redwood City, California, USA. All Rights Reserved.\n    PortAudio, Copyright (C) 1999-2002 Ross Bencina and Phil Burk\n    PortMixer, PortMixer, Windows WMME Implementation, Copyright (C) 2002, Written by Dominic Mazzoni and Augustus Saunders\n    Resiprocate, The Vovida license The Vovida Software License, Version 1.0, Copyright (C) 2000 Vovida Networks, Inc. All rights reserved.\n    This product includes cryptographic software written by Eric Young (eay@cryptsoft.com)\n    This product includes software written by Tim Hudson (tjh@cryptsoft.com)\n    This product is using the gloox XMPP library - Copyright by Jakob Schroeter\n    This product is using ReorderListBox written by Jason Gincherau\n    This product is using <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/18b679f066fcfbbd112ac31f4601ce8a6e2c9c6ac5319244783d024d360d1721/http%3A//ZXing.net\">ZXing.net</a> written by Michael Jahn\n    This product is using Coding4Fun Toolkit\n    This product is using C# port of libphonenumber by Erez A. Korn (<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/1b16cdbf7c883dc6dc74142cb484f1e9df82f758fb8d28a09e4860d150aaffe3/https%3A//github.com/erezak\">https://github.com/erezak</a>)\n\nIf Licensee is entitled to an Update of the Software and if the Software includes additional Third Party technology, Licensor has the right to add to the “About box” the additional intellectual property right information and copyright information, and, when handled by Licensee, Licensee is obliged to update the “About box”.\n\nLicensee shall not remove, obscure or alter proprietary rights notices (including without limitation: copyright and trademark notices) that may be in the copies of the Software.\n\nRedistribution in binary form, to the extent permitted by Contract/s between the Parties, must also reproduce Licensor’s copyright as well as Third Party copyrights incorporated in the Software, trademark or other Licensor or Third Party proprietary notices as incorporated in the Software in any associated Documentation or startup application images “Splash screens” or “About box” that display Licensee copyright notices.\n\nInformation identifying the copyright holders of the Third Party Components and the Third Party Terms that apply are available in the Documentation and/or in these ZOIPER STANDARD TERMS AND CONDITIONS and/or in Contract/s between the Parties.\n\nIX. NO TRANSFER OF INTELLECTUAL PROPERTY RIGHTS\n\nExcept for the rights granted by Licensor to Licensee with Contract/s, no other rights, including without limitation: no intellectual property and/or no intellectual property rights, are transferred to Licensee.\n\nX. NON-ASSERTION BY LICENSEE\n\nLicensee agrees not to assert in any way any patent owned by Licensee arising out of or in connection with this Software or modifications made thereto or applications developed using the Software against Licensor, Licensor’s subsidiaries and/or affiliates and/or their customers, direct or indirect, agents and contractors (collectively, the “Licensor Product Users”) for the manufacture, use, import, licensing, offer for sale or sale of any Licensor’s Products.\n\nXI. LIMITED WARRANTY\n1. NO SOFTWARE WARRANTY\n\nLICENSOR PROVIDES AND LICENSES THE SOFTWARE (AND/OR THE SOURCE CODE EXAMPLES IF APPLICABLE) “AS IS”. LICENSOR MAKES NO REPRESENTATIONS OR WARRANTIES AND THERE ARE NO CONDITIONS, ENDORSEMENTS, GUARANTEES, REPRESENTATIONS OR WARRANTIES OF ANY KIND EITHER EXPRESS OR IMPLIED, (INCLUDING WITHOUT LIMITATION ANY EXPRESS OR IMPLIED WARRANTIES OR CONDITIONS OF QUALITY, PERFORMANCE, RESULTS, FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY, MERCHANTABLE QUALITY, DURABILITY, TITLE, NON-INFRINGEMENT OR ARISING BY STATUTE OR OTHERWISE IN LAW OR FROM A COURSE OF DEALING OR USAGE OF THE TRADE) ARISING OUT OF OR RELATED TO THESE ZOIPER STANDARD TERMS AND CONDITIONS AND/OR AN EXISTING CONTRACT OR VALID TERMS BETWEEN THE PARTIES OR ARISING OUT OF OR RELATED TO ANY SOFTWARE, SOFTWARE INFORMATION OR THEIR PERFORMANCE OR FAILURE TO PERFORM.\n\nLICENSEE AGREES TO ASSUME ALL RISKS ASSOCIATED WITH LICENSEE AND LICENSEE’S AUTHORIZED USERS’ USE OF THE SOFTWARE. LICENSEE IS RESPONSIBLE FOR TAKING PRECAUTIONARY MEASURES TO PREVENT THE LOSS OR DESTRUCTION OF LICENSEE’S DATA AND DATABASES SUCH AS, FOR EXAMPLE MAKING REGULAR BACKUPS AND VERIFYING THE RESULTS OBTAINED FROM ANY SOFTWARE’S, AND LICENSOR WILL HAVE NO OBLIGATIONS OR LIABILITY WHATSOEVER WITH RESPECT TO ANY SUCH LOSS OR DESTRUCTION.\n\n2. LIMITED SERVICES WARRANTY\n\nSERVICES PROVIDED WITH CONTRACT/S BETWEEN THE PARTIES SHALL BE PERFORMED IN A WORKMANLIKE MANNER CONSISTENT WITH INDUSTRY STANDARDS.\n\nLICENSEE MUST NOTIFY LICENSOR PROMPTLY, BUT IN NO EVENT MORE THAN FOURTEEN (14) DAYS AFTER COMPLETION OF THE SERVICES, OF ANY CLAIMED BREACH OF THIS WARRANTY.\n\nLICENSEE’S SOLE AND EXCLUSIVE REMEDY FOR BREACH OF THIS WARRANTY SHALL BE, AT LICENSOR’S OPTION, RE-PERFORMANCE OF THE SERVICES, OR TERMINATION OF THE CONTRACT/S AND THESE ZOIPER STANDARD TERMS AND CONDITIONS, OR THE APPLICABLE SERVICE AND RETURN OF THE SERVICE FEES PAID TO LICENSOR BY LICENSEE FOR SUCH NON-CONFORMING SERVICE. THE PROVISION OF SERVICES UNDER CONTRACT/S BETWEEN THE PARTIES OR THESE ZOIPER STANDARD TERMS AND CONDITIONS DO NOT EXTEND THE WARRANTIES PROVIDED WITH ANY SOFTWARE ORDERED/PURCHASED BY LICENSEE.\n\nXII. PUBLICITY\n\nUnless otherwise prohibited in writing between the Parties, these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties give either Party the right to use for marketing purposes the other Party’s trade names, trademarks, service marks, domain names, and/or other distinctive brand features, except as may be contained in the Software.\n\nXIII. USE OF BRAND NAMES, TRADEMARKS, LOGOS\n\nWhen agreed in writing between the PARTIES, the PARTIES may, initiate mutual positive marketing campaigns, execute mutual marketing efforts, including without limitation, link to each other’s websites, create and distribute press releases, reference to the other Party, and execute other positive marketing practices.\n\nWith respect to mutual positive marketing campaigns and referencing, the Parties agree as follows:\n\n(a) each Party agrees to use the brands, trademarks, logos, and all information and mentions of the other Party’s brand name and services in good faith and solely with the purpose of the business relationship between the Parties and\n\n(b) upon confirmation of the mutual positive marketing campaign by each Party, each Party provides the right of use of its brands, trademarks, logos of the Party’s brand name and services for the purposes of the positive marketing campaign. This right can be terminated for whatever reason by the Party providing this right with five (5) business days’ notice send by certified mail to the address provided by the Party obtaining the right in the separate written agreement, return receipt required, to the Party obtaining the right. In case of such termination of this right, the Party obtaining the right should cease the use of the brands, trademarks, logos, and all information and mentions of the other Party’s brand name and services within five (5) business days following receipt of such notice.\n\nLicensee is responsible and liable for all the intellectual property rights and copyrights, related to the used materials, for example without limitation: logos, images, trademarks, provided to Licensor by Licensee to be used for the performance of activities governed by Contract/s between the Parties.\n\nXIV. LIMITATION, EXCLUSION OF LIABILITY AND INDEMNIFICATION\n\nREFERENCES TO LIABILITY IN THIS LIMITATION, EXCLUSION OF LIABILITY AND INDEMNIFICATION SECTION INCLUDES WITHOUT LIMITATION: LIABILITY ARISING FROM AGREEMENT, CONTRACT, TORT (INCLUDING NEGLIGENCE), UNDER ANY INDEMNITY, STRICT LIABILITY OR OTHERWISE, IN EACH CASE EVEN IF LICENSOR HAS BEEN INFORMED OF THE POSSIBILITY OF THAT LIABILITY.\n\nSOME STATES AND COUNTRIES, INCLUDING MEMBER COUNTRIES OF THE EUROPEAN UNION, DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES AND, THEREFORE, THE FOLLOWING LIMITATION OR EXCLUSION MAY NOT APPLY IN THOSE STATES AND COUNTRIES.\n\nTO THE MAXIMUM EXTENT PERMITTED BY THE APPLICABLE LAW AND REGARDLESS OF WHETHER ANY REMEDY SET OUT HEREIN FAIL OF THEIR ESSENTIAL PURPOSE, IN NO EVENT SHALL LICENSOR BE LIABLE TO LICENSEE FOR ANY SPECIAL, CONSEQUENTIAL, INDIRECT OR SIMILAR DAMAGES OR LOSS OF PROFITS, REVENUE, TOLL FRAUD, BUSINESS SAVINGS OR GOODWILL, REPUTATION, DATA, FEES, EXPENSES OF ANY KIND OR NATURE, LICENSEE’S OBLIGATION TO COMPENSATE A THIRD PARTY, ARISING OUT OF THE PURCHASE OR INABILITY TO PURCHASE THE SOFTWARE EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nNOTWITHSTANDING ANY OTHER PROVISIONS IN THESE ZOIPER STANDARD TERMS AND CONDITIONS OR AN EXISTING CONTRACT OR VALID TERMS BETWEEN THE PARTIES, IF ENFORCED BY THE APPLICABLE LAW, LICENSOR’S LIABILITY TO LICENSEE SHALL BE LIMITED TO THE AMOUNTS PAID BY LICENSEE TO LICENSOR FOR THE SPECIFIC SOW SOFTWARE OR FOR THE SPECIFIC SDK SOFTWARE OR FOR THE SPECIFIC LICENSOR’S PRODUCT OR FOR THE SPECIFIC SERVICE FOR A SPECIFIC SOW SOFTWARE OR SDK SOFTWARE, AND EXCLUDING (I) PAYMENTS TO THIRD PARTIES AND (II) THIRD-PARTY LICENSE FEES AND (III) ADDITIONAL EXPENSES MADE TO THIRD PARTIES, SUCH AS BUT NOT LIMITED TO THIRD-PARTY COMPANIES FOR PERFORMANCE OF EITHER PARTY’S SERVICES.\n\nNOTHING HEREIN LIMITS OR EXCLUDES THE LIABILITY OF LICENSEE TO LICENSOR ARISING OUT OF (I) LICENSEE’S BREACH OF THESE ZOIPER STANDARD TERMS AND CONDITIONS; (II) LICENSEE’S BREACH OF ANY CONTRACT BETWEEN THE PARTIES; (III) LICENSEE’S BREACH OF LICENSE AGREEMENT BETWEEN THE PARTIES, AND/OR (III) ANY AMOUNTS DUE TO LICENSOR UNDER ANY CONTRACT, AND/OR (IV) THIRD PARTY FEES, INCLUDING BUT NOT LIMITED TO THIRD PARTY LICENSE FEES. THIRD PARTY FEES SHALL, TO THE EXTENT PRACTICAL AND IF POSSIBLE, BE BILLED BY LICENSOR TO LICENSEE AS A SEPARATE ITEM.\n\nLICENSEE SHALL INDEMNIFY AND HOLD LICENSOR AND LICENSOR’S AFFILIATES, OFFICERS, DIRECTORS, AGENTS, SUPPLIERS, CUSTOMERS AND EMPLOYEES HARMLESS FROM AND AGAINST ALL CLAIMS, DAMAGES, LOSSES, LIABILITIES, COSTS, CHARGES AND EXPENSES (INCLUDING ATTORNEYS’ FEES), SETTLEMENT FEES AND EXPENSES (INCLUDING REASONABLE FEES OF ATTORNEYS AND OTHER PROFESSIONALS) ARISING OUT OF LICENSEE’S PURCHASE AND/OR USE OF THE SOFTWARE, AND/OR INCURRED BY BREACH OF THESE ZOIPER STANDARD TERMS AND CONDITIONS OR BY BREACH OF ANY CONTRACT BETWEEN THE PARTIES OR BY REASON OF ANY CLAIM IN RESPECT OF THE DISTRIBUTION OR SALE OF SOFTWARE OR OTHER PRODUCTS (INCLUDING BUT NOT LIMITED TO APPLICATIONS, INTERFACES AND APPLICATION PROGRAMMING INTERFACES) DEVELOPED UTILIZING THE SOFTWARE, INCLUDING BUT NOT LIMITED TO: PRODUCTS, LIABILITY CLAIMS AND CLAIMS OF INFRINGEMENT OF THIRD PARTY INTELLECTUAL RIGHTS.\n\nLICENSOR MAKES NO REPRESENTATION OR WARRANTY AS TO THE VALIDITY OR ENFORCEABILITY OF THE TRADE MARKS, NOR AS TO WHETHER THESE INFRINGE ANY INTELLECTUAL PROPERTY RIGHTS OF THIRD PARTIES.\n\nXV. FORCE MAJEURE\n\nLicensor shall not be liable for any delay or failure in performance due to events outside Licensor’s reasonable control, besides the understanding of this term in jurisdiction and case law, all external causes, which cannot be influenced by Licensor but though which Licensor is unable to carry out its commitments, including, without limitation:\n\n    War, riots, civil or military insurrection and political coups;\n    Natural disasters such as earthquakes, fire, storms and floods;\n    Governmental acts and omissions;\n    Terrorism and sabotage;\n    Labor disputes\n    Industry-wide shortages of supplies, delays in common carriers\n    Epidemics\n\nThe obligations and rights of Licensor shall be extended for a period equal to the period during which such event prevented Licensor’s performance.\n\nLicensee’s obligation to pay monies due and owing to Licensor cannot be delayed or failed due to Force Majeure circumstances and thus no Force Majeure circumstances cure Licensee from Licensee’s duty to pay the amounts due and owing to Licensor.\n\nXVI. HIGH RISK ACTIVITIES\n\nTHE SOFTWARE IS NOT FAULT-TOLERANT AND IS NOT DESIGNED, MANUFACTURED OR INTENDED FOR ANY USE REQUIRING FAIL-SAFE PERFORMANCE IN WHICH THE FAILURE OF A PRODUCT COULD LEAD TO DEATH, SERIOUS PERSONAL INJURY, SEVERE PHYSICAL OR ENVIRONMENTAL DAMAGE (“HIGH RISK ACTIVITIES”). THIS INCLUDES THE OPERATION OF AIRCRAFT OR NUCLEAR FACILITIES, EMERGENCY RESPONSE.\n\nLICENSEE AGREES NOT TO USE, OR LICENSE THE USE OF, THE SOFTWARE OR DERIVED LICENSEE SOFTWARE IN CONNECTION WITH ANY HIGH RISK ACTIVITIES.\n\nXVII. THIRD-PARTY EQUIPMENT / SOFTWARE\n\nLicensee is responsible, at own risk for proper equipment, including Third Party infrastructure and other facilities that provide access to the network at which Licensee can receive the provided Software by Licensor, for instance without limitation devices and necessary equipment on which Licensee will use the Software.\n\nXVIII. GENERAL AGREEMENT PROVISIONS\n1. SIGNATURE VALIDITY\n\nIn the event that any Party’s signature is delivered by facsimile transmission, such signature shall create a valid and binding obligation of the Party executing (or on whose behalf such signature is executed), with the same force and effect as if such facsimile signature page were an original thereof.\n\n2. CHOICE OF LAW\n\nTHESE ZOIPER STANDARD TERMS AND CONDITIONS are governed by and construed in accordance with the laws of the Kingdom of Belgium.\n\n3. NUMBERING\n\nThe numbering in these ZOIPER STANDARD TERMS AND CONDITIONS is solely for the convenience of the Parties.\n\n4. SURVIVAL\n\nALL CLAUSES HEREIN SURVIVE EXPIRATION OR EARLIER TERMINATION OF THESE ZOIPER STANDARD TERMS AND CONDITIONS OR ANY CONTRACT BETWEEN THE PARTIES.\n\n5. APPLICABILITY\n\nIf any portion of these ZOIPER STANDARD TERMS AND CONDITIONS is found invalid or unenforceable under judicial decree or decision of a Court, the remainder of these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties shall remain valid and enforceable to the extent according to their terms and the invalid clause shall be replaced by Licensor by a clause which reflects the object of the original clause as close as possible. The other provisions of these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties will remain in full force and effect.\n\n6. COMPLIANCE WITH LAWS AND EXPORT RESTRICTIONS\n\nLICENSEE IS ADVISED THAT THE SOFTWARE MAY CONTAIN ENCRYPTION ALGORITHMS THAT MAY BE LIMITED FOR EXPORT WITHOUT A LICENSE ISSUED BY THE U.S. BIS, THE EUROPEAN UNION OR ANY OTHER COUNTRY’S GOVERNMENTAL AGENCIES WHERE APPLICABLE.\n\nADDITIONALLY, LICENSEE IS ADVISED THAT OBTAINING THE SOFTWARE THROUGH THIRD PARTY APPLICATION STORES SUCH AS, BUT NOT LIMITED TO WINDOWS PHONE STORE, GOOGLE PLAY AND ITUNES APP STORE, MAY BE SUBJECT TO ADDITIONAL REGULATIONS SUCH AS BUT NOT LIMITED TO U.S. EXPORT ADMINISTRATION REGULATIONS (EAR). LICENSEE IS RESPONSIBLE FOR ADHERING TO THE APPLICABLE REGULATIONS.\n\nLICENSEE IS AWARE AND AGREES THAT THE SOFTWARE MAY ONLY BE USED FOR CIVIL PURPOSES AND THE SOFTWARE MUST NEVER BE USED FOR ANY DIRECT OR INDIRECT MILITARY OR OTHER PURPOSE PROHIBITED UNDER ANY APPLICABLE REGULATION.\n\nLICENSEE AGREES NOT TO DIRECTLY OR INDIRECTLY EXPORT, RE-EXPORT, IMPORT OR TRANSMIT THE SOFTWARE CONTRARY TO THE LAWS AND REGULATIONS OF ANY GOVERNMENTAL ENTITY (NATIONAL, SUBNATIONAL AND/OR SUPRANATIONAL) THAT HAS JURISDICTION OR AUTHORITY OVER THE COUNTRIES FROM OR TO WHICH THE SOFTWARE IS BEING IMPORTED, EXPORTED, TRANSMITTED OR USED.\n\nLICENSEE HEREBY REPRESENTS THAT TO THE BEST OF LICENSEE’S KNOWLEDGE, LICENSEE IS ELIGIBLE TO RECEIVE THE SOFTWARE UNDER APPLICABLE LAW.\n\nIF LICENSEE MOVES ANY SOFTWARE, AND AS A RESULT OF SUCH MOVE, A JURISDICTION IMPOSES A DUTY, TAX, LEVY OR FEE (INCLUDING WITHHOLDING TAXES, FEES, CUSTOMS, OR OTHER DUTIES FOR IMPORT AND EXPORT OF ANY SUCH SOFTWARE), THEN LICENSEE IS SOLELY LIABLE FOR ANY SUCH DUTY, TAXES, LEVY OR OTHER FEES AND LICENSEE IS SOLELY RESPONSIBLE FOR, AND WILL PAY, ANY SUCH DUTY, TAXES, LEVY, OR OTHER FEES.\n\n7. NATURE OF RELATIONSHIP\n\nThese ZOIPER STANDARD TERMS AND CONDITIONS or any Contracts between the Parties shall not create or be construed as creating a joint venture, co-ownership, partnership, employment or agency relationship, unless specifically created to create such.\n\nThe Parties acknowledge and agree that these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties does not create, and shall not be construed to create any employment relationship between Licensee and Licensor’s own employees.\n\n8. EXCLUSIVITY\n\nNeither Party provides exclusivity rights to the other with these ZOIPER STANDARD TERMS AND CONDITIONS and with any Contract between the Parties, unless specifically created to provide such.\n\n9. WAIVER\n\nNo failure or delay by either Party to exercise or enforce any of its rights, powers or remedies under these ZOIPER STANDARD TERMS AND CONDITIONS and under any Contract between the Parties will act as a waiver of such rights, powers or remedies and no waiver of a breach in a particular situation shall be held to be a waiver of any other or subsequent breach and nor will any partial exercise preclude any further exercise of the same, or of some other right, power or remedy.\n\n10. DISPUTES\n\nAll disputes between the Parties arising from these ZOIPER STANDARD TERMS AND CONDITIONS, any Contract between the Parties, other agreements, and commitments, must be settled in a court of competent jurisdiction in Belgium.\n\n11. COSTS\n\nEach Party shall bear all costs and expenses incurred by it or in connection with these ZOIPER STANDARD TERMS AND CONDITIONS and with any Contract between the Parties, unless stated otherwise.\n\n12. PROFESSIONAL SERVICES - SUPPORT AND CUSTOM DEVELOPMENT\n\nNothing in these ZOIPER STANDARD TERMS AND CONDITIONS shall be construed to require Licensor to provide support services or updates, upgrades, bug fixes, modifications, custom development, development services to Licensee. All professional services offered by Licensor require Contract/s between the Parties.\n\nLicensee will be solely responsible for providing support to Licensee’s end users for the Licensee Software distributed by Licensee.\n\n13. TRANSFER OF THE AGREEMENT\n\nLicensee is not entitled to transfer these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties to Third Parties, including but not limited to Licensee’s rights and obligations, without the written consent of Licensor.\n\n14. ASSIGNMENT\n\nLicensee may not assign these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties or any interest or rights granted hereunder to any Third Party without the written consent of Licensor. A change of control or reorganization of Licensee pursuant to a merger, sale of assets or stock shall be deemed to be an assignment under these ZOIPER STANDARD TERMS AND CONDITIONS and under Contract/s between the Parties. Notwithstanding any assignment by Licensee, Licensee shall remain liable for the payment of all amounts due under any agreement between the Parties.\n\n15. NOTICES\n\nLicensor keeps the right to change these ZOIPER STANDARD TERMS AND CONDITIONS without prior notice. The valid ZOIPER STANDARD TERMS AND CONDITIONS are made available by Licensor on Licensor’s website and updated accordingly by Licensor, and shall be deemed accepted by Licensee shall Licensee continue to apply its rights according to any Contract between Licensee and Licensor.\n\nNotwithstanding the foregoing, notices regarding changes in pricing, license terms, policies or programs may be by posting on <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/ac4da812f8031413ca4aa9de971d20669f64db64b8f8949579ecb5bd0c848cd4/http%3A//www.zoiper.com\">www.zoiper.com</a> or by e-mail.\n\n16. FEEDBACK\n\nLicensee agrees to provide any comments and suggestions regarding the performance of the Software on the e-mail address support@zoiper.com\n\nLicensor agrees to monitor this mailbox, but is under no obligation to implement any of the suggestions and/or proposals, or be required to respond to any questions asked in the e-mail/s.\n\nLicensor and/or its affiliates will be free to use any information Licensee provides, including comments, problem reports, suggestions or enhancement requests, to Licensor for any purpose, subject to any applicable patents or copyrights.\n\nCONTACT\n\nFor any questions arising out of these ZOIPER STANDARD TERMS AND CONDITIONS, please send a valid certified letter mail to the address provided herein, or call the numbers provided herein to receive more information on how to address your questions.\n\nCOMPANY NAME: Securax EOOD\nADDRESS: 33 Simeonovsko shose, fl.4, office 8, 1700 Sofia, Bulgaria\nTELEPHONE NUMBER/S: +1 415 9065157 ; +352 20333140"
            },
            "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/zoiper-thunderbird-plugin/license/1.06"
        },
        "release_notes": {
            "en-US": "Added support for Thunderbird versions 57 and above."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/zoiper-thunderbird-plugin/versions/1.06",
        "version": "1.06"
    },
    {
        "id": 2262070,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "60.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/zoiper-thunderbird-plugin/versions/2262070",
        "files": [
            {
                "id": 803000,
                "created": "2017-12-06T15:05:44Z",
                "hash": "sha256:b1ba12e80e86d7be4e95372bfb79d3b7b24c5e92329355c096f877fd38d0c9d7",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 11550,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/803000/zoiper_thunderbird_plugin-1.04-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 6361,
            "name": {
                "en-US": "Zoiper standard terms and conditions"
            },
            "text": {
                "en-US": "Zoiper Standard Terms and Conditions\n\nI. ACCEPTANCE OF TERMS\n\nThese ZOIPER STANDARD TERMS AND CONDITIONS are a bonding contract between SECURAX EOOD (hereinafter referred to as “Licensor”), a company duly organized under the laws of Bulgaria, with registration number (registered under Bulgaria’s National Tax Register) BG131273941, with its business address at 33 Simeonovsko shose, fl.4, office 8,1700 Sofia, Bulgaria and you (hereinafter referred to as “Licensee”), who is:\n\n(i) the company entering into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(ii) the natural person entering into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(iii) the legal person who on behalf of the company enters into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(iv) the natural person who on behalf of the company enters into these ZOIPER STANDARD TERMS AND CONDITIONS;\nand who is (i) a company (or representing a company) requesting Licensor’s Services and Licensor’s Software Licensing or developing the Licensee’s Application or, who is (ii) the natural person, requesting Licensor’s Services and Licensor’s Software Licensing or developing the Licensee’s Application.\n\nLICENSEE SHOULD READ THESE ZOIPER STANDARD TERMS AND CONDITIONS CAREFULLY, IN THEIR ENTIRETY PRIOR TO ACCESSING AND/OR USING THE SOFTWARE.\n\nBY INSTALLING, DOWNLOADING AND/OR USING THIS SOFTWARE OR LICENSOR’S SERVICES OR AUTHORIZING OTHERS TO DO SO, ON BEHALF OF LICENSEE AND THE ENTITY FROM WHOM LICENSEE IS INSTALLING, DOWNLOADING AND/OR USING THE SOFTWARE, LICENSEE AGREES TO THESE ZOIPER STANDARD TERMS AND CONDITIONS AND CREATES A BINDING CONTRACT BETWEEN LICENSEE AND LICENSOR.\n\nANY USE OF THE SOFTWARE WILL CONSTITUTE LICENSEE’S ASSENT TO THESE ZOIPER STANDARD TERMS AND CONDITIONS (OR RATIFICATION OF PREVIOUS CONSENT).\nII. APPLICABILITY\n\nTHESE ZOIPER STANDARD TERMS AND CONDITIONS FORM AN INTEGRAL PART OF EACH CONTRACT BETWEEN LICENSOR AND LICENSEE AND APPLY TO ALL SUBSEQUENT CONTRACTS RESULTING FROM OR LEADING TO CONTRACT/S, AND TO ALL QUOTATIONS, OFFERS, LETTERS OF INTENT, ORDERS, ORDER CONFIRMATIONS AND OTHER DOCUMENTS AND ACTS MADE AND/OR DONE IN PREPARATION FOR AND/OR PRIOR TO AND/OR IN CONNECTION WITH CONTRACT/S.\n\nIn the event of conflict between the ZOIPER STANDARD TERMS AND CONDITIONS and the provisions of a Contract between the Parties, the provisions of the Contract will prevail.\n\nThe most recent version of the ZOIPER STANDARD TERMS AND CONDITIONS is applicable. The most recent version may be uploaded and found on Licensor’s website.\nIII. DEFINITIONS\n\n1. “Contract/s” is separate written agreement/s between Licensor and Licensee, and could be relating to without limitation: product usage, product licensing, and/or services.\n\n2. “Effective date” means the date a Contract is signed in hardcopy by Licensee or, in the absence of hardcopy or signature, the Contract shall be effective from the date an order/purchase is placed by Licensee.\n\n3. “Extension date” means: (i) the date of the anniversary of the Effective date and (ii) the date of the extension of a Contract between the Parties, according to the Contract’s extension terms and conditions.\n\n4. “Contract year” means (i) the period of one (1) year commencing on the Effective date and continuing until the Extension date and (ii) the period of one (1) year between Extension dates.\n\n5. “Parties” means both together Licensee and Licensor, and “Party” means either Licensee or Licensor separately.\n\n6. “Third Party/s” – means party/parties that is/are neither Licensor nor Licensee, and could be without limitation: (i) party/parties providing services, hardware, software, (ii) government institutions and/or authorities, (iii) servers hardware, software, and/or server-related services providers – VoIP and/or WEB, (iv) any equipment and/or infrastructure hardware, software, and/or service providers, (v) the third parties who own and/or administer the Online Distribution Stores.\n\n7. “End-user” – means a consumer and a natural person obtaining the Software and/or the Services.\n\n8. “Licensor’s Product/s”– means Licensor’s Zoiper software application/s subject to these ZOIPER STANDARD TERMS AND CONDITIONS and subject to Contract/s between the Parties, and available for free or for paid download through Licensor’s Official Distribution Channels, and the Documentation related to Licensor’s Products.\n\n9. “Online Distribution Stores” – the Third Party managed Online Distribution Stores where Licensor’s Product and/or the Software are uploaded to in order to be made available to End-users. For the purposes of the relationship between the Parties, the Online Distribution Stores include but are not limited to:\n\na) Google play application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/0a1d20e1dda9c808535d7d23e8551feebc5eaebfd581957e882809aa74aa59c3/https%3A//play.google.com\">https://play.google.com</a> ),\n\nb) Apple’s iTunes application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/e0b7f788a860e31bc3abe7cee616b02826abf993d9422c775a576702fbc5c327/https%3A//itunes.apple.com\">https://itunes.apple.com</a> ),\n\nc) Windows Phone application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/9a2a82d55ac64093c5b7e71ccf6a1bb9707f4b2fd7f7670377d95d229d38b8eb/http%3A//www.windowsphone.com/en-us/store\">http://www.windowsphone.com/en-us/store</a> ).\n\nLicensor is not affiliated to any of the Third parties managing and/or administrating the Online Distribution Stores. The web addresses to the Third Party Online Distribution Stores provided herein are for informational purposes only and changes may apply. Licensor bears no responsibility for any of the Third parties’ actions, including without limitation: the Third parties’ applying any changes to their Online Distribution Stores, including without limitation: changing their web addresses, their upload/download Online distribution store policies, and/or any of their policies and requirements, including without limitation: requirements for uploading and approving applications.\n\n10. “SDK” – means Licensor’s Software Development Kit and all related Documentation\n\n11. “Documentation” means any technical or specifications or documentation that Licensor may make available or provide to Licensee relating to, or for use in, or with, the Software, including without limitation: SDK documentation, programmer guides, manuals, materials and information appropriate or necessary for use in connection with the Software.\n\n12. “SOW” – stands for Statement Of Work and is a document constituting the entire requirements (and no other requirements) of Licensee related to customization of Licensor’s Product/s.\n\n13. “Software” – for the purposes of these ZOIPER STANDARD TERMS AND CONDITIONS and for the purposes of Contract/s between the Parties, the definition “Software” means either one or all of the definitions below, and is applicable to the entire relationship between the Parties. “Software” could mean all or either one of the following, whichever is applicable to Contract/s between the Parties:\n\na) “SOW Software” – Licensor’s Product/s modified as per the SOW;\n\nb) “SDK Software” means Licensor’s proprietary product: software and files, which may contain either one or a combination of several or all: object code, software libraries, source code, executables, Application Programming Interfaces, software tools, specifications and example source code, and the related to the SDK Software documentation,\n\nc) “Licensor’s Product/s”.\n\n14. “Build” – is a Software file with the following possible extensions (when applicable): .apk for Android,.ipa for iOS, .xap for Windows Phone, .exe for Windows, .dmg for Mac OS X, .tar for Linux, or a compressed file with any of the extensions listed herein.\n\n15. “Services” – means maintenance, technical support, customization services, branding, or any other services performed or to be performed, if any, by Licensor as per Contract/s between the Parties. Some Services require a separate SOW to be executed between the Parties.\n\n16. “Customization” means mutually agreed with Contract/s between the Parties modification to the Software, applied or to be applied by Licensor, resulting in change of the behavior and/or the graphical user interface of Licensor’s Product/s.\n\n17. “Licensee’s software” means one of these definitions or all:\n\na) the application that Licensee has the right to develop, in which the Software will be incorporated. In relation to this definition, “Licensee’s application” means one or more software programs developed by Licensee under Licensee’s trademark or brand and which will be provided to End-users’ computers, tablets and smartphones.\n\n18. “Licensor’s Official Distribution Channels” are (i) Licensor’s website: <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/ac4da812f8031413ca4aa9de971d20669f64db64b8f8949579ecb5bd0c848cd4/http%3A//www.zoiper.com\">www.zoiper.com</a> , and (ii) the Online Distribution Stores.\n\n19. “Confidential Information” means information disclosed, or to be disclosed, by Licensee or Licensor under Contract/s between the Parties, including without limitation: Licensor’s Software information, Software documentation, Software example, SDK documentation, SDK versions, information regarding Licensee’s or Licensor’s technical plans, marketing and financial data.\n\n20. ”Day/s” – means business day/s outside of Licensor’s location Holidays and outside of weekend days as per Licensor’s headquarters address.\n\n21. “Hour/s” – means business hour/s, and where hours are not specified, they shall be considered business hours.\n\n22. “Activation Credentials” means the identification information, e.g. username and/or password, or certificate, used to identify Licensee’s use or the End-users’ utilizing Licensee’s services use of the Software.\n\n23. “Update” – the act of applying a patch or point release (i.e. update version 4.1 to version 4.2) to fix or improve existing functionality, also without limitation: bug fixes, modifications, enhancements, supplements.\n\n24. “Updated Version” – an updated Build of the Software.\n\n25. “Updates License” – means the right to request and receive Updated Versions of the Software twice per contract year per Software during the term of Contract/s with which Licensor provides an Updates License to Licensee, if such contract is signed between the Parties.\n\n26. “Updated Versions Pool” – means the set allowance of two Updated Versions per Software per Updates License of the Software for the period of one (1) contract year during the term of Contract/s with which Licensor provides an Updates License to Licensee, if such contract is signed between the Parties.\n\n27. “New Licensor’s Product Release Version” – an updated build of Licensor’s Product\n\n28. “Upgrade” – means the act of moving from one major release to another (i.e. upgrade from Release 4 to Release 5) during the term of Contract/s with which Licensor provides Upgrades to Licensee, if such contract is signed between the Parties.\n\nUpgrades may involve changes in data structures, program processes, general interface changes, and therefore are more likely to impact a functioning application than an update.\n\n29. “Upgraded Version” means an Upgraded Version of the Software\n\n30. “Fault” – a malfunction of the Software where (i) the faulty behaviour has business impact on a production or test system, restraining at least 10% of Licensee’s end-users or testers to use the Software for making or receiving calls; and (ii) is reproducible on a clean install of the operating system in Licensee’s and Licensor’s environments, independent of specific environment setups; and (iii) occurs regardless of the end-device, the version of the mobile operating system or the server mode, firmware revision or configuration; and (iv) is independent of specific environment setups, third-party hardware, peripherals and/or drivers; and (v) is particularly limited to the licensor product’s standard engine and standard interface.\n\nSEVERITY CLASSIFICATION OF THE FAULTS:\n\nThe Severity Classification of the Faults is intended to describe the severity of the Fault:\n\na) “Critical Fault” – is a Critical Severity Fault of the Software, violating RFC 3261 (SIP) and/or RFC 3550 (RTP), where the faulty behaviour has significant to critical business impact on a production system and is resulting in Licensee’s production system to being either down, or functioning at a significantly reduced capacity\n\nb) “Medium Fault” is a Medium Severity Fault of the Software that has some business impact on a production system, resulting in some functionality loss on Licensee’s production system. The Software is usable, but does not provide a function in a convenient or expeditious manner.\n\nc) “Low Fault” – a Low Severity Fault of the Software occurring in test or non- production environments and is related to questions and issues including general usage questions, issues related to a test or non-production environment, or feature requests. There is no impact on the quality, performance or functionality on Licensee’s production system.\n\n31. “Stock-version of an operating system” – non-modified version of an operating system, as provided by either of the manufacturers, namely: Microsoft, Google, Apple, and without Third Party modifications by device manufacturers.\n\n32. “Purchase Order” means an order issued by Licensee to Licensor for Software or Services to be purchased, licensed or provided under a TERMS OF SALE Contract or under Contract/s between the Parties.\n\n33. “Proforma Invoice” is a document, issued by Licensor, preceding Licensee’s payment towards Licensor and indicating Licensee’s due amounts for payment. In the absence of a Proforma Invoice all other indication methods apply. The absence of a Proforma Invoice does not release Licensee of Licensee’s payment obligations.\n\n34. “Distributable software” means the Software in the form of binary object files, software library, linkable object files or dynamic link library, and/or executable files.\n\n35. “Example Source Code” means example software program in source code format or a sample source code included in the SDK, provided the source code is compiled into a software program and is not distributed in human-readable form.\n\n36. “API” means the Zoiper Application Programming Interfaces contained in the Software, including documentation, header files and related information.\nIV. CONFIDENTIALITY\n\nLicensee acknowledges that the Software and any other technical and/or commercial information not in the public domain obtained by Licensee are regarded as confidential by Licensor.\n\nAny Activation Credentials issued by Licensor to Licensee are confidential and shall be treated in accordance with these ZOIPER STANDARD TERMS AND CONDITIONS or any Mutual Non-Disclosure Agreement (“MNDA”) signed between the Parties or Contract/s signed between the Parties. Licensee agrees to take all reasonable measures to protect all Confidential Information including the Software, Documentation, Activation Credentials using at least the same degree of care that Licensee protects its own confidential information, however not less than a reasonable degree of care.\n\nLicensee agrees to use the Confidential Information and the Activation Credentials solely for the purpose of exercising Licensee’s rights and performing Licensees obligations under the business relationship between Licensee and Licensor, and Licensee agrees (i) to not disclose the Confidential Information to any Third Party and (ii) to not use the Confidential Information or the Activation Credentials for any other purpose, without Licensor’s prior written notice of consent.\n\nLicensee agrees not to permit or authorize access to, or disclosure of the Software to any person or entity other than employees of Licensee who (i) have signed in writing to be bound by these ZOIPER STANDARD TERMS AND CONDITIONS and who (ii) have a need to access the Software for the performance of Licensee’s rights and obligations. Licensee shall take appropriate measures by instruction and agreement prior to disclose to such employees to assure against unauthorized use or disclosure.\n\nAny applicable distribution rights will be governed by an additional contract for distribution license rights.\n\nAny press release or publication regarding these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties is subject to prior review and written approval by Licensor.\n\nThe obligations of confidentiality shall not apply to information which has entered the public domain except where such entry is the result of Licensee’s breach of these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties, or is required to be disclosed pursuant to a court order, so long as Licensor is given adequate notice and the ability to challenge such required disclosure.\n\nIf a MNDA is signed between the Parties prior to applying of these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties, (i) the confidentiality relationship between the Parties is subject to the MNDA, (ii) the MNDA signed between the parties prior to these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract becomes an integral part of these ZOIPER STANDARD TERMS AND CONDITIONS and Contract/s between the Parties, (iii) in case of conflict between the MNDA and this CONFIDENTIALITY clause, the MNDA will take predominance.\n\nV. PROPRIETARY SOFTWARE\n\nLicensor’s Products are closed source software. No portions of any of Licensor’s Products source code will be made available to Licensee.\n\nVI. TRADEMARK\n\n“Zoiper” is a registered trade mark and all applicable laws in relation to protection and use of Zoiper’s trademark apply.\n\nVII. OWNERSHIP AND INTELLECTUAL PROPERTY RIGHTS\n\nAll ownership and intellectual property rights in the Software and any copies or derivative works thereof (regardless of form or media in or which the original copies may exist), including but not limited to patents, design rights, copyrights, trademarks, trade-secrets and proprietary know-how, shall be owned by and vested in Licensor and nothing in these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties shall constitute or be interpreted as a transfer of such rights from Licensor to Licensee.\n\nLicensee acknowledges that the structure and the source code of the Software are valuable trade secrets of Licensor and shall remain the sole property of Licensor.\n\nVIII. COPYRIGHT AND INTELLECTUAL PROPERTY NOTICES\n\nCertain software programs or libraries included in the Software may contain software (including open source software) distributed under Third Party agreements (“Third Party Components”), which may contain terms that expand or limit rights to use certain portions of the Software (“Third Party Terms”).\n\nAny use, reproduction and distribution of components of the Software licensed under an open source software license are governed solely by the terms of such open source software license and not to these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties.\n\nLicensor’s intellectual property right and copyright notices as per Licensor’s sole discretion are and shall be integral part of the “About box” of the Software, together with the following Third Party copyrights information:\n\nTHIRD PARTY TECHNOLOGIES THAT ARE OR MAY BE USED BY LICENSOR’S PRODUCT/S:\n\n    Securax EOOD\n    JThread, Copyright (C) 2000-2005 Jori Liesenborgs (jori@lumumba.uhasselt.be)\n    JRTPLIB, part of JRTPLIB Copyright (C) 1999-2005 Jori Liesenborgs\n    GSM, Copyright 1992, 1993, 1994 by Jutta Degener and Carsten Bormann, Technische Universitaet Berlin\n    iLBC, iLBC Speech Coder ANSI-C Source Code iLBC_define.h Copyright (C) The Internet Society (2004). All Rights Reserved.\n    SPEEX The Xiph OSC and the Speex Parrot logos are trademarks (TM) of <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/39820572d7164f0b84796aed13521d9e02a4ee193c87c928d344d269e850e69b/http%3A//Xiph.Org\">Xiph.Org</a>\n    OpenLDAP, Copyright 1999-2003 The OpenLDAP Foundation, Redwood City, California, USA. All Rights Reserved.\n    PortAudio, Copyright (C) 1999-2002 Ross Bencina and Phil Burk\n    PortMixer, PortMixer, Windows WMME Implementation, Copyright (C) 2002, Written by Dominic Mazzoni and Augustus Saunders\n    Resiprocate, The Vovida license The Vovida Software License, Version 1.0, Copyright (C) 2000 Vovida Networks, Inc. All rights reserved.\n    This product includes cryptographic software written by Eric Young (eay@cryptsoft.com)\n    This product includes software written by Tim Hudson (tjh@cryptsoft.com)\n    This product is using the gloox XMPP library - Copyright by Jakob Schroeter\n    This product is using ReorderListBox written by Jason Gincherau\n    This product is using <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/18b679f066fcfbbd112ac31f4601ce8a6e2c9c6ac5319244783d024d360d1721/http%3A//ZXing.net\">ZXing.net</a> written by Michael Jahn\n    This product is using Coding4Fun Toolkit\n    This product is using C# port of libphonenumber by Erez A. Korn (<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/1b16cdbf7c883dc6dc74142cb484f1e9df82f758fb8d28a09e4860d150aaffe3/https%3A//github.com/erezak\">https://github.com/erezak</a>)\n\nIf Licensee is entitled to an Update of the Software and if the Software includes additional Third Party technology, Licensor has the right to add to the “About box” the additional intellectual property right information and copyright information, and, when handled by Licensee, Licensee is obliged to update the “About box”.\n\nLicensee shall not remove, obscure or alter proprietary rights notices (including without limitation: copyright and trademark notices) that may be in the copies of the Software.\n\nRedistribution in binary form, to the extent permitted by Contract/s between the Parties, must also reproduce Licensor’s copyright as well as Third Party copyrights incorporated in the Software, trademark or other Licensor or Third Party proprietary notices as incorporated in the Software in any associated Documentation or startup application images “Splash screens” or “About box” that display Licensee copyright notices.\n\nInformation identifying the copyright holders of the Third Party Components and the Third Party Terms that apply are available in the Documentation and/or in these ZOIPER STANDARD TERMS AND CONDITIONS and/or in Contract/s between the Parties.\n\nIX. NO TRANSFER OF INTELLECTUAL PROPERTY RIGHTS\n\nExcept for the rights granted by Licensor to Licensee with Contract/s, no other rights, including without limitation: no intellectual property and/or no intellectual property rights, are transferred to Licensee.\n\nX. NON-ASSERTION BY LICENSEE\n\nLicensee agrees not to assert in any way any patent owned by Licensee arising out of or in connection with this Software or modifications made thereto or applications developed using the Software against Licensor, Licensor’s subsidiaries and/or affiliates and/or their customers, direct or indirect, agents and contractors (collectively, the “Licensor Product Users”) for the manufacture, use, import, licensing, offer for sale or sale of any Licensor’s Products.\n\nXI. LIMITED WARRANTY\n1. NO SOFTWARE WARRANTY\n\nLICENSOR PROVIDES AND LICENSES THE SOFTWARE (AND/OR THE SOURCE CODE EXAMPLES IF APPLICABLE) “AS IS”. LICENSOR MAKES NO REPRESENTATIONS OR WARRANTIES AND THERE ARE NO CONDITIONS, ENDORSEMENTS, GUARANTEES, REPRESENTATIONS OR WARRANTIES OF ANY KIND EITHER EXPRESS OR IMPLIED, (INCLUDING WITHOUT LIMITATION ANY EXPRESS OR IMPLIED WARRANTIES OR CONDITIONS OF QUALITY, PERFORMANCE, RESULTS, FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY, MERCHANTABLE QUALITY, DURABILITY, TITLE, NON-INFRINGEMENT OR ARISING BY STATUTE OR OTHERWISE IN LAW OR FROM A COURSE OF DEALING OR USAGE OF THE TRADE) ARISING OUT OF OR RELATED TO THESE ZOIPER STANDARD TERMS AND CONDITIONS AND/OR AN EXISTING CONTRACT OR VALID TERMS BETWEEN THE PARTIES OR ARISING OUT OF OR RELATED TO ANY SOFTWARE, SOFTWARE INFORMATION OR THEIR PERFORMANCE OR FAILURE TO PERFORM.\n\nLICENSEE AGREES TO ASSUME ALL RISKS ASSOCIATED WITH LICENSEE AND LICENSEE’S AUTHORIZED USERS’ USE OF THE SOFTWARE. LICENSEE IS RESPONSIBLE FOR TAKING PRECAUTIONARY MEASURES TO PREVENT THE LOSS OR DESTRUCTION OF LICENSEE’S DATA AND DATABASES SUCH AS, FOR EXAMPLE MAKING REGULAR BACKUPS AND VERIFYING THE RESULTS OBTAINED FROM ANY SOFTWARE’S, AND LICENSOR WILL HAVE NO OBLIGATIONS OR LIABILITY WHATSOEVER WITH RESPECT TO ANY SUCH LOSS OR DESTRUCTION.\n\n2. LIMITED SERVICES WARRANTY\n\nSERVICES PROVIDED WITH CONTRACT/S BETWEEN THE PARTIES SHALL BE PERFORMED IN A WORKMANLIKE MANNER CONSISTENT WITH INDUSTRY STANDARDS.\n\nLICENSEE MUST NOTIFY LICENSOR PROMPTLY, BUT IN NO EVENT MORE THAN FOURTEEN (14) DAYS AFTER COMPLETION OF THE SERVICES, OF ANY CLAIMED BREACH OF THIS WARRANTY.\n\nLICENSEE’S SOLE AND EXCLUSIVE REMEDY FOR BREACH OF THIS WARRANTY SHALL BE, AT LICENSOR’S OPTION, RE-PERFORMANCE OF THE SERVICES, OR TERMINATION OF THE CONTRACT/S AND THESE ZOIPER STANDARD TERMS AND CONDITIONS, OR THE APPLICABLE SERVICE AND RETURN OF THE SERVICE FEES PAID TO LICENSOR BY LICENSEE FOR SUCH NON-CONFORMING SERVICE. THE PROVISION OF SERVICES UNDER CONTRACT/S BETWEEN THE PARTIES OR THESE ZOIPER STANDARD TERMS AND CONDITIONS DO NOT EXTEND THE WARRANTIES PROVIDED WITH ANY SOFTWARE ORDERED/PURCHASED BY LICENSEE.\n\nXII. PUBLICITY\n\nUnless otherwise prohibited in writing between the Parties, these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties give either Party the right to use for marketing purposes the other Party’s trade names, trademarks, service marks, domain names, and/or other distinctive brand features, except as may be contained in the Software.\n\nXIII. USE OF BRAND NAMES, TRADEMARKS, LOGOS\n\nWhen agreed in writing between the PARTIES, the PARTIES may, initiate mutual positive marketing campaigns, execute mutual marketing efforts, including without limitation, link to each other’s websites, create and distribute press releases, reference to the other Party, and execute other positive marketing practices.\n\nWith respect to mutual positive marketing campaigns and referencing, the Parties agree as follows:\n\n(a) each Party agrees to use the brands, trademarks, logos, and all information and mentions of the other Party’s brand name and services in good faith and solely with the purpose of the business relationship between the Parties and\n\n(b) upon confirmation of the mutual positive marketing campaign by each Party, each Party provides the right of use of its brands, trademarks, logos of the Party’s brand name and services for the purposes of the positive marketing campaign. This right can be terminated for whatever reason by the Party providing this right with five (5) business days’ notice send by certified mail to the address provided by the Party obtaining the right in the separate written agreement, return receipt required, to the Party obtaining the right. In case of such termination of this right, the Party obtaining the right should cease the use of the brands, trademarks, logos, and all information and mentions of the other Party’s brand name and services within five (5) business days following receipt of such notice.\n\nLicensee is responsible and liable for all the intellectual property rights and copyrights, related to the used materials, for example without limitation: logos, images, trademarks, provided to Licensor by Licensee to be used for the performance of activities governed by Contract/s between the Parties.\n\nXIV. LIMITATION, EXCLUSION OF LIABILITY AND INDEMNIFICATION\n\nREFERENCES TO LIABILITY IN THIS LIMITATION, EXCLUSION OF LIABILITY AND INDEMNIFICATION SECTION INCLUDES WITHOUT LIMITATION: LIABILITY ARISING FROM AGREEMENT, CONTRACT, TORT (INCLUDING NEGLIGENCE), UNDER ANY INDEMNITY, STRICT LIABILITY OR OTHERWISE, IN EACH CASE EVEN IF LICENSOR HAS BEEN INFORMED OF THE POSSIBILITY OF THAT LIABILITY.\n\nSOME STATES AND COUNTRIES, INCLUDING MEMBER COUNTRIES OF THE EUROPEAN UNION, DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES AND, THEREFORE, THE FOLLOWING LIMITATION OR EXCLUSION MAY NOT APPLY IN THOSE STATES AND COUNTRIES.\n\nTO THE MAXIMUM EXTENT PERMITTED BY THE APPLICABLE LAW AND REGARDLESS OF WHETHER ANY REMEDY SET OUT HEREIN FAIL OF THEIR ESSENTIAL PURPOSE, IN NO EVENT SHALL LICENSOR BE LIABLE TO LICENSEE FOR ANY SPECIAL, CONSEQUENTIAL, INDIRECT OR SIMILAR DAMAGES OR LOSS OF PROFITS, REVENUE, TOLL FRAUD, BUSINESS SAVINGS OR GOODWILL, REPUTATION, DATA, FEES, EXPENSES OF ANY KIND OR NATURE, LICENSEE’S OBLIGATION TO COMPENSATE A THIRD PARTY, ARISING OUT OF THE PURCHASE OR INABILITY TO PURCHASE THE SOFTWARE EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nNOTWITHSTANDING ANY OTHER PROVISIONS IN THESE ZOIPER STANDARD TERMS AND CONDITIONS OR AN EXISTING CONTRACT OR VALID TERMS BETWEEN THE PARTIES, IF ENFORCED BY THE APPLICABLE LAW, LICENSOR’S LIABILITY TO LICENSEE SHALL BE LIMITED TO THE AMOUNTS PAID BY LICENSEE TO LICENSOR FOR THE SPECIFIC SOW SOFTWARE OR FOR THE SPECIFIC SDK SOFTWARE OR FOR THE SPECIFIC LICENSOR’S PRODUCT OR FOR THE SPECIFIC SERVICE FOR A SPECIFIC SOW SOFTWARE OR SDK SOFTWARE, AND EXCLUDING (I) PAYMENTS TO THIRD PARTIES AND (II) THIRD-PARTY LICENSE FEES AND (III) ADDITIONAL EXPENSES MADE TO THIRD PARTIES, SUCH AS BUT NOT LIMITED TO THIRD-PARTY COMPANIES FOR PERFORMANCE OF EITHER PARTY’S SERVICES.\n\nNOTHING HEREIN LIMITS OR EXCLUDES THE LIABILITY OF LICENSEE TO LICENSOR ARISING OUT OF (I) LICENSEE’S BREACH OF THESE ZOIPER STANDARD TERMS AND CONDITIONS; (II) LICENSEE’S BREACH OF ANY CONTRACT BETWEEN THE PARTIES; (III) LICENSEE’S BREACH OF LICENSE AGREEMENT BETWEEN THE PARTIES, AND/OR (III) ANY AMOUNTS DUE TO LICENSOR UNDER ANY CONTRACT, AND/OR (IV) THIRD PARTY FEES, INCLUDING BUT NOT LIMITED TO THIRD PARTY LICENSE FEES. THIRD PARTY FEES SHALL, TO THE EXTENT PRACTICAL AND IF POSSIBLE, BE BILLED BY LICENSOR TO LICENSEE AS A SEPARATE ITEM.\n\nLICENSEE SHALL INDEMNIFY AND HOLD LICENSOR AND LICENSOR’S AFFILIATES, OFFICERS, DIRECTORS, AGENTS, SUPPLIERS, CUSTOMERS AND EMPLOYEES HARMLESS FROM AND AGAINST ALL CLAIMS, DAMAGES, LOSSES, LIABILITIES, COSTS, CHARGES AND EXPENSES (INCLUDING ATTORNEYS’ FEES), SETTLEMENT FEES AND EXPENSES (INCLUDING REASONABLE FEES OF ATTORNEYS AND OTHER PROFESSIONALS) ARISING OUT OF LICENSEE’S PURCHASE AND/OR USE OF THE SOFTWARE, AND/OR INCURRED BY BREACH OF THESE ZOIPER STANDARD TERMS AND CONDITIONS OR BY BREACH OF ANY CONTRACT BETWEEN THE PARTIES OR BY REASON OF ANY CLAIM IN RESPECT OF THE DISTRIBUTION OR SALE OF SOFTWARE OR OTHER PRODUCTS (INCLUDING BUT NOT LIMITED TO APPLICATIONS, INTERFACES AND APPLICATION PROGRAMMING INTERFACES) DEVELOPED UTILIZING THE SOFTWARE, INCLUDING BUT NOT LIMITED TO: PRODUCTS, LIABILITY CLAIMS AND CLAIMS OF INFRINGEMENT OF THIRD PARTY INTELLECTUAL RIGHTS.\n\nLICENSOR MAKES NO REPRESENTATION OR WARRANTY AS TO THE VALIDITY OR ENFORCEABILITY OF THE TRADE MARKS, NOR AS TO WHETHER THESE INFRINGE ANY INTELLECTUAL PROPERTY RIGHTS OF THIRD PARTIES.\n\nXV. FORCE MAJEURE\n\nLicensor shall not be liable for any delay or failure in performance due to events outside Licensor’s reasonable control, besides the understanding of this term in jurisdiction and case law, all external causes, which cannot be influenced by Licensor but though which Licensor is unable to carry out its commitments, including, without limitation:\n\n    War, riots, civil or military insurrection and political coups;\n    Natural disasters such as earthquakes, fire, storms and floods;\n    Governmental acts and omissions;\n    Terrorism and sabotage;\n    Labor disputes\n    Industry-wide shortages of supplies, delays in common carriers\n    Epidemics\n\nThe obligations and rights of Licensor shall be extended for a period equal to the period during which such event prevented Licensor’s performance.\n\nLicensee’s obligation to pay monies due and owing to Licensor cannot be delayed or failed due to Force Majeure circumstances and thus no Force Majeure circumstances cure Licensee from Licensee’s duty to pay the amounts due and owing to Licensor.\n\nXVI. HIGH RISK ACTIVITIES\n\nTHE SOFTWARE IS NOT FAULT-TOLERANT AND IS NOT DESIGNED, MANUFACTURED OR INTENDED FOR ANY USE REQUIRING FAIL-SAFE PERFORMANCE IN WHICH THE FAILURE OF A PRODUCT COULD LEAD TO DEATH, SERIOUS PERSONAL INJURY, SEVERE PHYSICAL OR ENVIRONMENTAL DAMAGE (“HIGH RISK ACTIVITIES”). THIS INCLUDES THE OPERATION OF AIRCRAFT OR NUCLEAR FACILITIES, EMERGENCY RESPONSE.\n\nLICENSEE AGREES NOT TO USE, OR LICENSE THE USE OF, THE SOFTWARE OR DERIVED LICENSEE SOFTWARE IN CONNECTION WITH ANY HIGH RISK ACTIVITIES.\n\nXVII. THIRD-PARTY EQUIPMENT / SOFTWARE\n\nLicensee is responsible, at own risk for proper equipment, including Third Party infrastructure and other facilities that provide access to the network at which Licensee can receive the provided Software by Licensor, for instance without limitation devices and necessary equipment on which Licensee will use the Software.\n\nXVIII. GENERAL AGREEMENT PROVISIONS\n1. SIGNATURE VALIDITY\n\nIn the event that any Party’s signature is delivered by facsimile transmission, such signature shall create a valid and binding obligation of the Party executing (or on whose behalf such signature is executed), with the same force and effect as if such facsimile signature page were an original thereof.\n\n2. CHOICE OF LAW\n\nTHESE ZOIPER STANDARD TERMS AND CONDITIONS are governed by and construed in accordance with the laws of the Kingdom of Belgium.\n\n3. NUMBERING\n\nThe numbering in these ZOIPER STANDARD TERMS AND CONDITIONS is solely for the convenience of the Parties.\n\n4. SURVIVAL\n\nALL CLAUSES HEREIN SURVIVE EXPIRATION OR EARLIER TERMINATION OF THESE ZOIPER STANDARD TERMS AND CONDITIONS OR ANY CONTRACT BETWEEN THE PARTIES.\n\n5. APPLICABILITY\n\nIf any portion of these ZOIPER STANDARD TERMS AND CONDITIONS is found invalid or unenforceable under judicial decree or decision of a Court, the remainder of these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties shall remain valid and enforceable to the extent according to their terms and the invalid clause shall be replaced by Licensor by a clause which reflects the object of the original clause as close as possible. The other provisions of these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties will remain in full force and effect.\n\n6. COMPLIANCE WITH LAWS AND EXPORT RESTRICTIONS\n\nLICENSEE IS ADVISED THAT THE SOFTWARE MAY CONTAIN ENCRYPTION ALGORITHMS THAT MAY BE LIMITED FOR EXPORT WITHOUT A LICENSE ISSUED BY THE U.S. BIS, THE EUROPEAN UNION OR ANY OTHER COUNTRY’S GOVERNMENTAL AGENCIES WHERE APPLICABLE.\n\nADDITIONALLY, LICENSEE IS ADVISED THAT OBTAINING THE SOFTWARE THROUGH THIRD PARTY APPLICATION STORES SUCH AS, BUT NOT LIMITED TO WINDOWS PHONE STORE, GOOGLE PLAY AND ITUNES APP STORE, MAY BE SUBJECT TO ADDITIONAL REGULATIONS SUCH AS BUT NOT LIMITED TO U.S. EXPORT ADMINISTRATION REGULATIONS (EAR). LICENSEE IS RESPONSIBLE FOR ADHERING TO THE APPLICABLE REGULATIONS.\n\nLICENSEE IS AWARE AND AGREES THAT THE SOFTWARE MAY ONLY BE USED FOR CIVIL PURPOSES AND THE SOFTWARE MUST NEVER BE USED FOR ANY DIRECT OR INDIRECT MILITARY OR OTHER PURPOSE PROHIBITED UNDER ANY APPLICABLE REGULATION.\n\nLICENSEE AGREES NOT TO DIRECTLY OR INDIRECTLY EXPORT, RE-EXPORT, IMPORT OR TRANSMIT THE SOFTWARE CONTRARY TO THE LAWS AND REGULATIONS OF ANY GOVERNMENTAL ENTITY (NATIONAL, SUBNATIONAL AND/OR SUPRANATIONAL) THAT HAS JURISDICTION OR AUTHORITY OVER THE COUNTRIES FROM OR TO WHICH THE SOFTWARE IS BEING IMPORTED, EXPORTED, TRANSMITTED OR USED.\n\nLICENSEE HEREBY REPRESENTS THAT TO THE BEST OF LICENSEE’S KNOWLEDGE, LICENSEE IS ELIGIBLE TO RECEIVE THE SOFTWARE UNDER APPLICABLE LAW.\n\nIF LICENSEE MOVES ANY SOFTWARE, AND AS A RESULT OF SUCH MOVE, A JURISDICTION IMPOSES A DUTY, TAX, LEVY OR FEE (INCLUDING WITHHOLDING TAXES, FEES, CUSTOMS, OR OTHER DUTIES FOR IMPORT AND EXPORT OF ANY SUCH SOFTWARE), THEN LICENSEE IS SOLELY LIABLE FOR ANY SUCH DUTY, TAXES, LEVY OR OTHER FEES AND LICENSEE IS SOLELY RESPONSIBLE FOR, AND WILL PAY, ANY SUCH DUTY, TAXES, LEVY, OR OTHER FEES.\n\n7. NATURE OF RELATIONSHIP\n\nThese ZOIPER STANDARD TERMS AND CONDITIONS or any Contracts between the Parties shall not create or be construed as creating a joint venture, co-ownership, partnership, employment or agency relationship, unless specifically created to create such.\n\nThe Parties acknowledge and agree that these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties does not create, and shall not be construed to create any employment relationship between Licensee and Licensor’s own employees.\n\n8. EXCLUSIVITY\n\nNeither Party provides exclusivity rights to the other with these ZOIPER STANDARD TERMS AND CONDITIONS and with any Contract between the Parties, unless specifically created to provide such.\n\n9. WAIVER\n\nNo failure or delay by either Party to exercise or enforce any of its rights, powers or remedies under these ZOIPER STANDARD TERMS AND CONDITIONS and under any Contract between the Parties will act as a waiver of such rights, powers or remedies and no waiver of a breach in a particular situation shall be held to be a waiver of any other or subsequent breach and nor will any partial exercise preclude any further exercise of the same, or of some other right, power or remedy.\n\n10. DISPUTES\n\nAll disputes between the Parties arising from these ZOIPER STANDARD TERMS AND CONDITIONS, any Contract between the Parties, other agreements, and commitments, must be settled in a court of competent jurisdiction in Belgium.\n\n11. COSTS\n\nEach Party shall bear all costs and expenses incurred by it or in connection with these ZOIPER STANDARD TERMS AND CONDITIONS and with any Contract between the Parties, unless stated otherwise.\n\n12. PROFESSIONAL SERVICES - SUPPORT AND CUSTOM DEVELOPMENT\n\nNothing in these ZOIPER STANDARD TERMS AND CONDITIONS shall be construed to require Licensor to provide support services or updates, upgrades, bug fixes, modifications, custom development, development services to Licensee. All professional services offered by Licensor require Contract/s between the Parties.\n\nLicensee will be solely responsible for providing support to Licensee’s end users for the Licensee Software distributed by Licensee.\n\n13. TRANSFER OF THE AGREEMENT\n\nLicensee is not entitled to transfer these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties to Third Parties, including but not limited to Licensee’s rights and obligations, without the written consent of Licensor.\n\n14. ASSIGNMENT\n\nLicensee may not assign these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties or any interest or rights granted hereunder to any Third Party without the written consent of Licensor. A change of control or reorganization of Licensee pursuant to a merger, sale of assets or stock shall be deemed to be an assignment under these ZOIPER STANDARD TERMS AND CONDITIONS and under Contract/s between the Parties. Notwithstanding any assignment by Licensee, Licensee shall remain liable for the payment of all amounts due under any agreement between the Parties.\n\n15. NOTICES\n\nLicensor keeps the right to change these ZOIPER STANDARD TERMS AND CONDITIONS without prior notice. The valid ZOIPER STANDARD TERMS AND CONDITIONS are made available by Licensor on Licensor’s website and updated accordingly by Licensor, and shall be deemed accepted by Licensee shall Licensee continue to apply its rights according to any Contract between Licensee and Licensor.\n\nNotwithstanding the foregoing, notices regarding changes in pricing, license terms, policies or programs may be by posting on <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/ac4da812f8031413ca4aa9de971d20669f64db64b8f8949579ecb5bd0c848cd4/http%3A//www.zoiper.com\">www.zoiper.com</a> or by e-mail.\n\n16. FEEDBACK\n\nLicensee agrees to provide any comments and suggestions regarding the performance of the Software on the e-mail address support@zoiper.com\n\nLicensor agrees to monitor this mailbox, but is under no obligation to implement any of the suggestions and/or proposals, or be required to respond to any questions asked in the e-mail/s.\n\nLicensor and/or its affiliates will be free to use any information Licensee provides, including comments, problem reports, suggestions or enhancement requests, to Licensor for any purpose, subject to any applicable patents or copyrights.\n\nCONTACT\n\nFor any questions arising out of these ZOIPER STANDARD TERMS AND CONDITIONS, please send a valid certified letter mail to the address provided herein, or call the numbers provided herein to receive more information on how to address your questions.\n\nCOMPANY NAME: Securax EOOD\nADDRESS: 33 Simeonovsko shose, fl.4, office 8, 1700 Sofia, Bulgaria\nTELEPHONE NUMBER/S: +1 415 9065157 ; +352 20333140"
            },
            "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/zoiper-thunderbird-plugin/license/1.04"
        },
        "release_notes": null,
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/zoiper-thunderbird-plugin/versions/1.04",
        "version": "1.04"
    },
    {
        "id": 1958891,
        "channel": "listed",
        "compatibility": {
            "thunderbird": {
                "max": "59.0",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/zoiper-thunderbird-plugin/versions/1958891",
        "files": [
            {
                "id": 525031,
                "created": "2016-10-24T11:17:04Z",
                "hash": "sha256:ea84014d6e2d751b505a8ce9341154a06b3a75fabea63b20ee7af1c5fb71d553",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 10866,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/525031/zoiper_thunderbird_plugin-1.01-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 6361,
            "name": {
                "en-US": "Zoiper standard terms and conditions"
            },
            "text": {
                "en-US": "Zoiper Standard Terms and Conditions\n\nI. ACCEPTANCE OF TERMS\n\nThese ZOIPER STANDARD TERMS AND CONDITIONS are a bonding contract between SECURAX EOOD (hereinafter referred to as “Licensor”), a company duly organized under the laws of Bulgaria, with registration number (registered under Bulgaria’s National Tax Register) BG131273941, with its business address at 33 Simeonovsko shose, fl.4, office 8,1700 Sofia, Bulgaria and you (hereinafter referred to as “Licensee”), who is:\n\n(i) the company entering into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(ii) the natural person entering into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(iii) the legal person who on behalf of the company enters into these ZOIPER STANDARD TERMS AND CONDITIONS, or\n\n(iv) the natural person who on behalf of the company enters into these ZOIPER STANDARD TERMS AND CONDITIONS;\nand who is (i) a company (or representing a company) requesting Licensor’s Services and Licensor’s Software Licensing or developing the Licensee’s Application or, who is (ii) the natural person, requesting Licensor’s Services and Licensor’s Software Licensing or developing the Licensee’s Application.\n\nLICENSEE SHOULD READ THESE ZOIPER STANDARD TERMS AND CONDITIONS CAREFULLY, IN THEIR ENTIRETY PRIOR TO ACCESSING AND/OR USING THE SOFTWARE.\n\nBY INSTALLING, DOWNLOADING AND/OR USING THIS SOFTWARE OR LICENSOR’S SERVICES OR AUTHORIZING OTHERS TO DO SO, ON BEHALF OF LICENSEE AND THE ENTITY FROM WHOM LICENSEE IS INSTALLING, DOWNLOADING AND/OR USING THE SOFTWARE, LICENSEE AGREES TO THESE ZOIPER STANDARD TERMS AND CONDITIONS AND CREATES A BINDING CONTRACT BETWEEN LICENSEE AND LICENSOR.\n\nANY USE OF THE SOFTWARE WILL CONSTITUTE LICENSEE’S ASSENT TO THESE ZOIPER STANDARD TERMS AND CONDITIONS (OR RATIFICATION OF PREVIOUS CONSENT).\nII. APPLICABILITY\n\nTHESE ZOIPER STANDARD TERMS AND CONDITIONS FORM AN INTEGRAL PART OF EACH CONTRACT BETWEEN LICENSOR AND LICENSEE AND APPLY TO ALL SUBSEQUENT CONTRACTS RESULTING FROM OR LEADING TO CONTRACT/S, AND TO ALL QUOTATIONS, OFFERS, LETTERS OF INTENT, ORDERS, ORDER CONFIRMATIONS AND OTHER DOCUMENTS AND ACTS MADE AND/OR DONE IN PREPARATION FOR AND/OR PRIOR TO AND/OR IN CONNECTION WITH CONTRACT/S.\n\nIn the event of conflict between the ZOIPER STANDARD TERMS AND CONDITIONS and the provisions of a Contract between the Parties, the provisions of the Contract will prevail.\n\nThe most recent version of the ZOIPER STANDARD TERMS AND CONDITIONS is applicable. The most recent version may be uploaded and found on Licensor’s website.\nIII. DEFINITIONS\n\n1. “Contract/s” is separate written agreement/s between Licensor and Licensee, and could be relating to without limitation: product usage, product licensing, and/or services.\n\n2. “Effective date” means the date a Contract is signed in hardcopy by Licensee or, in the absence of hardcopy or signature, the Contract shall be effective from the date an order/purchase is placed by Licensee.\n\n3. “Extension date” means: (i) the date of the anniversary of the Effective date and (ii) the date of the extension of a Contract between the Parties, according to the Contract’s extension terms and conditions.\n\n4. “Contract year” means (i) the period of one (1) year commencing on the Effective date and continuing until the Extension date and (ii) the period of one (1) year between Extension dates.\n\n5. “Parties” means both together Licensee and Licensor, and “Party” means either Licensee or Licensor separately.\n\n6. “Third Party/s” – means party/parties that is/are neither Licensor nor Licensee, and could be without limitation: (i) party/parties providing services, hardware, software, (ii) government institutions and/or authorities, (iii) servers hardware, software, and/or server-related services providers – VoIP and/or WEB, (iv) any equipment and/or infrastructure hardware, software, and/or service providers, (v) the third parties who own and/or administer the Online Distribution Stores.\n\n7. “End-user” – means a consumer and a natural person obtaining the Software and/or the Services.\n\n8. “Licensor’s Product/s”– means Licensor’s Zoiper software application/s subject to these ZOIPER STANDARD TERMS AND CONDITIONS and subject to Contract/s between the Parties, and available for free or for paid download through Licensor’s Official Distribution Channels, and the Documentation related to Licensor’s Products.\n\n9. “Online Distribution Stores” – the Third Party managed Online Distribution Stores where Licensor’s Product and/or the Software are uploaded to in order to be made available to End-users. For the purposes of the relationship between the Parties, the Online Distribution Stores include but are not limited to:\n\na) Google play application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/0a1d20e1dda9c808535d7d23e8551feebc5eaebfd581957e882809aa74aa59c3/https%3A//play.google.com\">https://play.google.com</a> ),\n\nb) Apple’s iTunes application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/e0b7f788a860e31bc3abe7cee616b02826abf993d9422c775a576702fbc5c327/https%3A//itunes.apple.com\">https://itunes.apple.com</a> ),\n\nc) Windows Phone application store ( <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/9a2a82d55ac64093c5b7e71ccf6a1bb9707f4b2fd7f7670377d95d229d38b8eb/http%3A//www.windowsphone.com/en-us/store\">http://www.windowsphone.com/en-us/store</a> ).\n\nLicensor is not affiliated to any of the Third parties managing and/or administrating the Online Distribution Stores. The web addresses to the Third Party Online Distribution Stores provided herein are for informational purposes only and changes may apply. Licensor bears no responsibility for any of the Third parties’ actions, including without limitation: the Third parties’ applying any changes to their Online Distribution Stores, including without limitation: changing their web addresses, their upload/download Online distribution store policies, and/or any of their policies and requirements, including without limitation: requirements for uploading and approving applications.\n\n10. “SDK” – means Licensor’s Software Development Kit and all related Documentation\n\n11. “Documentation” means any technical or specifications or documentation that Licensor may make available or provide to Licensee relating to, or for use in, or with, the Software, including without limitation: SDK documentation, programmer guides, manuals, materials and information appropriate or necessary for use in connection with the Software.\n\n12. “SOW” – stands for Statement Of Work and is a document constituting the entire requirements (and no other requirements) of Licensee related to customization of Licensor’s Product/s.\n\n13. “Software” – for the purposes of these ZOIPER STANDARD TERMS AND CONDITIONS and for the purposes of Contract/s between the Parties, the definition “Software” means either one or all of the definitions below, and is applicable to the entire relationship between the Parties. “Software” could mean all or either one of the following, whichever is applicable to Contract/s between the Parties:\n\na) “SOW Software” – Licensor’s Product/s modified as per the SOW;\n\nb) “SDK Software” means Licensor’s proprietary product: software and files, which may contain either one or a combination of several or all: object code, software libraries, source code, executables, Application Programming Interfaces, software tools, specifications and example source code, and the related to the SDK Software documentation,\n\nc) “Licensor’s Product/s”.\n\n14. “Build” – is a Software file with the following possible extensions (when applicable): .apk for Android,.ipa for iOS, .xap for Windows Phone, .exe for Windows, .dmg for Mac OS X, .tar for Linux, or a compressed file with any of the extensions listed herein.\n\n15. “Services” – means maintenance, technical support, customization services, branding, or any other services performed or to be performed, if any, by Licensor as per Contract/s between the Parties. Some Services require a separate SOW to be executed between the Parties.\n\n16. “Customization” means mutually agreed with Contract/s between the Parties modification to the Software, applied or to be applied by Licensor, resulting in change of the behavior and/or the graphical user interface of Licensor’s Product/s.\n\n17. “Licensee’s software” means one of these definitions or all:\n\na) the application that Licensee has the right to develop, in which the Software will be incorporated. In relation to this definition, “Licensee’s application” means one or more software programs developed by Licensee under Licensee’s trademark or brand and which will be provided to End-users’ computers, tablets and smartphones.\n\n18. “Licensor’s Official Distribution Channels” are (i) Licensor’s website: <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/ac4da812f8031413ca4aa9de971d20669f64db64b8f8949579ecb5bd0c848cd4/http%3A//www.zoiper.com\">www.zoiper.com</a> , and (ii) the Online Distribution Stores.\n\n19. “Confidential Information” means information disclosed, or to be disclosed, by Licensee or Licensor under Contract/s between the Parties, including without limitation: Licensor’s Software information, Software documentation, Software example, SDK documentation, SDK versions, information regarding Licensee’s or Licensor’s technical plans, marketing and financial data.\n\n20. ”Day/s” – means business day/s outside of Licensor’s location Holidays and outside of weekend days as per Licensor’s headquarters address.\n\n21. “Hour/s” – means business hour/s, and where hours are not specified, they shall be considered business hours.\n\n22. “Activation Credentials” means the identification information, e.g. username and/or password, or certificate, used to identify Licensee’s use or the End-users’ utilizing Licensee’s services use of the Software.\n\n23. “Update” – the act of applying a patch or point release (i.e. update version 4.1 to version 4.2) to fix or improve existing functionality, also without limitation: bug fixes, modifications, enhancements, supplements.\n\n24. “Updated Version” – an updated Build of the Software.\n\n25. “Updates License” – means the right to request and receive Updated Versions of the Software twice per contract year per Software during the term of Contract/s with which Licensor provides an Updates License to Licensee, if such contract is signed between the Parties.\n\n26. “Updated Versions Pool” – means the set allowance of two Updated Versions per Software per Updates License of the Software for the period of one (1) contract year during the term of Contract/s with which Licensor provides an Updates License to Licensee, if such contract is signed between the Parties.\n\n27. “New Licensor’s Product Release Version” – an updated build of Licensor’s Product\n\n28. “Upgrade” – means the act of moving from one major release to another (i.e. upgrade from Release 4 to Release 5) during the term of Contract/s with which Licensor provides Upgrades to Licensee, if such contract is signed between the Parties.\n\nUpgrades may involve changes in data structures, program processes, general interface changes, and therefore are more likely to impact a functioning application than an update.\n\n29. “Upgraded Version” means an Upgraded Version of the Software\n\n30. “Fault” – a malfunction of the Software where (i) the faulty behaviour has business impact on a production or test system, restraining at least 10% of Licensee’s end-users or testers to use the Software for making or receiving calls; and (ii) is reproducible on a clean install of the operating system in Licensee’s and Licensor’s environments, independent of specific environment setups; and (iii) occurs regardless of the end-device, the version of the mobile operating system or the server mode, firmware revision or configuration; and (iv) is independent of specific environment setups, third-party hardware, peripherals and/or drivers; and (v) is particularly limited to the licensor product’s standard engine and standard interface.\n\nSEVERITY CLASSIFICATION OF THE FAULTS:\n\nThe Severity Classification of the Faults is intended to describe the severity of the Fault:\n\na) “Critical Fault” – is a Critical Severity Fault of the Software, violating RFC 3261 (SIP) and/or RFC 3550 (RTP), where the faulty behaviour has significant to critical business impact on a production system and is resulting in Licensee’s production system to being either down, or functioning at a significantly reduced capacity\n\nb) “Medium Fault” is a Medium Severity Fault of the Software that has some business impact on a production system, resulting in some functionality loss on Licensee’s production system. The Software is usable, but does not provide a function in a convenient or expeditious manner.\n\nc) “Low Fault” – a Low Severity Fault of the Software occurring in test or non- production environments and is related to questions and issues including general usage questions, issues related to a test or non-production environment, or feature requests. There is no impact on the quality, performance or functionality on Licensee’s production system.\n\n31. “Stock-version of an operating system” – non-modified version of an operating system, as provided by either of the manufacturers, namely: Microsoft, Google, Apple, and without Third Party modifications by device manufacturers.\n\n32. “Purchase Order” means an order issued by Licensee to Licensor for Software or Services to be purchased, licensed or provided under a TERMS OF SALE Contract or under Contract/s between the Parties.\n\n33. “Proforma Invoice” is a document, issued by Licensor, preceding Licensee’s payment towards Licensor and indicating Licensee’s due amounts for payment. In the absence of a Proforma Invoice all other indication methods apply. The absence of a Proforma Invoice does not release Licensee of Licensee’s payment obligations.\n\n34. “Distributable software” means the Software in the form of binary object files, software library, linkable object files or dynamic link library, and/or executable files.\n\n35. “Example Source Code” means example software program in source code format or a sample source code included in the SDK, provided the source code is compiled into a software program and is not distributed in human-readable form.\n\n36. “API” means the Zoiper Application Programming Interfaces contained in the Software, including documentation, header files and related information.\nIV. CONFIDENTIALITY\n\nLicensee acknowledges that the Software and any other technical and/or commercial information not in the public domain obtained by Licensee are regarded as confidential by Licensor.\n\nAny Activation Credentials issued by Licensor to Licensee are confidential and shall be treated in accordance with these ZOIPER STANDARD TERMS AND CONDITIONS or any Mutual Non-Disclosure Agreement (“MNDA”) signed between the Parties or Contract/s signed between the Parties. Licensee agrees to take all reasonable measures to protect all Confidential Information including the Software, Documentation, Activation Credentials using at least the same degree of care that Licensee protects its own confidential information, however not less than a reasonable degree of care.\n\nLicensee agrees to use the Confidential Information and the Activation Credentials solely for the purpose of exercising Licensee’s rights and performing Licensees obligations under the business relationship between Licensee and Licensor, and Licensee agrees (i) to not disclose the Confidential Information to any Third Party and (ii) to not use the Confidential Information or the Activation Credentials for any other purpose, without Licensor’s prior written notice of consent.\n\nLicensee agrees not to permit or authorize access to, or disclosure of the Software to any person or entity other than employees of Licensee who (i) have signed in writing to be bound by these ZOIPER STANDARD TERMS AND CONDITIONS and who (ii) have a need to access the Software for the performance of Licensee’s rights and obligations. Licensee shall take appropriate measures by instruction and agreement prior to disclose to such employees to assure against unauthorized use or disclosure.\n\nAny applicable distribution rights will be governed by an additional contract for distribution license rights.\n\nAny press release or publication regarding these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties is subject to prior review and written approval by Licensor.\n\nThe obligations of confidentiality shall not apply to information which has entered the public domain except where such entry is the result of Licensee’s breach of these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties, or is required to be disclosed pursuant to a court order, so long as Licensor is given adequate notice and the ability to challenge such required disclosure.\n\nIf a MNDA is signed between the Parties prior to applying of these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties, (i) the confidentiality relationship between the Parties is subject to the MNDA, (ii) the MNDA signed between the parties prior to these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract becomes an integral part of these ZOIPER STANDARD TERMS AND CONDITIONS and Contract/s between the Parties, (iii) in case of conflict between the MNDA and this CONFIDENTIALITY clause, the MNDA will take predominance.\n\nV. PROPRIETARY SOFTWARE\n\nLicensor’s Products are closed source software. No portions of any of Licensor’s Products source code will be made available to Licensee.\n\nVI. TRADEMARK\n\n“Zoiper” is a registered trade mark and all applicable laws in relation to protection and use of Zoiper’s trademark apply.\n\nVII. OWNERSHIP AND INTELLECTUAL PROPERTY RIGHTS\n\nAll ownership and intellectual property rights in the Software and any copies or derivative works thereof (regardless of form or media in or which the original copies may exist), including but not limited to patents, design rights, copyrights, trademarks, trade-secrets and proprietary know-how, shall be owned by and vested in Licensor and nothing in these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties shall constitute or be interpreted as a transfer of such rights from Licensor to Licensee.\n\nLicensee acknowledges that the structure and the source code of the Software are valuable trade secrets of Licensor and shall remain the sole property of Licensor.\n\nVIII. COPYRIGHT AND INTELLECTUAL PROPERTY NOTICES\n\nCertain software programs or libraries included in the Software may contain software (including open source software) distributed under Third Party agreements (“Third Party Components”), which may contain terms that expand or limit rights to use certain portions of the Software (“Third Party Terms”).\n\nAny use, reproduction and distribution of components of the Software licensed under an open source software license are governed solely by the terms of such open source software license and not to these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties.\n\nLicensor’s intellectual property right and copyright notices as per Licensor’s sole discretion are and shall be integral part of the “About box” of the Software, together with the following Third Party copyrights information:\n\nTHIRD PARTY TECHNOLOGIES THAT ARE OR MAY BE USED BY LICENSOR’S PRODUCT/S:\n\n    Securax EOOD\n    JThread, Copyright (C) 2000-2005 Jori Liesenborgs (jori@lumumba.uhasselt.be)\n    JRTPLIB, part of JRTPLIB Copyright (C) 1999-2005 Jori Liesenborgs\n    GSM, Copyright 1992, 1993, 1994 by Jutta Degener and Carsten Bormann, Technische Universitaet Berlin\n    iLBC, iLBC Speech Coder ANSI-C Source Code iLBC_define.h Copyright (C) The Internet Society (2004). All Rights Reserved.\n    SPEEX The Xiph OSC and the Speex Parrot logos are trademarks (TM) of <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/39820572d7164f0b84796aed13521d9e02a4ee193c87c928d344d269e850e69b/http%3A//Xiph.Org\">Xiph.Org</a>\n    OpenLDAP, Copyright 1999-2003 The OpenLDAP Foundation, Redwood City, California, USA. All Rights Reserved.\n    PortAudio, Copyright (C) 1999-2002 Ross Bencina and Phil Burk\n    PortMixer, PortMixer, Windows WMME Implementation, Copyright (C) 2002, Written by Dominic Mazzoni and Augustus Saunders\n    Resiprocate, The Vovida license The Vovida Software License, Version 1.0, Copyright (C) 2000 Vovida Networks, Inc. All rights reserved.\n    This product includes cryptographic software written by Eric Young (eay@cryptsoft.com)\n    This product includes software written by Tim Hudson (tjh@cryptsoft.com)\n    This product is using the gloox XMPP library - Copyright by Jakob Schroeter\n    This product is using ReorderListBox written by Jason Gincherau\n    This product is using <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/18b679f066fcfbbd112ac31f4601ce8a6e2c9c6ac5319244783d024d360d1721/http%3A//ZXing.net\">ZXing.net</a> written by Michael Jahn\n    This product is using Coding4Fun Toolkit\n    This product is using C# port of libphonenumber by Erez A. Korn (<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/1b16cdbf7c883dc6dc74142cb484f1e9df82f758fb8d28a09e4860d150aaffe3/https%3A//github.com/erezak\">https://github.com/erezak</a>)\n\nIf Licensee is entitled to an Update of the Software and if the Software includes additional Third Party technology, Licensor has the right to add to the “About box” the additional intellectual property right information and copyright information, and, when handled by Licensee, Licensee is obliged to update the “About box”.\n\nLicensee shall not remove, obscure or alter proprietary rights notices (including without limitation: copyright and trademark notices) that may be in the copies of the Software.\n\nRedistribution in binary form, to the extent permitted by Contract/s between the Parties, must also reproduce Licensor’s copyright as well as Third Party copyrights incorporated in the Software, trademark or other Licensor or Third Party proprietary notices as incorporated in the Software in any associated Documentation or startup application images “Splash screens” or “About box” that display Licensee copyright notices.\n\nInformation identifying the copyright holders of the Third Party Components and the Third Party Terms that apply are available in the Documentation and/or in these ZOIPER STANDARD TERMS AND CONDITIONS and/or in Contract/s between the Parties.\n\nIX. NO TRANSFER OF INTELLECTUAL PROPERTY RIGHTS\n\nExcept for the rights granted by Licensor to Licensee with Contract/s, no other rights, including without limitation: no intellectual property and/or no intellectual property rights, are transferred to Licensee.\n\nX. NON-ASSERTION BY LICENSEE\n\nLicensee agrees not to assert in any way any patent owned by Licensee arising out of or in connection with this Software or modifications made thereto or applications developed using the Software against Licensor, Licensor’s subsidiaries and/or affiliates and/or their customers, direct or indirect, agents and contractors (collectively, the “Licensor Product Users”) for the manufacture, use, import, licensing, offer for sale or sale of any Licensor’s Products.\n\nXI. LIMITED WARRANTY\n1. NO SOFTWARE WARRANTY\n\nLICENSOR PROVIDES AND LICENSES THE SOFTWARE (AND/OR THE SOURCE CODE EXAMPLES IF APPLICABLE) “AS IS”. LICENSOR MAKES NO REPRESENTATIONS OR WARRANTIES AND THERE ARE NO CONDITIONS, ENDORSEMENTS, GUARANTEES, REPRESENTATIONS OR WARRANTIES OF ANY KIND EITHER EXPRESS OR IMPLIED, (INCLUDING WITHOUT LIMITATION ANY EXPRESS OR IMPLIED WARRANTIES OR CONDITIONS OF QUALITY, PERFORMANCE, RESULTS, FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY, MERCHANTABLE QUALITY, DURABILITY, TITLE, NON-INFRINGEMENT OR ARISING BY STATUTE OR OTHERWISE IN LAW OR FROM A COURSE OF DEALING OR USAGE OF THE TRADE) ARISING OUT OF OR RELATED TO THESE ZOIPER STANDARD TERMS AND CONDITIONS AND/OR AN EXISTING CONTRACT OR VALID TERMS BETWEEN THE PARTIES OR ARISING OUT OF OR RELATED TO ANY SOFTWARE, SOFTWARE INFORMATION OR THEIR PERFORMANCE OR FAILURE TO PERFORM.\n\nLICENSEE AGREES TO ASSUME ALL RISKS ASSOCIATED WITH LICENSEE AND LICENSEE’S AUTHORIZED USERS’ USE OF THE SOFTWARE. LICENSEE IS RESPONSIBLE FOR TAKING PRECAUTIONARY MEASURES TO PREVENT THE LOSS OR DESTRUCTION OF LICENSEE’S DATA AND DATABASES SUCH AS, FOR EXAMPLE MAKING REGULAR BACKUPS AND VERIFYING THE RESULTS OBTAINED FROM ANY SOFTWARE’S, AND LICENSOR WILL HAVE NO OBLIGATIONS OR LIABILITY WHATSOEVER WITH RESPECT TO ANY SUCH LOSS OR DESTRUCTION.\n\n2. LIMITED SERVICES WARRANTY\n\nSERVICES PROVIDED WITH CONTRACT/S BETWEEN THE PARTIES SHALL BE PERFORMED IN A WORKMANLIKE MANNER CONSISTENT WITH INDUSTRY STANDARDS.\n\nLICENSEE MUST NOTIFY LICENSOR PROMPTLY, BUT IN NO EVENT MORE THAN FOURTEEN (14) DAYS AFTER COMPLETION OF THE SERVICES, OF ANY CLAIMED BREACH OF THIS WARRANTY.\n\nLICENSEE’S SOLE AND EXCLUSIVE REMEDY FOR BREACH OF THIS WARRANTY SHALL BE, AT LICENSOR’S OPTION, RE-PERFORMANCE OF THE SERVICES, OR TERMINATION OF THE CONTRACT/S AND THESE ZOIPER STANDARD TERMS AND CONDITIONS, OR THE APPLICABLE SERVICE AND RETURN OF THE SERVICE FEES PAID TO LICENSOR BY LICENSEE FOR SUCH NON-CONFORMING SERVICE. THE PROVISION OF SERVICES UNDER CONTRACT/S BETWEEN THE PARTIES OR THESE ZOIPER STANDARD TERMS AND CONDITIONS DO NOT EXTEND THE WARRANTIES PROVIDED WITH ANY SOFTWARE ORDERED/PURCHASED BY LICENSEE.\n\nXII. PUBLICITY\n\nUnless otherwise prohibited in writing between the Parties, these ZOIPER STANDARD TERMS AND CONDITIONS or Contract/s between the Parties give either Party the right to use for marketing purposes the other Party’s trade names, trademarks, service marks, domain names, and/or other distinctive brand features, except as may be contained in the Software.\n\nXIII. USE OF BRAND NAMES, TRADEMARKS, LOGOS\n\nWhen agreed in writing between the PARTIES, the PARTIES may, initiate mutual positive marketing campaigns, execute mutual marketing efforts, including without limitation, link to each other’s websites, create and distribute press releases, reference to the other Party, and execute other positive marketing practices.\n\nWith respect to mutual positive marketing campaigns and referencing, the Parties agree as follows:\n\n(a) each Party agrees to use the brands, trademarks, logos, and all information and mentions of the other Party’s brand name and services in good faith and solely with the purpose of the business relationship between the Parties and\n\n(b) upon confirmation of the mutual positive marketing campaign by each Party, each Party provides the right of use of its brands, trademarks, logos of the Party’s brand name and services for the purposes of the positive marketing campaign. This right can be terminated for whatever reason by the Party providing this right with five (5) business days’ notice send by certified mail to the address provided by the Party obtaining the right in the separate written agreement, return receipt required, to the Party obtaining the right. In case of such termination of this right, the Party obtaining the right should cease the use of the brands, trademarks, logos, and all information and mentions of the other Party’s brand name and services within five (5) business days following receipt of such notice.\n\nLicensee is responsible and liable for all the intellectual property rights and copyrights, related to the used materials, for example without limitation: logos, images, trademarks, provided to Licensor by Licensee to be used for the performance of activities governed by Contract/s between the Parties.\n\nXIV. LIMITATION, EXCLUSION OF LIABILITY AND INDEMNIFICATION\n\nREFERENCES TO LIABILITY IN THIS LIMITATION, EXCLUSION OF LIABILITY AND INDEMNIFICATION SECTION INCLUDES WITHOUT LIMITATION: LIABILITY ARISING FROM AGREEMENT, CONTRACT, TORT (INCLUDING NEGLIGENCE), UNDER ANY INDEMNITY, STRICT LIABILITY OR OTHERWISE, IN EACH CASE EVEN IF LICENSOR HAS BEEN INFORMED OF THE POSSIBILITY OF THAT LIABILITY.\n\nSOME STATES AND COUNTRIES, INCLUDING MEMBER COUNTRIES OF THE EUROPEAN UNION, DO NOT ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES AND, THEREFORE, THE FOLLOWING LIMITATION OR EXCLUSION MAY NOT APPLY IN THOSE STATES AND COUNTRIES.\n\nTO THE MAXIMUM EXTENT PERMITTED BY THE APPLICABLE LAW AND REGARDLESS OF WHETHER ANY REMEDY SET OUT HEREIN FAIL OF THEIR ESSENTIAL PURPOSE, IN NO EVENT SHALL LICENSOR BE LIABLE TO LICENSEE FOR ANY SPECIAL, CONSEQUENTIAL, INDIRECT OR SIMILAR DAMAGES OR LOSS OF PROFITS, REVENUE, TOLL FRAUD, BUSINESS SAVINGS OR GOODWILL, REPUTATION, DATA, FEES, EXPENSES OF ANY KIND OR NATURE, LICENSEE’S OBLIGATION TO COMPENSATE A THIRD PARTY, ARISING OUT OF THE PURCHASE OR INABILITY TO PURCHASE THE SOFTWARE EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nNOTWITHSTANDING ANY OTHER PROVISIONS IN THESE ZOIPER STANDARD TERMS AND CONDITIONS OR AN EXISTING CONTRACT OR VALID TERMS BETWEEN THE PARTIES, IF ENFORCED BY THE APPLICABLE LAW, LICENSOR’S LIABILITY TO LICENSEE SHALL BE LIMITED TO THE AMOUNTS PAID BY LICENSEE TO LICENSOR FOR THE SPECIFIC SOW SOFTWARE OR FOR THE SPECIFIC SDK SOFTWARE OR FOR THE SPECIFIC LICENSOR’S PRODUCT OR FOR THE SPECIFIC SERVICE FOR A SPECIFIC SOW SOFTWARE OR SDK SOFTWARE, AND EXCLUDING (I) PAYMENTS TO THIRD PARTIES AND (II) THIRD-PARTY LICENSE FEES AND (III) ADDITIONAL EXPENSES MADE TO THIRD PARTIES, SUCH AS BUT NOT LIMITED TO THIRD-PARTY COMPANIES FOR PERFORMANCE OF EITHER PARTY’S SERVICES.\n\nNOTHING HEREIN LIMITS OR EXCLUDES THE LIABILITY OF LICENSEE TO LICENSOR ARISING OUT OF (I) LICENSEE’S BREACH OF THESE ZOIPER STANDARD TERMS AND CONDITIONS; (II) LICENSEE’S BREACH OF ANY CONTRACT BETWEEN THE PARTIES; (III) LICENSEE’S BREACH OF LICENSE AGREEMENT BETWEEN THE PARTIES, AND/OR (III) ANY AMOUNTS DUE TO LICENSOR UNDER ANY CONTRACT, AND/OR (IV) THIRD PARTY FEES, INCLUDING BUT NOT LIMITED TO THIRD PARTY LICENSE FEES. THIRD PARTY FEES SHALL, TO THE EXTENT PRACTICAL AND IF POSSIBLE, BE BILLED BY LICENSOR TO LICENSEE AS A SEPARATE ITEM.\n\nLICENSEE SHALL INDEMNIFY AND HOLD LICENSOR AND LICENSOR’S AFFILIATES, OFFICERS, DIRECTORS, AGENTS, SUPPLIERS, CUSTOMERS AND EMPLOYEES HARMLESS FROM AND AGAINST ALL CLAIMS, DAMAGES, LOSSES, LIABILITIES, COSTS, CHARGES AND EXPENSES (INCLUDING ATTORNEYS’ FEES), SETTLEMENT FEES AND EXPENSES (INCLUDING REASONABLE FEES OF ATTORNEYS AND OTHER PROFESSIONALS) ARISING OUT OF LICENSEE’S PURCHASE AND/OR USE OF THE SOFTWARE, AND/OR INCURRED BY BREACH OF THESE ZOIPER STANDARD TERMS AND CONDITIONS OR BY BREACH OF ANY CONTRACT BETWEEN THE PARTIES OR BY REASON OF ANY CLAIM IN RESPECT OF THE DISTRIBUTION OR SALE OF SOFTWARE OR OTHER PRODUCTS (INCLUDING BUT NOT LIMITED TO APPLICATIONS, INTERFACES AND APPLICATION PROGRAMMING INTERFACES) DEVELOPED UTILIZING THE SOFTWARE, INCLUDING BUT NOT LIMITED TO: PRODUCTS, LIABILITY CLAIMS AND CLAIMS OF INFRINGEMENT OF THIRD PARTY INTELLECTUAL RIGHTS.\n\nLICENSOR MAKES NO REPRESENTATION OR WARRANTY AS TO THE VALIDITY OR ENFORCEABILITY OF THE TRADE MARKS, NOR AS TO WHETHER THESE INFRINGE ANY INTELLECTUAL PROPERTY RIGHTS OF THIRD PARTIES.\n\nXV. FORCE MAJEURE\n\nLicensor shall not be liable for any delay or failure in performance due to events outside Licensor’s reasonable control, besides the understanding of this term in jurisdiction and case law, all external causes, which cannot be influenced by Licensor but though which Licensor is unable to carry out its commitments, including, without limitation:\n\n    War, riots, civil or military insurrection and political coups;\n    Natural disasters such as earthquakes, fire, storms and floods;\n    Governmental acts and omissions;\n    Terrorism and sabotage;\n    Labor disputes\n    Industry-wide shortages of supplies, delays in common carriers\n    Epidemics\n\nThe obligations and rights of Licensor shall be extended for a period equal to the period during which such event prevented Licensor’s performance.\n\nLicensee’s obligation to pay monies due and owing to Licensor cannot be delayed or failed due to Force Majeure circumstances and thus no Force Majeure circumstances cure Licensee from Licensee’s duty to pay the amounts due and owing to Licensor.\n\nXVI. HIGH RISK ACTIVITIES\n\nTHE SOFTWARE IS NOT FAULT-TOLERANT AND IS NOT DESIGNED, MANUFACTURED OR INTENDED FOR ANY USE REQUIRING FAIL-SAFE PERFORMANCE IN WHICH THE FAILURE OF A PRODUCT COULD LEAD TO DEATH, SERIOUS PERSONAL INJURY, SEVERE PHYSICAL OR ENVIRONMENTAL DAMAGE (“HIGH RISK ACTIVITIES”). THIS INCLUDES THE OPERATION OF AIRCRAFT OR NUCLEAR FACILITIES, EMERGENCY RESPONSE.\n\nLICENSEE AGREES NOT TO USE, OR LICENSE THE USE OF, THE SOFTWARE OR DERIVED LICENSEE SOFTWARE IN CONNECTION WITH ANY HIGH RISK ACTIVITIES.\n\nXVII. THIRD-PARTY EQUIPMENT / SOFTWARE\n\nLicensee is responsible, at own risk for proper equipment, including Third Party infrastructure and other facilities that provide access to the network at which Licensee can receive the provided Software by Licensor, for instance without limitation devices and necessary equipment on which Licensee will use the Software.\n\nXVIII. GENERAL AGREEMENT PROVISIONS\n1. SIGNATURE VALIDITY\n\nIn the event that any Party’s signature is delivered by facsimile transmission, such signature shall create a valid and binding obligation of the Party executing (or on whose behalf such signature is executed), with the same force and effect as if such facsimile signature page were an original thereof.\n\n2. CHOICE OF LAW\n\nTHESE ZOIPER STANDARD TERMS AND CONDITIONS are governed by and construed in accordance with the laws of the Kingdom of Belgium.\n\n3. NUMBERING\n\nThe numbering in these ZOIPER STANDARD TERMS AND CONDITIONS is solely for the convenience of the Parties.\n\n4. SURVIVAL\n\nALL CLAUSES HEREIN SURVIVE EXPIRATION OR EARLIER TERMINATION OF THESE ZOIPER STANDARD TERMS AND CONDITIONS OR ANY CONTRACT BETWEEN THE PARTIES.\n\n5. APPLICABILITY\n\nIf any portion of these ZOIPER STANDARD TERMS AND CONDITIONS is found invalid or unenforceable under judicial decree or decision of a Court, the remainder of these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties shall remain valid and enforceable to the extent according to their terms and the invalid clause shall be replaced by Licensor by a clause which reflects the object of the original clause as close as possible. The other provisions of these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties will remain in full force and effect.\n\n6. COMPLIANCE WITH LAWS AND EXPORT RESTRICTIONS\n\nLICENSEE IS ADVISED THAT THE SOFTWARE MAY CONTAIN ENCRYPTION ALGORITHMS THAT MAY BE LIMITED FOR EXPORT WITHOUT A LICENSE ISSUED BY THE U.S. BIS, THE EUROPEAN UNION OR ANY OTHER COUNTRY’S GOVERNMENTAL AGENCIES WHERE APPLICABLE.\n\nADDITIONALLY, LICENSEE IS ADVISED THAT OBTAINING THE SOFTWARE THROUGH THIRD PARTY APPLICATION STORES SUCH AS, BUT NOT LIMITED TO WINDOWS PHONE STORE, GOOGLE PLAY AND ITUNES APP STORE, MAY BE SUBJECT TO ADDITIONAL REGULATIONS SUCH AS BUT NOT LIMITED TO U.S. EXPORT ADMINISTRATION REGULATIONS (EAR). LICENSEE IS RESPONSIBLE FOR ADHERING TO THE APPLICABLE REGULATIONS.\n\nLICENSEE IS AWARE AND AGREES THAT THE SOFTWARE MAY ONLY BE USED FOR CIVIL PURPOSES AND THE SOFTWARE MUST NEVER BE USED FOR ANY DIRECT OR INDIRECT MILITARY OR OTHER PURPOSE PROHIBITED UNDER ANY APPLICABLE REGULATION.\n\nLICENSEE AGREES NOT TO DIRECTLY OR INDIRECTLY EXPORT, RE-EXPORT, IMPORT OR TRANSMIT THE SOFTWARE CONTRARY TO THE LAWS AND REGULATIONS OF ANY GOVERNMENTAL ENTITY (NATIONAL, SUBNATIONAL AND/OR SUPRANATIONAL) THAT HAS JURISDICTION OR AUTHORITY OVER THE COUNTRIES FROM OR TO WHICH THE SOFTWARE IS BEING IMPORTED, EXPORTED, TRANSMITTED OR USED.\n\nLICENSEE HEREBY REPRESENTS THAT TO THE BEST OF LICENSEE’S KNOWLEDGE, LICENSEE IS ELIGIBLE TO RECEIVE THE SOFTWARE UNDER APPLICABLE LAW.\n\nIF LICENSEE MOVES ANY SOFTWARE, AND AS A RESULT OF SUCH MOVE, A JURISDICTION IMPOSES A DUTY, TAX, LEVY OR FEE (INCLUDING WITHHOLDING TAXES, FEES, CUSTOMS, OR OTHER DUTIES FOR IMPORT AND EXPORT OF ANY SUCH SOFTWARE), THEN LICENSEE IS SOLELY LIABLE FOR ANY SUCH DUTY, TAXES, LEVY OR OTHER FEES AND LICENSEE IS SOLELY RESPONSIBLE FOR, AND WILL PAY, ANY SUCH DUTY, TAXES, LEVY, OR OTHER FEES.\n\n7. NATURE OF RELATIONSHIP\n\nThese ZOIPER STANDARD TERMS AND CONDITIONS or any Contracts between the Parties shall not create or be construed as creating a joint venture, co-ownership, partnership, employment or agency relationship, unless specifically created to create such.\n\nThe Parties acknowledge and agree that these ZOIPER STANDARD TERMS AND CONDITIONS and any Contract between the Parties does not create, and shall not be construed to create any employment relationship between Licensee and Licensor’s own employees.\n\n8. EXCLUSIVITY\n\nNeither Party provides exclusivity rights to the other with these ZOIPER STANDARD TERMS AND CONDITIONS and with any Contract between the Parties, unless specifically created to provide such.\n\n9. WAIVER\n\nNo failure or delay by either Party to exercise or enforce any of its rights, powers or remedies under these ZOIPER STANDARD TERMS AND CONDITIONS and under any Contract between the Parties will act as a waiver of such rights, powers or remedies and no waiver of a breach in a particular situation shall be held to be a waiver of any other or subsequent breach and nor will any partial exercise preclude any further exercise of the same, or of some other right, power or remedy.\n\n10. DISPUTES\n\nAll disputes between the Parties arising from these ZOIPER STANDARD TERMS AND CONDITIONS, any Contract between the Parties, other agreements, and commitments, must be settled in a court of competent jurisdiction in Belgium.\n\n11. COSTS\n\nEach Party shall bear all costs and expenses incurred by it or in connection with these ZOIPER STANDARD TERMS AND CONDITIONS and with any Contract between the Parties, unless stated otherwise.\n\n12. PROFESSIONAL SERVICES - SUPPORT AND CUSTOM DEVELOPMENT\n\nNothing in these ZOIPER STANDARD TERMS AND CONDITIONS shall be construed to require Licensor to provide support services or updates, upgrades, bug fixes, modifications, custom development, development services to Licensee. All professional services offered by Licensor require Contract/s between the Parties.\n\nLicensee will be solely responsible for providing support to Licensee’s end users for the Licensee Software distributed by Licensee.\n\n13. TRANSFER OF THE AGREEMENT\n\nLicensee is not entitled to transfer these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties to Third Parties, including but not limited to Licensee’s rights and obligations, without the written consent of Licensor.\n\n14. ASSIGNMENT\n\nLicensee may not assign these ZOIPER STANDARD TERMS AND CONDITIONS or any Contract between the Parties or any interest or rights granted hereunder to any Third Party without the written consent of Licensor. A change of control or reorganization of Licensee pursuant to a merger, sale of assets or stock shall be deemed to be an assignment under these ZOIPER STANDARD TERMS AND CONDITIONS and under Contract/s between the Parties. Notwithstanding any assignment by Licensee, Licensee shall remain liable for the payment of all amounts due under any agreement between the Parties.\n\n15. NOTICES\n\nLicensor keeps the right to change these ZOIPER STANDARD TERMS AND CONDITIONS without prior notice. The valid ZOIPER STANDARD TERMS AND CONDITIONS are made available by Licensor on Licensor’s website and updated accordingly by Licensor, and shall be deemed accepted by Licensee shall Licensee continue to apply its rights according to any Contract between Licensee and Licensor.\n\nNotwithstanding the foregoing, notices regarding changes in pricing, license terms, policies or programs may be by posting on <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/ac4da812f8031413ca4aa9de971d20669f64db64b8f8949579ecb5bd0c848cd4/http%3A//www.zoiper.com\">www.zoiper.com</a> or by e-mail.\n\n16. FEEDBACK\n\nLicensee agrees to provide any comments and suggestions regarding the performance of the Software on the e-mail address support@zoiper.com\n\nLicensor agrees to monitor this mailbox, but is under no obligation to implement any of the suggestions and/or proposals, or be required to respond to any questions asked in the e-mail/s.\n\nLicensor and/or its affiliates will be free to use any information Licensee provides, including comments, problem reports, suggestions or enhancement requests, to Licensor for any purpose, subject to any applicable patents or copyrights.\n\nCONTACT\n\nFor any questions arising out of these ZOIPER STANDARD TERMS AND CONDITIONS, please send a valid certified letter mail to the address provided herein, or call the numbers provided herein to receive more information on how to address your questions.\n\nCOMPANY NAME: Securax EOOD\nADDRESS: 33 Simeonovsko shose, fl.4, office 8, 1700 Sofia, Bulgaria\nTELEPHONE NUMBER/S: +1 415 9065157 ; +352 20333140"
            },
            "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/zoiper-thunderbird-plugin/license/1.01"
        },
        "release_notes": null,
        "reviewed": "2016-11-06T07:48:43Z",
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/zoiper-thunderbird-plugin/versions/1.01",
        "version": "1.01"
    }
]