{
    "id": 4364,
    "authors": [
        {
            "id": 12991016,
            "name": "Felix Dahlke",
            "url": "https://addons.thunderbird.net/en-US/thunderbird/user/fdahlke/",
            "username": "fdahlke",
            "picture_url": null
        }
    ],
    "average_daily_users": 1208,
    "categories": {
        "firefox": [
            "web-development"
        ],
        "seamonkey": [
            "web-and-developer-tools"
        ],
        "thunderbird": [
            "miscellaneous"
        ]
    },
    "contributions_url": null,
    "current_version": {
        "id": 2078210,
        "compatibility": {
            "firefox": {
                "max": "56.*",
                "min": "38.0"
            },
            "seamonkey": {
                "max": "*",
                "min": "2.35"
            },
            "thunderbird": {
                "max": "57.0",
                "min": "38.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/elemhidehelper/versions/2078210",
        "files": [
            {
                "id": 627599,
                "created": "2017-04-11T10:17:25Z",
                "hash": "sha256:7073cad4d481b5cef29865b7eddeed21968f0bc615d24bab17dacfea26456023",
                "is_restart_required": false,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 126033,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/627599/element_hiding_helper_for_adblock_plus-1.4-fx+sm+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 3338,
            "name": {
                "en-US": "Mozilla Public License, version 2.0"
            },
            "url": "http://www.mozilla.org/MPL/2.0/"
        },
        "release_notes": {
            "en-US": "With this release Element Hiding Helper becomes fully compatible with multi-process Firefox. We also fixed a long-standing bug: “View source” command was only showing elements but no text nodes."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/elemhidehelper/versions/1.4",
        "version": "1.4"
    },
    "default_locale": "en-US",
    "description": {
        "el": "Απλά επιλέγετε το στοιχείο που θέλετε να φραγεί και επιλέξτε ποια χαρακτηριστικά αυτού θα ληφθούν υπόψη όταν κρυφτεί στο μέλλον. Ο κανόνας απόκρυψης στοιχείων δημιουργείται και προστίθεται στο Adblock Plus αυτόματα.",
        "fr": "Il vous suffit de sélectionner l'élément que vous désirez masquer et de choisir les attributs de cet élément qui seront détectés pour le masquer par la suite. La règle de masquage d'élément est alors créée et ajoutée automatiquement.",
        "de": "Man wählt einfach das Element aus, das versteckt werden soll, und kreuzt anschließend die Attribute an, anhand derer das Element in Zukunft wiedererkannt und versteckt werden soll. Die Regel für das Verstecken wird automatisch erstellt und in die Filterliste von Adblock Plus eingefügt.",
        "nl": "U selecteert eenvoudigweg het element dat u wilt laten verbergen en kiest vervolgens welke eigenschappen van dit element in aanmerking moeten worden genomen wanneer het in de toekomst wordt verborgen. De regel voor verbergen van het element wordt automatisch aangemaakt en toegevoegd.",
        "ru": "Нужно просто выбрать элемент, который надо скрыть, и указать, по каким атрибутам этот элемент нужно в будущем узнавать. Правило для скрытия элемента будет автоматически создано и добавлено в список фильтров Adblock Plus.",
        "pt-PT": "Seleccione apenas o elemento que deseja ocultar e que atributos devem ser tomados em consideração para o ocultar no futuro. A regra de filtro de elementos é gerada e adicionada automaticamente.",
        "zh-TW": "你只需點選要被隱藏的元素，然後選擇此元素的那些屬性需要一併考慮，就可以自動新增元素隱藏規則。",
        "en-US": "You simply select the element you want to be hidden and then choose which attributes of this element should be taken into account when hiding it in future. The element hiding rule is generated and added automatically.",
        "ko": "숨기려는 요소를 선택한 후 요소를 규정하는 속성을 선택하십시오. 그러면 요소 숨김 필터가 생성되고, 자동으로 필터 목록에 추가됩니다.",
        "it": "Selezionare semplicemente l'elemento da nascondere e quindi scegliere quali attributi di tale elemento considerare per nascondere il medesimo elemento in futuro. La regola per nascondere l'elemento viene creata ed aggiunta automaticamente.",
        "hu": "Egyszerűen válassza az elemet, amelyet el kíván rejteni. Megadja az elem atribútumait, amelyek alapján a későbbiekben az elem elrejtődik. Az elrejtés szabálya automatikusan generálódik és hozzáadódik.",
        "sk": "Jednoducho vyberte prvok, ktorý chcete skryť a potom vyberte, ktorá vlastnosť tohto prvku bude uložená na skrytie do budúcna. Pravidlo skrývania prvkov je vytvárané a pridávané automaticky.",
        "zh-CN": "你只需要选中想隐藏的元素并设置应用的范围和属性, 规则就自动创建并添加了.",
        "pl": "Używając Element Hiding Helper wystarczy zaznaczyć element, który ma być ukryty i wybrać atrybuty, jakie powinny być brane pod uwagę przy jego ukrywaniu. Reguły ukrywania elementu są generowane i dodawane do listy reguł automatycznie.",
        "uk": "Ви просто вказуєте небажаний елемент на сторінці, а потім вибираєте за якими атрибутами такі елементи слід приховувати в майбутньому. Правило приховування створюється та додається автоматично.",
        "cs": "Jednoduše vyberete prvek stránky, který chcete skrýt a následně určíte, podle kterých vlastností bude prvek rozpoznáván v budoucnosti. Pravidlo na skrývání prvku je vytvořeno a přidáno automaticky.",
        "ro": "Nu trebuie decât să selectaţi elementul pe care doriţi să-l ascundeţi, apoi să alegeţi care atribute ale acestui element sunt suficiente pentru identificarea elementului. Regula de ascundere va fi generată automat.",
        "ja": "非表示にしたい要素を選択し、要素の属性を元に非表示にする要素の条件を選ぶだけで Element Hiding Helper は非表示ルールを作成し、自動的にリストへ追加します。",
        "es": "Basta con que seleccione el elemento que desea ocultar y después elija los atributos del mismo a tener en cuenta en el futuro a la hora de ocultarlo. La regla de ocultación de elemento se generará y añadirá automáticamente.",
        "he": "פשוט בוחרים אלמנט שרוצים שיהיה מוסתר ואז בוחרים אילו תכונות האלמנט לא יילקחו בחשבון בהסתרתו בעתיד. חוק הסתרת האלמנט מחולל ומתווסף בצורה אוטומטית."
    },
    "developer_comments": null,
    "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/elemhidehelper/edit",
    "guid": "elemhidehelper@adblockplus.org",
    "has_eula": false,
    "has_privacy_policy": false,
    "homepage": {
        "en-US": "http://adblockplus.org/elemhidehelper",
        "de": "http://adblockplus.org/de/elemhidehelper",
        "ko": "http://adblockplus.org/ko/elemhidehelper",
        "fr": "http://adblockplus.org/fr/elemhidehelper",
        "es": "http://adblockplus.org/es/elemhidehelper"
    },
    "icon_url": "https://addons.thunderbird.net/user-media/addon_icons/4/4364-64.png?modified=1513773837",
    "icons": {
        "32": "https://addons.thunderbird.net/user-media/addon_icons/4/4364-32.png?modified=1513773837",
        "64": "https://addons.thunderbird.net/user-media/addon_icons/4/4364-64.png?modified=1513773837"
    },
    "is_disabled": false,
    "is_experimental": false,
    "is_featured": false,
    "is_source_public": true,
    "last_updated": "2017-04-12T08:38:17Z",
    "name": {
        "ru": "Element Hiding Helper для Adblock Plus",
        "fr": "Element Hiding Helper pour Adblock Plus",
        "de": "Element Hiding Helper für Adblock Plus",
        "nl": "Element Hiding Helper voor Adblock Plus",
        "pt-PT": "Element Hiding Helper para Adblock Plus",
        "en-US": "Element Hiding Helper for Adblock Plus",
        "it": "Element Hiding Helper per Adblock Plus",
        "hu": "Element Hiding Helper az Adblock Plushoz",
        "sk": "Element Hiding Helper pre Adblock Plus",
        "pl": "Element Hiding Helper dla Adblock Plusa",
        "uk": "Element Hiding Helper для Adblock Plus",
        "cs": "Pomocník skrývání prvků pro Adblock Plus",
        "ro": "Element Hiding Helper pentru Adblock Plus",
        "es": "Element Hiding Helper para Adblock Plus",
        "he": "Element Hiding Helper עבור Adblock Plus"
    },
    "previews": [
        {
            "id": 11791,
            "caption": null,
            "image_size": [
                199,
                150
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/11/11791.png?modified=1530208226",
            "thumbnail_size": [
                199,
                150
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/11/11791.png?modified=1530208226"
        },
        {
            "id": 11792,
            "caption": {
                "ru": "Начать выбор элемента",
                "en-US": "Starting element selection",
                "de": "Die Auswahl des Elements starten"
            },
            "image_size": [
                309,
                252
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/11/11792.png?modified=1530208227",
            "thumbnail_size": [
                245,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/11/11792.png?modified=1530208227"
        },
        {
            "id": 11793,
            "caption": {
                "ru": "Выбор элемента, который нужно спрятать",
                "en-US": "Selecting element to hide",
                "de": "Auswahl des Elements zum Verstecken"
            },
            "image_size": [
                307,
                368
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/11/11793.png?modified=1530208229",
            "thumbnail_size": [
                167,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/11/11793.png?modified=1530208229"
        },
        {
            "id": 11794,
            "caption": {
                "ru": "Добавление правила для скрытия элемента",
                "en-US": "Adding element hiding rule",
                "de": "Hinzufügen der Regel zum Verstecken"
            },
            "image_size": [
                547,
                391
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/11/11794.png?modified=1530208230",
            "thumbnail_size": [
                280,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/11/11794.png?modified=1530208230"
        }
    ],
    "public_stats": true,
    "ratings": {
        "bayesian_average": 4.73529,
        "count": 473,
        "average": 4.7463,
        "text_count": 461
    },
    "ratings_url": "https://addons.thunderbird.net/en-US/thunderbird/addon/elemhidehelper/reviews/",
    "requires_payment": false,
    "review_url": "https://addons.thunderbird.net/en-US/reviewers/review/4364",
    "slug": "elemhidehelper",
    "status": "public",
    "summary": {
        "el": "Πολεμήστε τις διαφημίσεις κειμένου! Το Element Hiding Helper είναι ένα συμπληρωματικό πρόσθετο για το Adblock Plus με προορισμό την ευκολότερη δημιουργία κανόνων απόκρυψης στοιχείων.",
        "fr": "Au diable les textes de pub ! Element Hiding Helper est une extension partenaire d'Adblock Plus qui vous permet de créer plus facilement des règles de masquage d'éléments.",
        "de": "Weg mit der Textwerbung! Element Hiding Helper ist eine Erweiterung für Adblock Plus, die das Erstellen von Regeln zum Verstecken von Elementen einfacher gestalten soll.",
        "nl": "Bestrijd de tekstadvertenties! Element Hiding Helper is een bij Adblock Plus behorende extensie die is bedoeld om het maken van regels voor verbergen van elementen te vereenvoudigen.",
        "ru": "Избавься от текстовой рекламы! Element Hiding Helper расширяет возможности Adblock Plus, упрощая создание правил для скрытия элементов.",
        "pt-PT": "Combata os anúncios de texto! Element Hiding Helper é uma extensão companheira do Adblock Plus cujo objectivo é facilitar a criação de regras para filtros de elementos.",
        "zh-TW": "對抗廣告！Element Hiding Helper 是一個依附在 Adblock Plus 讓你方便建立元素隱藏規則的附加元件。",
        "en-US": "Fight the text ads! Element Hiding Helper is a companion extension for Adblock Plus meant to make creating element hiding rules easier.",
        "ko": "텍스트 광고 제거! Element Hiding Helper(요소 숨김 도우미)는 Adblock Plus의 요소 숨김 필터를 더욱 쉽게 작성할 수 있습니다.",
        "it": "Combatti pubblicità e/o banner! Element Hiding Helper è un'estensione complementare per Adblock Plus che permette di creare facilmente regole per nascondere gli elementi.",
        "hu": "Az Element Hiding Helper egy bővítmény az Adblock Plushoz, melynek segítségével az elemek elrejtése szabályok megadásával egyszerűbbé válik.",
        "sk": "Bojujte s textovými reklamami! Element Hiding Helper je doplnkové rozšírenie pre Adblock Plus určený na jednodnoduchšie vytváranie pravidiel pre skrývanie prvkov.",
        "zh-CN": "Element Hiding Helper 是 Adblock Plus 的一个辅助扩展, 可以让用户能更加简便的隐藏页面元素以去除文本广告.",
        "pl": "Walcz z reklamami! Element Hiding Helper jest rozszerzeniem stowarzyszonym z Adblock Plus po to, by można było łatwiej tworzyć reguły blokowania.",
        "uk": "Нищіть рекламу! Element Hiding Helper є допоміжним розширенням до Adblock Plus. Воно допомогає легше створювати правили приховування.",
        "cs": "Bojujte s textovými reklamami! Pomocník skrývání prvků je společník Adblocku Plus určený k zjednodušení tvorby pravidel na skrývání prvků.",
        "ro": "Înlătură reclamele text! Element Hiding Helper este un supliment ajutător pentru Adblock Plus care uşurează crearea regulilor de ascundere.",
        "ja": "テキスト広告と戦います！ Element Hiding Helper は簡単に要素の非表示ルールを作成できる、Adblock Plus 用の支援拡張機能です。",
        "es": "¡Elimine la publicidad textual! Element Hiding Helper para Adblock Plus es una extensión a usar siempre conjuntamente con Adblock Plus que facilita la creación de reglas de ocultación de elementos.",
        "he": "הילחמו בהודעות הטקסט! Element Hiding Helper היא הרחבת אחות של Adblock Plus אשר נועדה לגרום ליצירת חוקי הסתרת אלמנטים להיות פשוטה."
    },
    "support_email": null,
    "support_url": {
        "en-US": "https://adblockplus.org/forum/"
    },
    "tags": [
        "abp",
        "ad",
        "ad blocking",
        "ad hiding",
        "adblock",
        "adblock plus",
        "ads",
        "css selectors",
        "ehh",
        "element hiding helper",
        "hiding rules",
        "restartless",
        "rip",
        "stylish",
        "yarip"
    ],
    "type": "extension",
    "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/elemhidehelper/",
    "weekly_downloads": 1322
}