{
    "id": 7065,
    "authors": [
        {
            "id": 194827,
            "name": "craigm",
            "url": "https://addons.thunderbird.net/en-US/thunderbird/user/craigm/",
            "username": "craigm",
            "picture_url": null
        }
    ],
    "average_daily_users": 562,
    "categories": {
        "thunderbird": [
            "contacts"
        ]
    },
    "contributions_url": null,
    "current_version": {
        "id": 1254586,
        "compatibility": {
            "thunderbird": {
                "max": "31.*",
                "min": "3.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/select-address-book-text/versions/1254586",
        "files": [
            {
                "id": 125295,
                "created": "2011-07-04T23:59:25Z",
                "hash": "sha256:64d3937a0f784b60d84055426c5fbf2a2364c88367b34ca74a6a4d157bf36a37",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 19456,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/125295/select_address_book_text-1.5-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Version 1.5 is compatible with Thunderbird version 5.0, which has recently been released.  The extension has been tested with TB5 and TB3.  The extension is no longer compatible with Thunderbird version 2.  There was also a small change to the Brazilian Portuguese postal address format."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/select-address-book-text/versions/1.5",
        "version": "1.5"
    },
    "default_locale": "en-US",
    "description": {
        "fr": "Select Address Book Text rend votre carnet d'adresses plus utile. Vous est-il jamais arrivé de vouloir copier vite et bien un nom ou un numéro de téléphone de votre carnet d'adresses dans un mail ? Ou d'avoir cherché à créer rapidement une étiquette pour un contact de votre carnet d'adresses? Cette extension vous facilite ces opérations d'un simple clic droit.\n\nAvec cette extension, les champs individuels de la fiche de votre contact sont faciles à copier en utilisant le menu contextuel (clic droit).  Vous pouvez copier une adresse (avec ou sans le nom) d'un simple clic droit. Vous pouvez également utiliser la souris pour sélectionner et copier n'importe quel texte.  Sans cette extension, Thunderbird vous oblige à aller dans le menu des \"Propriétés\", pour y chercher ce que vous désirez et ensuite copier les informations laborieusement l'une après l'autre.  Avec l'extension, vous pouvez copier ce que vous voyez, immédiatement.\n(<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/23dc2c761b80af0e729831d90e90c99ca81a3f2d41524dfb26e6378820e8027f/http%3A//babelzilla.org\">babelzilla.org</a> translation: \"Goofy\")",
        "de": "Select Address Book Text verbessert die Benutzbarkeit des Adressbuchs. Wollten Sie jemals schnell einen Namen oder eine Telefonnummer aus dem Adressbuch kopieren und in eine E-Mail einfügen? Wollten Sie jemals schnell gut strukturierte Kontaktinformationen aus einem Adressbucheintrag erzeugen, um sie in einer E-Mail einzufügen? Diese Erweiterung ermöglicht die genannten Aktionen über das Kontextmenü.\n\nMit dieser Erweiterung können individuell bestimmte Felder einer Kontaktkarte des Adressbuchs über das Kontextmenü einfach kopiert werden. Vollständige Kontaktinformationen (E-Mail-Adresse oder E-Mail-Adresse einschließlich des Namens) können ebenfalls einfach erzeugt werden. Weiterhin lässt sich mit der Maus Text auswählen und kopieren. Ohne diese Erweiterung muss das Fenster \"Eigenschaften\" für den jeweiligen Kontakt aufgerufen, die gewünschte Information gesucht und einzeln (pro Feld) kopiert werden. Mit Select Adressbook Text lässt sich gewünschter Text dagegen stets sofort kopieren.\n(<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/23dc2c761b80af0e729831d90e90c99ca81a3f2d41524dfb26e6378820e8027f/http%3A//babelzilla.org\">babelzilla.org</a> translation: \"Archaeopteryx\")",
        "nl": "Select Address Book Text maakt uw adresboek bruikbaarder. Hebt u ooit snel een naam of telefoonnummer willen kopiëren vanuit uw adresboek naar een e-mailbericht? Hebt u ooit snel een postlabel willen maken voor iemand in uw adresboek? Deze extensie maakt deze handelingen zo eenvoudig als een enkele klik in het contextmenu.\n\nMet deze extensie zijn de individuele velden op het kaartje van uw contactpersoon eenvoudig kopieerbaar via het contextmenu. U kunt een compleet postlabel (adres, of naam en adres) kopiëren via één enkele menuhandeling. U kunt ook uw muis gebruiken om elke willekeurige tekst te selecteren en kopiëren. Zonder deze extensie wil Thunderbird dat u het dialoogvenster “Eigenschappen” opent en vervolgens weer zoekt naar wat u nodig hebt, waarna u elk veld individueel dient te kopiëren. Met Select Address Book Text kunt u meteen kopiëren wat u wilt.\n(<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/23dc2c761b80af0e729831d90e90c99ca81a3f2d41524dfb26e6378820e8027f/http%3A//babelzilla.org\">babelzilla.org</a> translation: \"markh\")",
        "pt-PT": "Select Address Book Text torna o seu livro de endereços mais fácil de usar.\nJá alguma vez quis copiar rapidamente um nome ou número de telefone do \nseu livro de endereços para uma mensagem de correio? Esta extensão\ntorna estas operações tão fáceis como um simples clique no menu de contexto.\n\nCom esta extensão, os campos individuais do cartão de contacto são copiados\nfacilmente usando o menu de contexto. Você pode copiar etiqueta completa de correio\n(endereço, ou nome e endereço), com uma única operação do menu. Você também pode \nusar o rato para seleccionar e copiar qualquer texto que deseje. Sem esta extensão \no Thunderbird necessita que abra a \"caixa de diálogo Propriedades\" e perca o tempo\n para pesquisar e copiar novamente o que deseja. Com o SelectAddress Book Text,\n quando vir o que quer, pode copiá-lo imediatamente.\n(<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/23dc2c761b80af0e729831d90e90c99ca81a3f2d41524dfb26e6378820e8027f/http%3A//babelzilla.org\">babelzilla.org</a> translation: \"lloco\")",
        "sr": "Желели сте да брзо копирате име или број телефона из вашег именика у е-поруку? Желели сте да брзо извућете све информације о неком контакту из именика? Овај додатак вам омогућава све то помоћу само једног клика.\n\nПомоћу овог додатка је веома лако копирати појединачна поља из вашег именика, преко садржајног менија. Можете да копирате све податке (адресу или име и адресу) само једним кликом. Можете да користите миша да бисте одабрали и копирали жељени текст. Без овог додатка, у Тандерберду морате прво да отворите „Својства” и потрошите време тражећи жељени појам и копирајући потребна поља. Са додатком Select Address Book Text, када видите шта желите, можете одмах и да копирате.\n(Babelzilla translation: \"DakSrbija\")",
        "en-US": "Select Address Book Text makes your address book more usable.  Have you ever wanted to quickly copy a name or phone number from your address book into an email?  Have you wanted to quickly create a mailing label for one of your address book contacts?  This extension makes these operations as easy as a single context-menu click.\n\nWith this extension, the individual fields on your contact card are easily copy-able by using the context menu.  You can copy a complete mailing label (address, or name and address) with a single menu operation.  You can also use your mouse to select and copy whatever text you wish.  Without this extension, Thunderbird requires you to open the \"Properties\" dialog box and spend time searching again for what you want, and copying each field individually.  With Select Address Book Text, when you see what you want, you can copy it immediately.",
        "it": "Select Address Book Text rende più usabile la rubrica di Thunderbird.  Vi è mai capitato di volere copiare al volo un nome o un numero telefonico dalla vostra rubrica a una email?  Oppure: avete mai voluto creare velocemente delle etichetta postali a partire dai contatti presenti nella vostra rubrica? Questa estensione rende queste operazioni tanto facili quanto un unico click sul menu contestuale.\n\nCon questa estensione si possono copiare facilmente singole informazioni presenti nelle schede dei vostri contatti utilizzando il menu contestuale.  Con un'unica operazione sul menu si può copiare anche un'intera etichetta postale (indirizzo o nome e indirizzo). E' anche possibile usare il mouse per selezionare e copiare qualsiasi testo si desideri. Senza questa estensione, Thunderbird richiede che si apra la finestra di dialogo \"Proprietà\" del contatto, che si perda ulteriore tempo per cercare, all'interno della scheda, ciò che si desidera e copiare, una alla volta, ogni singola informazione. Con Select Address Book Text, una volta visualizzato ciò che ci interessa, si può copiarlo immediatamente.\n(<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/23dc2c761b80af0e729831d90e90c99ca81a3f2d41524dfb26e6378820e8027f/http%3A//babelzilla.org\">babelzilla.org</a> translation: \"topoldo\")",
        "sv-SE": "Select Address Book Text gör din adressbok mer användbar. Har du någon gång önskat att snabbt kunna kopiera ett namn eller telefonnummer från din adressbok till ett e-brev? Har du önskat att snabbt kunna skapa en adressetikett för en av dina adressbokskontakter? Det här tillägget gör sådana uppgifter snabba och enkla, med ett enda snabbmenyklick.\n\nMed det här tillägget blir de individuella fälten på dina kontaktkort enkla att kopiera genom att använda snabbmenyn. Du kan kopiera en hel adressetikett (adress, eller namn och adress) med en enda menyåtgärd. Du kan också använda din mus för att välja och kopiera vilken text du vill. Utan det här tillägget kräver Thunderbird att du öppnar dialogrutan \"Egenskaper\", ödslar tid på att söka efter det du vill ha och kopierar varje fält för sig. Med Select Address Book Text kan du kopiera det du letar efter så fort du ser det. \n(<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/23dc2c761b80af0e729831d90e90c99ca81a3f2d41524dfb26e6378820e8027f/http%3A//babelzilla.org\">babelzilla.org</a> translation: \"Lakrits\")",
        "es": "Hace la selección de datos de las libretas de direcciones más sencilla. ¿Necesita copiar rápidamente un nombre o un teléfono? ¿Quiere crear una lista de nombres y direcciones de correo? Est extensión hace esas operaciones con un clic del botón secundario del ratón.\n\nCon esta extensión, los datos individuales de sus contactos son fáciles de copiar usando el menú contextual. De otra forma, se necesita tener precisión para seleccionar el texto, o abrir los datos del contacto e ir seleccionando uno por uno.\n(<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/23dc2c761b80af0e729831d90e90c99ca81a3f2d41524dfb26e6378820e8027f/http%3A//babelzilla.org\">babelzilla.org</a> translation: emoreno)"
    },
    "developer_comments": null,
    "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/select-address-book-text/edit",
    "guid": "select_addressbook_text@cbmarkwardt.com",
    "has_eula": false,
    "has_privacy_policy": false,
    "homepage": {
        "sr": "",
        "en-US": "http://select-address-book.blogspot.com/",
        "it": "http://select-address-book.blogspot.com/",
        "sv-SE": ""
    },
    "icon_url": "https://addons.thunderbird.net/static/img/addon-icons/default-64.png",
    "icons": {
        "32": "https://addons.thunderbird.net/static/img/addon-icons/default-32.png",
        "64": "https://addons.thunderbird.net/static/img/addon-icons/default-64.png"
    },
    "is_disabled": false,
    "is_experimental": false,
    "is_featured": false,
    "is_source_public": true,
    "last_updated": "2011-07-08T10:46:31Z",
    "name": {
        "sr": "Select Address Book Text",
        "en-US": "Select Address Book Text",
        "sv-SE": "Select Address Book Text"
    },
    "previews": [
        {
            "id": 44224,
            "caption": {
                "en-US": "Copying home address from Address Book"
            },
            "image_size": [
                481,
                281
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/44/44224.png?modified=1530208439",
            "thumbnail_size": [
                320,
                187
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/44/44224.png?modified=1530208439"
        },
        {
            "id": 44226,
            "caption": {
                "en-US": "Example of selected text in Address Book"
            },
            "image_size": [
                533,
                208
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/44/44226.png?modified=1530208439",
            "thumbnail_size": [
                320,
                125
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/44/44226.png?modified=1530208439"
        }
    ],
    "public_stats": false,
    "ratings": {
        "bayesian_average": 4.13457,
        "count": 43,
        "average": 4.1628,
        "text_count": 43
    },
    "ratings_url": "https://addons.thunderbird.net/en-US/thunderbird/addon/select-address-book-text/reviews/",
    "requires_payment": false,
    "review_url": "https://addons.thunderbird.net/en-US/reviewers/review/7065",
    "slug": "select-address-book-text",
    "status": "public",
    "summary": {
        "fr": "Copier-coller un nom, un numéro de téléphone, une adresse ou un texte quelconque depuis votre carnet d'adresses de Thunderbird, d'un simple clic.",
        "de": "Kopieren und Einfügen von Name, Telefonnummer, Adresse oder anderen Informationen aus dem Thunderbird-Adressbuch über das Kontextmenü.",
        "nl": "Kopieer en plak snel een naam, telefoonnummer, adres of andere tekst vanuit uw adresboek in Thunderbird, met slechts één menuklik.",
        "pt-PT": "Copie e cole um nome, número de telefone, endereço e outro texto a partir do livro de endereços do Thunderbird rapidamente e com apenas um clique.",
        "sr": "Брзо копирајте и налепите име број телефона, адресу или неки други текст из Тандерберда, помоћу само једног клика.",
        "en-US": "Copy and paste a name, phone number, address or other text from your Thunderbird address book quickly, with just a single menu click.",
        "it": "Copia e incolla rapidamente dalla rubrica di Thunderbird un nome, un numero telefonico, un indirizzo o altro, usando un unico click sul menu.",
        "sv-SE": "Kopiera och klistra ett namn, telefonnummer, adress eller annan text från Thunderbirds adressbok. Snabbt och enkelt, med ett enda menyklick.",
        "es": "Copia y pega los datos personales de forma individual de las libretas de \ndirecciones de Thunderbird, con un solo clic."
    },
    "support_email": {
        "en-US": "cbmarkwardt+seladdr@gmail.com"
    },
    "support_url": {
        "en-US": "http://select-address-book.blogspot.com/"
    },
    "tags": [],
    "type": "extension",
    "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/select-address-book-text/",
    "weekly_downloads": 31
}