{
    "id": 986534,
    "authors": [
        {
            "id": 4376648,
            "name": "DaveRo",
            "url": "https://addons.thunderbird.net/en-US/thunderbird/user/DaveRo/",
            "username": "DaveRo",
            "picture_url": null
        }
    ],
    "average_daily_users": 218,
    "categories": {
        "thunderbird": [
            "composition"
        ]
    },
    "contributions_url": "",
    "current_version": {
        "id": 2469667,
        "compatibility": {
            "thunderbird": {
                "max": "70.*",
                "min": "64.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/use-bcc-instead-c/versions/2469667",
        "files": [
            {
                "id": 1012719,
                "created": "2019-04-09T13:56:05Z",
                "hash": "sha256:ee50f103883bed534d98b2614515bb1f5fd66b568cbd022184da9f070213fa80",
                "is_restart_required": true,
                "is_webextension": true,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 214269,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/1012719/use_bcc_instead_c-3.5.3-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": false,
        "license": {
            "id": 3338,
            "name": {
                "en-US": "Mozilla Public License, version 2.0"
            },
            "url": "http://www.mozilla.org/MPL/2.0/"
        },
        "release_notes": {
            "en-US": "v3.5.3  Change resulting from TB bug 1541789 (removal of xul ondialog)"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/use-bcc-instead-c/versions/3.5.3",
        "version": "3.5.3"
    },
    "default_locale": "en-US",
    "description": {
        "fr": "<b>SOMMAIRE</b>\nQui parmi vous n'a jamais fait l'erreur d'envoyer un message à un grand nombre de destinataires sans utiliser le mode \"Copie Cachée à:\" ? Révélant ainsi à tous les destinataires l'adresse électronique de chacun!\nCe module complémentaire ou extension propose plusieurs fonctions destinées à éviter ce type de désagrément. Avant tout, ce module contrôle chaque message au moment de l'envoi, afin de déterminer si une action de sa part est nécessaire afin d'éviter ce type d'incident.\n\n<b>DETAILS</b>\n<b>Lors de l'envoi d'un messsage</b>\nAprès installation, cette extesnion inspectera la liste des destinataires de chaque message. Avant l'envoi, il cherchera les destinataires en mode \"Pour:\" et \"Copie à:\". Pour ceux-là, il modifiera si nécessaire le mode en fonction des options spécifiées par l'utilisateur dans le menu options du module complémentaire.\nSi l'option \"toujours remplacer \"Pour:\" et \"Copie à:\" par \"Copie Cachée à:\" est sélectionnée (cette option n'est pas cochée par défaut après l'installation), chaque destinataire en mode \"Pour:\" ou \"Copie à:\" sera automatiquement changé en \"Copie Cachée à:\".  Cela signifie qu'aucun message ne sera envoyé avec des destinataires en mode \"Pour:\" ou \"Copie à:\".  Ces modes seront toujours modifiés  en \"Copie Cachée à:\".\nSi l'option \"toujours remplacer \"Pour:\" et \"Copie à:\" par \"Copie Cachée à:\" n'est pas sélectionnée, cette extension compte le nombre de destinataires qui sont en mode \"Pour:\" ou \"Copie Cachée à:\". Si ce nombre dépasse la valeur choisie par l'utilisateur dans la fenêtre option du module complémentaire, ou si chaque ligne de destinataires est occupée par un groupe de contacts en mode \"Pour:\" ou \"Copie Cachée à:\", cette extension permettra d'éviter la divulgation involontaire des adresses électroniques. L'action du module dépendra des choix de configuration de l'utilisateur dans la fenêtre options du module complémentaire. Par défaut, un message d'avertissement est affiché au moment de l'envoi et donne ainsi une dernière chance à l'expéditeur de reconsidérer l'envoi de ce message. Cette option peut être configurée dans l'optique d'empêcher l'envoi du message.\n<b>Lors de la création d'un message</b>\nPar défaut,  Thunderbird ouvre toujours un nouveau message ou un \"message à transférer\" avec le mode \"Pour:\". Grace à cette extension, vous pouvez changer \"Pour:\" en \"Copie à:\" ou en \"Copie Cachée à:\". Ainsi, lorsque Thunderbird ouvre un nouveau message ou un \"message à transférer\", le premier destinataire est affiché avec le mode sélectionné dans le menu options du module complémentaire.\nParfois vous pouvez avoir envie de changer le mode de tous les destinataires d'un message de l'option \"Pour:\" vers \"Copie à:\" ou \"Copie Cachée à:\". Par défaut, Thunderbird requiert le changement de chaque destinataire un à un. Cette extension offre la possibilité d'opérer ce changement depuis plusieurs endroits\n   - élément du menu Options\n   - élément du menu Contextuel\n   - Bouton que vous pouvez faire glisser sur la barre d'outils depuis la fenêtre \"Modification de la Barre d'Outils\", accessible par le chemin suivant : \"affichage\" -  \" Barre d'Outils\" - \"Personnaliser\"\n<b>Lors de la visualisation des entêtes de message dans le volet de discussion</b>\npar défaut, lors de l'envoi d'un message ne contenant que des destinataires en \"Copie Cachée\", Thunderbird ajoute une ligne \"Pour\", nommée \"undisclosed-recipients\" (=\"destinataires non dévoilés\"). Cette indication apparaît dans la colonne des destinataires pour les messages et dossiers envoyés. Cette information n'est pas très intéressante pour l'utilisateur qui préfèrerait voir la liste de ses destinataires en \"Copie Cachée à:\".\naussi, pour les versions de Thunderbird ultérieures aux versions 2.x, cette extension permet l'affichage d'une nouvelle colonne appelée \"destinataires-étendus\" à utiliser en remplacement de la colonne de destinataires standard. Une fois ajoutée au volet pour les messages et dossiers envoyés, cette colonne montre tous les destinataires quelque soit leur statut lors de l'envoi; \"Pour:\", \"Copie à:\" ou \"Copie Cachée à:\".\n<b>OPTIONS</b>\nCette extension est articulée en une configuration principale et deux secondaires pour planifier l'action du module lors de l'envoi d'un message. Elle propose également deux options de contrôle lors de la création d'un message. Ces options peuvent être facilement utilisées via la fenêtre Options du module complémentaire. Chemin d'accès: \"Outils\" - \"Modules Complémentaires\" - puis, dans la nouvelle fenêtre, la liste des extensions s'affiche: sélectionnez Options dans l'extension Bcc Instead. La plupart des options proposées ne nécessitent pas le redémarrage de Thunderbird.",
        "de": "<b>ÜBERSICHT</b>\nWer hat nicht schon einmal den Fehler gemacht, eine Broadcast-Nachricht an eine große Anzahl von Empfängern ohne BCC zu senden? Dabei werden alle E-Mail-Adressen für jeden sichtbar.\nDiese einfache Erweiterung bietet mehrere Funktionen, um genau das zu verhindern. Unter anderem prüft sie beim Senden jeder Nachricht die Empfänger-Liste und schreitet ein, falls nötig.\n\n<b>DETAILS</b>\n<b>Beim Senden einer Nachricht</b>\nBeim Senden einer Nachricht prüft die Erweiterung die Liste der Empfänger. Sind darunter An- oder CC-Empfänger, ergreift sie vor dem eigentlichen Versenden Maßnahmen, die der Benutzer in den Einstellungen festgelegt hat.\nWenn die Einstellung \"Immer alle An- und CC-Empfänger in BCC-Empfänger umwandeln\" aktiviert ist (standardmäßig deaktiviert), werden beim Versenden jeder Nachricht alle An- und CC-Empfänger automatisch in BCC-Empfänger umgewandelt, bevor die Nachricht tatsächlich gesendet wird.\nIst die Einstellung \"Immer alle An- und CC-Empfänger in BCC-Empfänger umwandeln\" nicht aktiviert, kann der Benutzer eine Obergrenze für die Anzahl von An- und CC-Empfängern angeben. Überschreitet die Anzahl diese Grenze oder ist einer der An- oder CC-Empfänger eine Verteilerliste, wird standardmäßig eine Warnmeldung angezeigt, die dem Nutzer die Möglichkeit gibt, die Nachricht entweder sofort zu senden oder vor dem Versenden noch einmal auf Richtigkeit zu prüfen. Alternativ kann in den Einstellungen festgelegt werden, dass das Senden der Nachricht gänzlich verhindert wird. Optional kann ein Warnton abgespielt werden.\n<b>Beim Verfassen einer Nachricht</b>\nStandardmäßig verwendet Thunderbird für neue und weitergeleitete Nachrichten An für die Adressierung der Empfänger. In den Einstellungen dieser Erweiterung kann diese Vorgabe auf CC oder BCC umgestellt werden.\nManchmal ist es notwendig, die Adressierung jedes Empfängers einer Nachricht von An auf CC oder BCC umzustellen. Diese Erweiterung ermöglicht es, dies für alle Empfänger gleichzeitig zu erledigen. Die entsprechende Funktion muss in den Einstellungen aktiviert werden und steht dann an den folgenden Stellen zur Verfügung\n   - Im Optionen-Menü des Verfassen-Fensters\n   - Im Kontext-Menü des Verfassen-Fensters\n   - Als Schaltfläche, die der Werkzeugleiste des Verfassen-Fensters hinzugefügt werden kann\n<b>Beim Anzeigen von E-Mail-Kopfzeilen in Thunderbirds Nachrichten-/Themenliste</b>\nStandardmäßig wird beim Senden einer E-Mail, die nur BCC-Empfänger enthält, von Thunderbird ein An-Empfänger namens \"Verborgene_Empfaenger: ;\" ergänzt. Dieser Adressat wird auch in der Spalte \"Empfänger\" der Nachrichten-/Themenliste angezeigt. In Ordnern wie \"Gesendet\" wäre es hingegen sinnvoller, hier die Liste der BCC-Empfänger anzuzeigen.\nFür Thunderbird ab Version 2.x bietet diese Erweiterung eine neue benutzerdefinierte Spalte für die Nachrichten-/Themenliste namens \"Empfänger-Erweitert\" an, die als Ersatz für die Standard-Spalte \"Empfänger\" verwendet werden soll. Sie zeigt die An-Empfänger (außer \"Verborgene_Empfaenger: ;\"), CC-Empfänger und BCC-Empfänger.\n<b>EINSTELLUNGEN</b>\nDie Option \"Aktiviere Funktion, um alle Empfänger auf An, CC oder BCC umzustellen\" erfordert einen Neustart von Thunderbird, bevor sie greift. Alle anderen Einstellungen werden augenblicklich übernommen.",
        "nl": "<b>SAMENVATTING</b>\nWie van u heeft nog nooit de fout begaan een e-mailbericht te versturen naar een groot aantal ontvangers zonder BCC te gebruiken, waardoor ieders e-mailadres voor iedereen bekend werd?\nDeze eenvoudige add-on biedt diverse functies die zijn ontworpen om dit te voorkomen. Dat doet het allereerst door elk e-mailbericht te controleren bij verzenden, om zo te bepalen of er een correctieve actie moet worden genomen om deze fout te voorkomen.\n\n<b>DETAILS</b>\n<b>Bij verzenden van een e-mailbericht</b>\nNa installatie inspecteert deze add-on de ontvangerslijst voor elk verzonden e-mailbericht. Vóór het verzenden kijkt hij naar ontvangers in de AAN- of CC-velden. Indien gevonden wordt actie ondernomen op basis van door de gebruiker ingestelde opties.\nAls de optie AAN en CC altijd vervangen door BCC is ingeschakeld (niet standaard), worden alle ontvangers in de AAN- en CC-velden automatisch gewijzigd zodat BCC wordt gebruikt voordat het bericht daadwerkelijk wordt verzonden. Dit betekent dat er nooit een e-mailbericht zal worden verzonden met een AAN- of CC-ontvanger. AAN en CC zullen altijd door BCC worden vervangen.\nAls de optie AAN en CC altijd vervangen door BCC niet is ingeschakeld, zal deze add-on het aantal ontvangers tellen dat in de AAN- of CC-velden staat. Als dat aantal een door de gebruiker in het optiesvenster ingestelde waarde overschrijdt of als een ontvanger een maillijst in het AAN- of CC-veld is, neemt deze add-on actie om te voorkomen dat e-mailadressen ongewild worden vrijgegeven. De genomen actie hangt af van hoe de gebruiker een andere optie heeft ingesteld. Standaard wordt een waarschuwingsbericht getoond en wordt een optioneel waarschuwingsgeluid afgespeeld waarna de gebruiker het verzenden van het bericht kan heroverwegen. Deze optie kan worden gewijzigd in het simpelweg verhinderen van de verzending van het bericht.\n<b>Bij opstellen e-mailbericht</b>\nStandaard maakt Thunderbird nieuwe en doorgestuurde berichten aan met ontvangers in het AAN-veld. Met deze add-on kunt u dit optioneel wijzigen van AAN in CC of BCC. Hierdoor zal een nieuw of doorgestuurd bericht in Thunderbird openen met de eerste blanco ontvanger volgens de geselecteerde methode.\nSoms wilt u alle ontvangers van een bericht wijzigen van AAN in CC of BCC. Standaard vraagt Thunderbird u om elke ontvanger individueel aan te passen. Met deze add-on kunt u optioneel deze wijziging starten vanuit de volgende plaatsen\n   - een menu-onderdeel in het menu Opties van het opstelvenster\n   - een menu-onderdeel in het contextmenu van het opstelvenster\n   - een knop die u op de werkbalk van het opstelvenster kunt plaatsen\n<b>Bij bekijken van headers in het discussiepaneel van Thunderbird</b>\nStandaard voegt Thunderbird bij het verzenden van een bericht met alleen ontvangers in het BCC-veld een AAN-ontvanger toe met de naam ‘niet-openbare ontvangers:;’. Deze waarde wordt weergegeven in de standaard-ontvangerskolom van het discussiepaneel (rechtsboven) voor de map Verzonden en vergelijkbare mappen. Deze informatie is niet echt informatief voor de eindgebruiker die waarschijnlijk liever de BCC-ontvangerslijst ziet.\nDaarom biedt deze add-on voor Thunderbird-versies hoger dan 2.x een nieuwe aangepaste kolom voor het discussiepaneel genaamd ‘Ontvangers-Uitgebreid’ die is bedoeld als vervanging van de standaard ontvangerskolom. Als deze eenmaal aan de weergave voor de map Verzonden en vergelijkbare mappen is toegeveogd, geeft deze kolom het volgende weer: AAN-ontvangers (tenzij ‘niet-openbare ontvangers:;’) OF CC-ontvangers OF BCC-ontvangers.\n<b>OPTIES</b>\nDeze add-on biedt één hoofdoptie en twee door de gebruiker in te stellen opties die het gedrag bepalen. Deze kunnen eenvoudig worden ingesteld via het ingebouwde optiesdialoogvenster. Om dit venster te openen gaat u naar menu Extra en selecteert u ‘Add-ons’. U ziet vervolgens een lijst met geïnstalleerde add-ons, en ‘Use Bcc Instead’ zou in deze lijst moeten staan. Zo niet, dan is de installatie mislukt. Zo ja, druk dan op de knop Opties. Deze opties vereisen geen herstart van Thunderbird om te worden doorgevoerd.",
        "en-US": "<b>SUMMARY</b>\nWho among us has not made the mistake of sending a 'broadcast' email to a large number of recipients without using BCC; thereby revealing everyone's email addresses to all?\nThis simple add-on offers several functions designed to prevent this from occurring. First and foremost it does so by checking each email, upon sending, to see if any corrective action should be taken to prevent this mishap.\n\n\n<b>DETAILS</b>\n<b>When Sending Email</b>\nAfter installation, this add-on will inspect the recipient list for each email sent. Before the sending occurs it looks for recipients addressed using either TO or CC. When found, it will take action based upon the user-specified options that have been set.\nIf the Always Substitute BCC for TO and CC option is enabled (it is not by default), any recipients addressed using TO or CC are automatically changed so that BCC is used instead before the message is actually sent. This means that no email will ever be sent with a TO or CC recipient. The TO or CC will be changed to BCC every time.\nIf the Always Substitute BCC for TO and CC option is not enabled, this add-on will count the number of recipients that are addressed using either TO or CC. If that count exceeds a value set by the user in this add-on's options panel or if any recipient is a mailing list addressed using TO or CC, this add-on will take action to help prevent the unintended revelation of recipient email addresses. The action that this add-on takes depends on how the user has configured an additional setting in the add-on's options panel. By default, a warning message is displayed and an optional warning sound is played giving the user a chance to reconsider the sending of the email. This option can be changed to simply prohibit the sending of the email.\n<b>When Composing Email</b>\nBy default, Thunderbird always creates new and forwarded messages with recipients addressed using TO. With this add-on, you can optionally change this from TO to either CC or BCC. So when Thunderbird's compose window opens for new or forwarded messages, the first blank recipient will be shown as addressed using the selected method.\nSometimes you might want to change all of a message's recipients from TO to CC or BCC. By default, Thunderbird requires that you change each recipient one-by-one. This add-on optionally provides the ability to trigger this change from the following locations\n   - a menu item on the compose window Options menu\n   - a menu item on the compose window context menu\n   - a button you can drag onto the compose window toolbar\n<b>When Viewing Email Headers in Thunderbird's Thread Pane</b>\nBy default, when sending an email containing only BCC'ed recipients, Thunderbird adds a TO recipient named 'undisclosed-recipients:;'. This is the value shown in the standard Recipient column of the thread pane (upper, right panel) for the Sent and similar folders. This information is not particularly informative to the end user who would likely prefer to see the BCC recipient list instead.\nSo for Thunderbird versions above 2.x, this addon provides a new custom column for the thread pane called 'Recipient-Extended' that is intended to be used as a replacement for the standard Recipient column. Once added to the pane view for the Sent and similar folders, this column will show the following: TO recipients (unless 'undisclosed-recipients:;') OR CC recipients OR BCC recipients.\n<b>OPTIONS</b>\nThis add-on offers one main and two secondary user-configured options that control its behavior when sending email. It also provides two options that control its behavior when composing email. These can most easily be manipulated via the built-in add-on options dialog. To access this dialog, go to the Tools menu and select 'Add-ons'. You will see a list of installed add-ons and 'Use Bcc Instead' should be in the list. If not, the installation did not succeed. If so, just press the Options button. Most of these options do not require a restart of Thunderbird to take effect.",
        "it": "<b>SOMMARIO</b>\nPuò capitare di inviare per errore un messaggio di posta elettronica ad un gran numero di destinatari non in CCN, rivelando così a ciascuno di essi l'indirizzo e-mail degli altri.\nCon questa semplice estensione si è tentato di risolvere il problema. Ogni messaggio viene controllato in fase di invio; nel caso in cui tra i destinatari vi sia o una lista di distribuzione o un numero maggiore del massimo numero di destinatari diretti o in CC consentiti, verrà visualizzato un avviso oppure, a scelta, sarà impossibile inviare il messaggio.\n\n<b>DETTAGLI</b>\n<b>In fase di invio di un messaggio</b>\nUna volta installata l'estensione, tutti i messaggi in uscita verranno controllati enumerando i destinatari per confrontare quanti di essi siano presenti nei campi A e CC. Se questo numero è maggiore del valore indicato nelle opzioni dell'estensione o se tra i destinatari A e CC è presente una lista di distribuzione, verranno intraprese azioni specifiche per evitare l'esposizione involontaria degli indirizzi e-mail dei destinatari.\nSe è impostata l'opzione di sostituzione automatica dei destinatari A e CC con CCN (per impostazione predefinita l'opzione non è attiva), prima dell'invio di un messaggio ogni destinatario A o CC viene modificato in modo da utilizzare CCN. Ciò significa che nessun messaggio verrà mai inviato a destinatari A o CC.\nSe è non attiva l'opzione di modifica in CCN dei destinatari A e CC, l'estensione calcolerà il numero dei destinatari presenti nei campi A e CC. Se il valore supera quello impostato dall'utente nelle opzioni dell'estensione o se uno qualsiasi dei destinatari è una lista di distribuzione presente nei campi A o CC, l'estensione farà in modo da non rivelare inavvertitamente gli indirizzi e-mail dei destinatari. L'azione intrapresa dipende dalla configurazione impostata dall'utente nel pannello delle opzioni: per impostazione predefinita verrà visualizzato un messaggio di avviso ed esiste la possibilità di configurare un avviso sonoro, in modo che l'utente possa correggere prima dell'invio del messaggio, ma si può anche configurare l'estensione in modo da bloccare completamente l'invio del messaggio.\n<b>In fase di composizione di un messaggio</b>\nPer impostazione predefinita, ogni messaggio creato con Thunderbird presuppone l'invio a destinatari utilizzando A. Con questa estensione, è possibile modificare impostando automaticamente i destinatari come CC o CCN. In questo modo, ogni volta che si crea o si inoltra un messaggio, il primo destinatario vuoto verrà creato utilizzando l'opzione scelta.\nTalvolta può essere comodo modificare tutti i destinatari di un messaggio da A a CC o CCN. Per impostazione predefinita occorre modificare uno per uno tutti i destinatari. Con questa estensione è possibile azionare questa modifica utilizzando uno dei metodi seguenti\n   - Una voce del menu Opzioni della finestra di composizione messaggio\n   - Una voce del menu contestuale della finestra di composizione messaggio\n   - Un pulsante da posizionare sulla barra degli strumenti della finestra di composizione messaggio\n<b>Visualizzazione delle instestazioni dei messaggi nel pannello messaggi di Thunderbird.</b>\nPer impostazione predefinita, inviando un messaggio e-mail contenente solo destinatari in CCN, in Thunderbird viene aggiunto un destinatario A chiamato 'destinatari-ignoti:;'. Questo valore viene visualizzato nella colonna Destinatario standard del pannello dei messaggi (in alto a destra) per la cartella Posta inviata e simili. Questa informazione non è particolarmente utile all'utente finale che potrebbe voler visualizzare al suo posto i destinatari in CCN.\nPer le versioni di Thunderbird superiori alla 2.x perciò si è provveduto perciò ad aggiungere una nuova colonna personalizzata chiamata 'Destinatario-Esteso' che può rimpiazzare quella standard. Una volta aggiunta, in questa colonna verranno mostrati i destinatari diretti (se non sono 'destinatari-ignoti:;') o i destinatari in CC o quelli in CCN.\n<b>OPZIONI</b>\nL'estensione presenta un'opzione principale e due secondarie che controllano il comportamento in fase di invio dei messaggi. Presenta inoltre due opzioni che controllano il comportamento in fase di composizione dei messaggi. Per configurare le opzioni, fare clic sul menu 'Strumenti' e successivamente su 'Componenti aggiuntivi'. Dall'elenco dei componenti aggiuntivi, fare clic su 'Use BCC Instead' e successivamente sul tasto 'Opzioni' (o 'Preferenze'). La modifica di queste opzioni non richiede il riavvio di Thunderbird.",
        "zh-CN": "<b>概述：</b>\n你有发送“广播”电子邮件给很多人时忘记使用密送，从而泄露了每个人的电子邮箱地址的经历吗？\n这个简单的附加组件试图防止这种情况。它会在发送时检查每封电子邮件，看看它是否发送给非密送的邮件列表，或是没有使用密送的收件人数量超过用户配置的数量。如果发生这种情况，可以警告用户或是阻止发送该电子邮件。\n\n<b>详细信息：</b>\n<b>当发送电子邮件时</b>\n安装完毕后，本附加组件将在每封电子邮件发送前检查收件人列表。它会计算收件人的数量看看有多少没有被密送。如果该数值超过用户在本附加组件的选项面板中的设置，或是任何一个收件人是非密送的邮件列表，本附加组件将采取行动以防止收件人的电子邮箱地址被意外披露。\n此动作需要用户在本附加组件的选项面板配置第二个设置。默认情况下，只是显示一个警告信息，让用户重新考虑发送这封电子邮件。此选项可以更改为完全禁止该电子邮件的发送。\n如果 始终对收件人和抄送接收者用密送代替 选项未启用，本附加组件将计算目的地址中使用收件人和抄送接收者的数量。如果计数值超过在本附加组件的选项面板中设置的值，或者如果任何收件人或抄送接收者是一个邮件列表的地址，本附加组件将采取行动以帮助防止收件人的电子邮件地址被泄露。采取的行动取决于用户在本附加组件的选项面板中如何配置额外的设置。默认情况下，会向用户显示一条警告消息和可选的警告音让用户有机会重新考虑那封电子邮件的发送。这个选项可以被更改成直接禁止那封电子邮件的发送。\n<b>当撰写电子邮件时</b>\n默认情况下，Thunderbird 创建新的和转发消息时始终把收件人地址放在TO。有了本附加组件，您就可以选择更改此设置，从收件人位置(TO)改成抄送(CC)或者密送(BCC)。这样，当 Thunderbird 撰写窗口打开是会使用新的设置，首个收件人或者空白的地址会放在选定的位置上。\n有时您可能想要更改一个消息的所有接收者，从 TO 改成 CC 或者 BCC。默认情况下，Thunderbird 需要您准个对其进行更改。本附加组件可以提供这样的更改方式，从下列位置您可以找到：\n   - 撰写窗口的选项菜单上的菜单项\n   - 撰写窗口的上下文菜单上的菜单项\n   - 您可以拖拽一个按钮到撰写窗口的工具栏\n<b>当在 Thunderbird 的话题面板中查看电子邮件头时</b>\n默认情况下，当发送一封只包含密送接收者的电子邮件时，Thunderbird 会添加一个名为“undisclosed-recipients:;”的TO接收者。这会显示在发件箱和类似文件夹的标准的接收者栏中（右上部的面板）。这个信息并没有多大用，用户可能更想看到密送接收者的名单而不是这个。\n因此在 Thunderbird 2.x 以上的版本，本附加组件在话题面板提供了一个新的定制列，它被称为“Recipients-Extended”（增强版接收者），它代替了标准的收件人列。只要添加到发件箱或者类似的文件夹，这个列就会显示：TO接收者（除非是“undisclosed-recipients:;”）或CC抄送或BCC密送接收者。\n<b>选项：</b>\n本附加组件提供两个供用户配置的选项控制其行为。这可以很容易的通过内置的附加组件选项对话框操作。要访问这个对话框，到工具菜单并选择“附加组件”。您将看到已安装附加组件的列表，然后在该列表中选择“Use Bcc Instead”（如果没有，表明安装没有成功）。然后只需按下选项按钮。这些选项不需要重新启动 Thunderbird 即可生效。",
        "pt-BR": "<b>RESUMO</b>\nQuem é que nunca cometeu o erro de enviar uma mensagem para um grande número de destinatários sem usar o \"Cco\", revelando assim todos os endereços de e-mail?\nEste complemento simples tenta evitar que isso ocorra. Ele analisa cada envio de mensagem para verificar se no \"Para\" ou no \"Cc\" há uma lista de e-mails ou uma quantidade de destinatários maior que o máximo configurado. Se houver, então um aviso é exibido ou o envio da mensagem é cancelado.\n\n<b>DETALHES</b>\n<b>Ao Enviar Mensagem</b>\nApós a instalação, este complemento vai analisar a lista de destinatários de cada mensagem enviada. Antes de permitir o envio, ele vai procurar destinatários que estejam no \"Para\" ou no \"Cc\". Se encontrar, ele vai agir de acordo com as opções configuradas.\nSe for selecionada a opção \"Sempre mover para o 'Cco' os destinatários no 'Para' e no 'Cc'\", todo e qualquer destinatário no \"Para\" ou no \"Cc\" vai ser automaticamente alterado para usar o \"Cco\" antes que a mensagem seja enviada. Isso significa que nenhuma mensagem jamais vai ser enviada com destinatários no \"Para\" ou no \"Cc\". O \"Para\" e o \"Cc\" vão ser alterados para \"Cco\" toda vez.\nSe a opção \"Sempre mover para o 'Cco' os destinatários no 'Para' e no 'Cc'\" não estiver selecionada, este complemento vai contar a quantidade de destinatários para verificar quantos estão no \"Para\" e no \"Cc\". Se essa contagem exceder o máximo configurado pelo usuário nas opções do complemento ou se algum destinatário for uma lista de e-mails no \"Para\" ou no \"Cc\", este complemento vai tomar medidas para ajudar a evitar a revelação involuntária de endereços de e-mail dos destinatários. A ação que este complemento executa depende de como o usuário configurou o item adicional nas opções do complemento. Por padrão, ele exibe uma mensagem de aviso e toca um som de aviso opcional, dando ao usuário a oportunidade de reconsiderar o envio da mensagem. Essa opção pode ser alterada para simplesmente proibir o envio da mensagem.\n<b>Ao Escrever Mensagem</b>\nPor padrão, o Thunderbird sempre cria mensagens novas e encaminhadas com os destinatários no \"Para\". Com este complemente você pode alterar isso para usar o \"Cc\" ou o \"Cco\". Assim, quando o Thunderbird abrir a janela de edição de mensagens novas e encaminhadas, o primeiro destinatário já vai vir com o método selecionado.\nÀs vezes a gente precisa mudar todos os destinatários de uma mensagem para usar o \"Cc\" ou o \"Cco\". Por padrão, o Thunderbird exige que os destinatário sejam alterados um por um. Este complemento oferece a capacidade de disparar essa alteração nos seguintes locais\n   - um item no menu Opções da janela de edição\n   - um item no menu de contexto da janela de edição\n   - um botão que pode ser adicionado à barra de ferramentas da janela de edição\n<b>Ao Visualizar Mensagens no Painel de Tópicos</b>\nPor padrão, ao enviar uma mensagem com destinatários apenas no \"BCC\", o Thunderbird acrescenta um destinatário no \"Para\" chamado \"destinatarios-nao-revelados:;\". Ele é exibido na coluna padrão \"Destinatário\" do painel de tópicos (parte superior direita) para a pasta de e-mail enviados ou similar. Isso não é lá muito informativo para o usuário, que pode preferir ver a lista de destinatários do \"BCC\".\nEntão, para o Thunderbird 2.x ou posterior, este complemento oferece uma nova coluna para o painel de tópicos chamada \"Destinatário-Estendido\", que pode ser usada no lugar da coluna padrão \"Destinatário\". Ao ser adicionada no painel da pasta de e-mail enviados ou similar, esse nova coluna vai exibir o seguinte: os destinatários do \"Para\" (exceto o \"destinatarios-nao-revelados:;\") ou os destinatários do \"Cc\" ou os destinatários do \"Cco\".\n<b>OPÇÕES</b>\nEste complemento oferece uma opção principal e duas adicionais que controlam seu funcionamento. Elas podem ser facilmente acionadas através da janela de configuração do complemento. Para acessar essa janela, vá ao menu Ferramentas e selecione \"Complementos\". Você verá uma lista de extensões instaladas e o \"Use Bcc Instead\" deverá estar nessa lista. Se não estiver, a instalação não foi bem sucedida. Se estiver na lista, clique no botão \"Opções\". Essas opções não exigem que o Thunderbird seja reiniciado para terem efeito.",
        "cs": "<b>SHRNUTÍ</b>\nKdo z nás někdy neposlal omylem hromadný e-mail mnoha lidem bez použití skryté kopie a tím neodhalil všechny e-mailové adresy všem?\nTento jednoduchý doplněk se tomu pokouší zabránit. Před odesláním každého e-mailu kontroluje, zda není potřeba provést nějakou úpravu, aby se tento malér nestal.\n\n<b>PODROBNOSTI</b>\n<b>Při odesílání e-mailu</b>\nNainstalovaný doplněk prozkoumá seznam příjemců u každého odesílaného e-mailu a hledá příjemce uvedené jako Komu nebo Kopie. Pokud takové nalezne, provede opatření zvolené uživatelem v nastavení.\nJe-li povolena možnost „Vždy nahradit příjemce Komu a Kopie skrytou kopií“ (není výchozí), příjemci uvedení jako Komu nebo Kopie se před odesláním zprávy automaticky změní na skrytou kopii. Žádný e-mail tak nebude odeslán pro příjemce Komu nebo Kopie, tito příjemci budou pokaždé změněni na skrytou kopii.\nPokud možnost „Vždy nahradit příjemce Komu a Kopie skrytou kopií“ povolena není, doplněk spočítá, kolik příjemců je uvedeno jako Komu nebo Kopie. Pokud tento počet přesáhne hodnotu nastavenou uživatelem v panelu možností nebo pokud je příjemcem v Komu nebo Kopii skupina e-mailů, doplněk pomůže zabránit nechtěnému prozrazení e-mailových adres příjemců. Akce, jakou doplněk provede, závisí na uživatelském nastavení v panelu možností. Ve výchozím nastavení se zobrazí varování, které uživateli umožní zvážit odeslání e-mailu. To lze změnit tak, že doplněk jednoduše nedovolí e-mail odeslat.\n<b>Při vytváření e-mailu</b>\nVe výchozím nastavení Thunderbird uvádí příjemce při vytváření nové zprávy nebo jejím přeposílání vždy jako Komu. S tímto doplňkem to můžete změnit buď na Kopii, nebo Skrytou kopii. Kdykoliv se potom otevře okno pro novou nebo přeposlanou zprávu, bude první prázdný příjemce uveden pod zvolenou metodou.\nNěkdy je potřeba změnit všechny příjemce zprávy z Komu na Kopii nebo Skrytou kopii. Ve výchozím nastavení musíte měnit příjemce po jednom. Tento doplněk nabízí možnost změnit všechny najednou, a to příkazem z následujících umístění\n   - z položky nabídky Možnosti v okně vytváření zprávy\n   - z položky místní nabídky v okně vytváření zprávy\n   - tlačítkem, které lze přetáhnout do nástrojové lišty okna vytváření zprávy\n<b>Při zobrazení zprávy v panelu Thunderbirdu s vlákny</b>\nVe výchozím nastavení Thunderbird při odesílání zprávy, která obsahuje pouze příjemce ve skryté kopii, přidá příjemce Komu nazvaného \"utajeni adresati\". Tato hodnota se zobrazuje v panelu s vlákny ve standardním sloupci Příjemce, a to pro složku Odeslaná pošta a podobné složky. To příliš nepomáhá uživateli, který by nejspíš místo toho chtěl vidět seznam příjemců ve skryté kopii.\nProto tento doplněk umožňuje od verze 2.x přidat do panelu s vlákny nový vlastní sloupec nazvaný \"Příjemce-Rozšířený\", jehož účelem je nahradit standardní sloupec Příjemce. Pokud je přidán na panel pro složku Odeslaná pošta a podobné, bude zobrazovat  následující: příjemce Komu (pokud to nejsou \"utajeni adresati\") NEBO příjemce uvedené jako Kopie NEBO Skrytá kopie.\n<b>MOŽNOSTI</b>\nChování doplňku je ovlivněno jednou hlavní a dvěma vedlejšími uživatelem nastavovanými možnostmi. Tyto možnosti lze jednoduše upravit v dialogovém okně, které se vyvolá v nabídce Nástroje volbou Správce doplňků. Objeví se seznam nainstalovaných doplňků, který by měl obsahovat „Použít skrytou kopii“. Není-li tomu tak, instalace doplňku se nezdařila. V opačném případě zvolte tlačítko Předvolby. Aby se změny nastavení uplatnily, není třeba Thunderbird restartovat.",
        "sv-SE": "<b>SAMMANFATTNING</b>\nVilka ibland oss har inte gjort misstaget att skicka ett broadcast-meddelande till ett stort antal mottagare utan att använda \\\"Dold kopia\\\" (Bcc), vilket avslöjar alla inblandades e-postadresser för varandra?\nDet här lilla tillägget försöker förhindra att så sker. Det gör det genom att kontrollera varje e-brev, när de skickas, för att se om någon åtgärd bör vidtas för att korrigera misstaget.\n\n<b>FUNKTION</b>\n<b>När ett meddelande skickas</b>\nEfter installation kommer detta tillägg att granska mottagarlistan för varje meddelande som skall skickas. Innan sändningen utförs letar det efter adressater som märkts som antingen Till eller Kopia. När sådana hittas, kommer tillägget att agera utifrån de inställningar som har angivits av användaren.\nOm alternativet \\\"Ändra alltid Till- och Kopia-status till Dold kopia\\\" är aktiverat (som standard är det inaktiverat), så kommer alla mottagare som märkts som Till eller Kopia automatiskt att märkas om till Dold kopia innan meddelandet skickas. Det betyder att inga e-brev med Till- eller Kopia-mottagare kommer att skickas. Märkningarna Till och Kopia kommer att ändras till Dold kopia varje gång.\nOm alternativet \\\"Ändra alltid Till- och Kopia-status till Dold kopia\\\" inte är aktiverat, så kommer tillägget att räkna antalet mottagare som är angivna som antingen Till eller Kopia. Om antalet överstiger det värde som användaren har angivit i tilläggets inställningar eller om någon mottagare är en e-postlista med e-postadresser märkta som Till eller Kopia, så kommer tillägget att göra sig påmint för att hjälpa dig att inte oavsiktligen avslöja mottagarnas e-postadresser. Åtgärden som tillägget vidtar beror på hur användaren har konfigurerat ett annat alternativ i tilläggets inställningar. Som standard visas ett varningsmeddelande, som ger användaren möjlighet att avbryta sändningen av meddelandet. Detta alternativ kan ändras till att helt enkelt förbjuda att meddelandet skickas.\n<b>När ett meddelande skrivs</b>\nSom standard skapar alltid Thunderbird nya och vidarebefordrade meddelanden med mottagare adresserade med Till. Med detta tillägg kan du, om du vill, ändra det från Till till antingen Kopia eller Dold kopia. Så när Thunderbirds Skriv-fönster öppnar för nya eller vidarebefordrade meddelanden, kommer den första tomma mottagaren att adresseras med den metod du har valt.\nIbland kan du vilja ändra alla mottagare av ett meddelande från Till till Kopia eller Dold kopia. Som standard kräver Thunderbird att du ändrar varje mottagare en efter en. Detta tillägg ger dig möjlighet att ändra alla mottagare samtidigt, från följande platser\n   - ett menyobjekt i Skriv-fönstrets Inställningar-meny\n   - ett menyobjekt i Skriv-fönstrets snabbmeny\n   - en knapp du kan dra till Skriv-fönstrets verktygsfält\n<b>Vid visning av meddelandehuvuden i Thunderbirds trådpanel</b>\nVid sändning av ett meddelande som endast innehåller Dold kopia-mottagare, lägger Thunderbird som standard till en mottagare som kallas \"mottagare obekant:;\". Det är det värde som visas i den vanliga Mottagare-kolumnen i trådpanelen (den övre, högra panelen) för mappen Skickat och liknande mappar. Denna information är inte särskilt informativ för slutanvändaren, som antagligen skulle vilja se en lista över Dold kopia-mottagarna.\nSå för Thunderbird-versioner senare än 2.x kommer detta tillägg att tillhandahålla en ny anpassad kolumn för trådpanelen, kallad \"Mottagare-Utökad\", som är menad att användas som ersättning för den vanliga Mottagare-kolumnen. När den väl har lagts till i panelvyn för mappen Skickat och liknande mappar, kommer kolumnen att visa Till-mottagare (om inte \"mottagare obekant:;\" visas) ELLER Kopia-mottagare ELLER Dold kopia-mottagare.\n<b>INSTÄLLNINGAR</b>\nDetta tillägg erbjuder ett huvudalternativ och två användarkonfigurerade alternativ som kontrollerar dess beteende när meddelanden skickas. Det tillhandahåller även två alternativ som kontrollerar dess beteende när meddelanden skrivs. Alla dessa manipuleras enklast via den inbyggda inställningsdialogrutan. För att öppna denna dialogruta, gå till Verktyg-menyn och välj \\\"Tillägg\\\". Leta upp \\\"Use Bcc Instead\\\" i listan över installerade tillägg. Klicka på knappen \\\"Inställningar\\\". Dessa inställningar kräver ingen omstart av Thunderbird för att verkställas.",
        "es": "<b>Resumen</b>\n¿Quién entre nosotros no ha cometido el error de enviar un mensaje a un gran número de destinatarios sin usar Bcc y revelando así las direcciones de correo a todo el mundo?\nEsta sencilla extensión ofrece varias funcionalidades para prevenir que eso ocurra. Lo primero, comprueba cada correo al ser enviado para verificar si se debe tomar alguna acción correctiva para prevenir esta distracción.\n\n<b>DETALLES</b>\n<b>Al enviar correos</b>\nDespués de la instalación, esta extensión inspeccionará la lista de destinatarios de cada correo enviado. Antes de hacer efectivo el envío comprueba las direcciones de los destinatarios en Para y Cc. Si las hay, tomará las acciones correspondientes basándose en las opciones que hayas especificado.\nSi se habilita la opción de Siempre sustituye destinatarios Para o Cc por Bcc (no lo está por defecto), cualquier destinatario en los campos Para o Cc pasará a Bcc automáticamente antes de enviar el mensaje. Esto quiere decir que nunca será enviado un correo con direcciones en Para o Cc. Los campos Para y Cc serán cambiados a Bcc cada vez.\nSi no se habilita la opción Siempre sustituye destinatarios Para o Cc por Bcc, esta extensión contará el número de direcciones en los campos Para y Cc. Si ese número excede el valor establecido en el panel de opciones de esta extensión o si cualquiera de los destinatarios es una lista con direcciones en Para y Cc, esta extensión actuará para prevenir la revelación no intencionada de las direcciones. La acción tomada dependerá de cómo el usuario configure las demás opciones del panel de opciones de esta extensión. Por defecto, se presenta un aviso de precaución y, opcionalmente, sonará un aviso dando al usuario la oportunidad de reconsiderar el envío del correo. Esta opción se puede cambiar para que simplemente se prohíba enviar el correo.\n<b>Al componer un nuevo correo</b>\nPor defecto, Thunderbird crea siempre con las direcciones de destinatarios en Para. Con esta extensión, se puede cambiar eso desde Para a Cc o Bcc. De esa forma la ventana de composición de Thunderbird de mensajes nuevos o reenviados pondrá la dirección en el modo especificado.\nAlgunas veces se quiere cambiar todos las direcciones a Para, Cc o Bcc. Por defecto, Thunderbird requiere que se cambie cada dirección individualmente. Esta opción permite realizar ese cambio desde los siguiente sitios\n   - un item del menú en las opciones de la ventana de composición\n   - un punto del menú contextual de la ventana de composición\n   - un botón que puedes arrastrar a la barra de la ventana\n<b>Revisando las cabeceras del correo en el panel de conversaciones de Thunderbird</b>\nPor defecto, cuando se envía un correo conteniendo direcciones sólo en el campo Bcc, Thunderbird añade un Para con 'destinatarios-no-revelados:;'. Este es el valor mostrado en la columna de Destinatario en las carpetas de Enviados y similares. Esta información no es particularmente informativa para el usuario final que quizá prefiera ver la lista de Bcc en su lugar.\nAsí que para Thunderbird versión 2 o superior, esta extensión proporciona una nueva columna en la lista de mensajes llamada 'Destinatario-Extendido' que intenta ser un reemplazo de la columna Destinatario por defecto. Una vez que se ha añadido al panel de visión para las carpetas Enviado y similares, esta columna mostrará los destinatarios: Para (excepto 'destinatarios-no-revelados:;') o Cc o Bcc.\n<b>OPCIONES</b>\nEsta extensión ofrece una opción principal de configuración y dos opciones secundarias para controlar su comportamiento al enviar correos. Proporciona también dos opciones que controlan el comportamiento cuando se componen correos. La forma fácil de manipularlas es a través del panel de opciones interno. Para acceder ese panel, ir al menú Herramientas y seleccione Complementos. Aparecerá una lista de los complementos y, entre ellos, useBccInstead. Si no aparece, la instalación no ha sido satisfactoria. Si aparece, presione el botón Opciones. La mayoría de las opciones no necesitan reiniciar Thunderbird para su activación."
    },
    "developer_comments": null,
    "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/use-bcc-instead-c/edit",
    "guid": "use_bcc_instead_C@davero.addons.mozilla.org",
    "has_eula": false,
    "has_privacy_policy": false,
    "homepage": null,
    "icon_url": "https://addons.thunderbird.net/user-media/addon_icons/986/986534-64.png?modified=1c375882",
    "icons": {
        "32": "https://addons.thunderbird.net/user-media/addon_icons/986/986534-32.png?modified=1c375882",
        "64": "https://addons.thunderbird.net/user-media/addon_icons/986/986534-64.png?modified=1c375882"
    },
    "is_disabled": false,
    "is_experimental": false,
    "is_featured": false,
    "is_source_public": true,
    "last_updated": "2019-07-05T04:00:20Z",
    "name": {
        "en-US": "Use BCC Instead C",
        "de": "Use BCC Instead C",
        "fr": "Use BCC Instead C",
        "es": "Use BCC Instead C"
    },
    "previews": [
        {
            "id": 205638,
            "caption": {
                "en-US": "Select Add-on Preferences"
            },
            "image_size": [
                476,
                444
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/205/205638.png?modified=1555170061",
            "thumbnail_size": [
                214,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/205/205638.png?modified=1555170061"
        },
        {
            "id": 205639,
            "caption": {
                "en-US": "Preferences entry"
            },
            "image_size": [
                442,
                346
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/205/205639.png?modified=1555170061",
            "thumbnail_size": [
                255,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/205/205639.png?modified=1555170061"
        },
        {
            "id": 205643,
            "caption": {
                "en-US": "Change all recipients to To, CC, or BCC from toolbar"
            },
            "image_size": [
                755,
                369
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/205/205643.png?modified=1555170067",
            "thumbnail_size": [
                320,
                156
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/205/205643.png?modified=1555170067"
        },
        {
            "id": 205644,
            "caption": {
                "en-US": "Change all recipients to To, CC, or BCC from context menu"
            },
            "image_size": [
                755,
                661
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/205/205644.png?modified=1555170067",
            "thumbnail_size": [
                228,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/205/205644.png?modified=1555170067"
        },
        {
            "id": 205645,
            "caption": {
                "en-US": "Warning if max To and CC recipients exceeded"
            },
            "image_size": [
                682,
                168
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/205/205645.png?modified=1555170065",
            "thumbnail_size": [
                320,
                79
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/205/205645.png?modified=1555170065"
        }
    ],
    "public_stats": false,
    "ratings": {
        "bayesian_average": 4.35689,
        "count": 2,
        "average": 5,
        "text_count": 2
    },
    "ratings_url": "https://addons.thunderbird.net/en-US/thunderbird/addon/use-bcc-instead-c/reviews/",
    "requires_payment": false,
    "review_url": "https://addons.thunderbird.net/en-US/reviewers/review/986534",
    "slug": "use-bcc-instead-c",
    "status": "public",
    "summary": {
        "en-US": "This is a version of 'Use BCC Instead' updated for Thunderbird 64 and above.\n\nIt prevents you accidentally sending an email to a large number of recipients without hiding their addresses from each other by using BCC.",
        "de": "Dies ist eine Version von \"Use BCC Instead\", aktualisiert für Thunderbird 64 und neuer.\n\nEs verhindert, dass du aus Versehen eine Email an eine große Anzahl Empfänger sendest ohne ihre Adressen mittels Blindkopie (BCC) zu verbergen.",
        "fr": "Ceci est une version de 'Use BCC Instead' mise à jour pour Thunderbird 64 et supérieur.\n\nCela vous évite d'envoyer accidentellement un courrier électronique à un grand nombre de destinataires sans se cacher leurs adresses en utilisant BCC.",
        "es": "Esta es una versión de \"Use BCC instead\" actualizada para Thunderbird 64 y superior.\n\nEvita que mandes un mensaje sin querer a una gran cantidad de personas sin ocultar sus dirreciones con BCC"
    },
    "support_email": null,
    "support_url": {
        "en-US": "https://github.com/revad/use_bcc_instead_C/"
    },
    "tags": [
        "firefox57"
    ],
    "type": "extension",
    "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/use-bcc-instead-c/",
    "weekly_downloads": 0,
    "xpilib": {
        "ext_comp": {
            "mext": true,
            "comp68": true,
            "comp69plus": true,
            "comp61plus": true
        }
    }
}