{
    "id": 195275,
    "authors": [
        {
            "id": 5389259,
            "name": "Jonathan Kamens",
            "url": "https://addons.thunderbird.net/en-US/thunderbird/user/jikamens/",
            "username": "jikamens",
            "picture_url": "https://addons.thunderbird.net/user-media/userpics/5/5389/5389259.png?modified=1579925536"
        }
    ],
    "average_daily_users": 78300,
    "categories": {
        "seamonkey": [
            "miscellaneous"
        ],
        "thunderbird": [
            "calendar",
            "composition"
        ]
    },
    "contributions_url": "https://www.paypal.com/cgi-bin/webscr?cmd=_donations&business=jik%40kamens%2eus&lc=US&item_name=Send%20Later%20add%2don%20%28%245%2e00%20recommended%20donation%2c%20but%20give%20what%20you%27d%20like%21%29&currency_code=USD&bn=PP%2dDonationsBF%3abtn_donat",
    "created": "2010-07-09T19:07:32Z",
    "current_version": {
        "id": 2473755,
        "compatibility": {
            "thunderbird": {
                "max": "71.*",
                "min": "68.0a1"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/send-later-3/versions/2473755",
        "files": [
            {
                "id": 1016917,
                "created": "2020-05-28T12:29:44Z",
                "hash": "sha256:383962c29d2725dbbbcaf9f8528ef9a2c156336abb7523e3872dd90ef6f2e0fa",
                "is_restart_required": true,
                "is_webextension": true,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 494640,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/1016917/send_later-7.4.4-tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 3338,
            "name": {
                "en-US": "Mozilla Public License, version 2.0"
            },
            "url": "http://www.mozilla.org/MPL/2.0/"
        },
        "release_notes": {
            "en-US": "Somehow some Dutch strings ended up in the Danish translation. I have no idea how this happened, but it's fixed now."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/send-later-3/versions/7.4.4",
        "version": "7.4.4"
    },
    "default_locale": "en-US",
    "description": {
        "el": "Αλλάζει το \"Send Later\" εντολής (Ctrl + Shift + Return) στο παράθυρο σύνθεση μηνύματος, έτσι ώστε αντί απλώς αντιγράφοντας το μήνυμα στο φάκελο \"Εξερχόμενα\", έτσι ώστε να αποσταλεί την επόμενη φορά που πηγαίνετε σε απευθείας σύνδεση ή να κάνετε «Αποστολή μη απεσταλμένα μηνύματα», ένα παράθυρο διαλόγου σκάει επάνω που σας επιτρέπει να καθορίσετε πότε θα σταλεί το μήνυμα. \nΜπορείτε να καθορίσετε μια συγκεκριμένη ώρα και ημερομηνία, ή κάντε κλικ στο κουμπί \"15 mins later\", \"30 mins later\" ή \"2 hours later\", ή κάντε κλικ στο κουμπί \"Put in Outbox\" για να πάρει το ενσωματωμένο Thunderbird\"Send Later\" λειτουργία (δηλ., αντίγραφο στα εξερχόμενα). \nΓια πρόσθετες πληροφορίες, ανατρέξτε στον <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\"> λίστας αλληλογραφίας</a>! \nΑποστολή αργότερα χρησιμοποιεί <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> by Andrew Plummer. Ευχαριστώ Andrew!",
        "ca": "Modifica la comanda \"Enviar més tard\" (Ctrl+Majúsc+Intro) a la finestra de redacció, de manera que en comptes de copiar el missatge a la safata de sortida perquè s'enviï la propera vegada que es connecti o es doni l'ordre d'\"Enviar els missatges pendents\", es mostra una finestra emergent que permet especificar quan s'enviarà el missatge.\n\nEs pot especificar una data i hora, o seleccionar \"15 minuts després\", \"30 minuts després\" o \"2 hores després\", o marcar \"Enviar a la safata de sortida\" per obtenir la funcionalitat pròpia per \"Enviar més tard\" de Thunderbird, és a dir, copiar a la safata de sortida.\n\nPer informació addicional, pot consultar la <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">guia d'usuari</a>.\n\nUneix-te a la <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">llista de correus</a>!\n\nSend Later utilitza <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> d'Andrew Plummer. Gràcies Andrew!",
        "it": "Modifica il comando \"Invia Dopo\" (Ctrl+Shift+Invio) nella finistra di composizione del messaggio, cosi che invece che semplicemente copiare il messaggio nella tua Posta in Uscita perchè venga inviato la prossima volta che sei online o esegui \"Invia Messaggi in Uscita\", compare una finestra di dialogo che ti permette di specificare quando il messaggio debba essere inviato.\n\nPuoi indicare una specifica data e ora, o cliccare \"Tra 15 minuti\", \"Tra 30 minuti\" or \"Tra 2 ore\", o cliccare \"Metti nella Posta in Uscita\" per replicare la funzionalità nativa di Thunderbird \"Invia Dopo\" (ovvero, copiare nella Posta in Uscita).\n\nPer ulteriori informazioni, leggi il <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">manuale utente</a>.\n\nIscriviti alla <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">mailing list</a>!\n\nSend Later usa <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> di Andrew Plummer. Grazie Andrew!",
        "fi": "Muuttaa \"Lähetä myöhemmin\" komentoa (Ctrl+Shift+Return) viestin luonti-ikkunassa, jotta pelkän Lähtevät-kansioon kopioimisen sijasta se lähetetään kun luot yhteyden verkkoon tai painat \"Lähetä lähettämättömät viestit\", jolloin ilmestyy dialogi joka antaa sinun määritää milloin viesti lähetetään.\n\nVoit määrittää tietyn ajan ja päivämäärän tai painaa \"15 min myöhemmin\", \"30 min myöhemmin\" tai \"2 tuntia myöhemmin\" tai käyttää normaalia Thunderbirdin \"Lähetä myöhemmin\" toimintoa (jolloin viesti siis vain kopioidaan Lähtevät-kansioon).\n\nLisätietoja saat <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">käyttöohjeesta</a>.\n\nLiity <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">sähköpostilistalle</a>!\n\nSend Later käyttää Andrew Plummerin <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a>:ää. Kiitos Andrew!",
        "cs": "Upravuje příkaz „Odeslat později“ (Ctrl + Shift + Return) v okně pro vytvoření zprávy, takže místo pouhého zkopírování zprávy do složky „Pošta k odeslání“, aby byla odeslána později při dalším připojení, nebo při použití funkce „Odeslat neodeslané zprávy“, se otevře dialogové okno, ve kterém můžete určit, kdy má být zpráva odeslána.\n\nPro pozdější odeslání zprávy můžete určit konkrétní čas a datum, nebo použít předvolby „Za 15 minut“, „Za 30 minut“ a „Za 2 hodiny“, nebo kliknout na „Dát do „Pošty k odeslání““ pro použití originální funkce „Odeslat později“ v Thunderbirdu (tj., zkopírovat zprávu do složky „Pošty k odeslání“).\n\nDalší informace naleznete v <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\"> uživatelské příručce</a>.\n\nPřipojte se k <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">mailing listu</a>!\n\n„Odeslat později“ využívá <a href=\"https://sugarjs.com/\" rel=\"nofollow\"> SugarJS</a> od Andrew Plummera. Díky Andrew!",
        "sv-SE": "Ändrar kommandot \"Skicka senare\" (Ctrl+Skift+Retur) i Skriv-fönstret. Istället för att endast kopiera meddelandet till din utkorg, så att det skickas nästa gång du ansluter till Internet eller klickar på \"Skicka meddelanden som inte är skickade\", visas ett dialogfönster som låter dig bestämma när meddelandet skall skickas.\n\nDu kan ange en viss tid och ett visst datum, klicka på de förinställda värdena \"15 min senare\", \"30 min senare\" eller \"2 timmar senare\", eller klicka på \"Lägg i utkorgen\" för att använda Thunderbirds inbyggda \"Skicka senare\"-funktion (d.v.s. kopiera till utkorgen).\n\nLäs <a href=\"http://blog.kamens.us/send-later\" rel=\"nofollow\">användarhandboken</a> för ytterligare information.\n\nGå med i <a href=\"http://groups.google.com/group/send-later-users\" rel=\"nofollow\">e-postlistan</a>!\n\nSkicka senare använder <a href=\"http://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> av Andrew Plummer. Tusen tack, Andrew!",
        "es": "Cambia el comando \"enviar después\" (Ctrl+May+Enter) en la ventana de composición de mensajes, para que en vez de simplemente copiar el mensaje a la bandeja de salida para enviarse la siguiente vez que Vd. se conecte (o ejecute \"procesar mensajes\" no enviados), un diálogo aparezca para permitirle especificar cuándo se enviará el mensaje.\n\nPuede especificar una fecha y hora específicas o hacer click en \"15 minutos más tarde\", \"30 minutos más tarde\" o \"2 horas más tarde\", o, alternativamente, pulsar \"enviar a bandeja de salida\" para tener la funcionalidad nativa de Thunderbird para envío diferido.\n\nPara información adicional, mire la guía de usuario en: <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">Send Later user guide</a>.\n\nApúntese a la ilsta de correo en: <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">mailing list</a>!\n\nEnviarDespués (SendeLater) utiliza <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> por Andrew Plummer. ¡Gracias Andrew!",
        "ru": "Вызывайте команду \"Send Later\" (Ctrl+Shift+Return) из окна редактирования письма, чтобы взамен простого копирования сообщения в вашу папку «Исходящие» оно было бы отправлено в следующий раз, когда вы будете онлайн или отправите «Неотправленные сообщения». Эту команду возможно изменить в диалоговом окне, позволяющем указать время отправки сообщения.\n\nЧтобы воспользоваться встроенной функцией \"Send Later\" в Thunderbird (например, скопировать в папку «Исходящие»), Вы можете установить определенное время и дату или нажать на клавиши \"15 минут спустя\", или \"30 минут спустя\", или \"2 часа спустя\", или \"Поместить в папку «Исходящие»\".\n\nДля дополнительной информации смотрите <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">Руководство Пользователя</a>.\n\nПодпишитесь на <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">рассылку</a>!\n\nSend Later использует <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> Андрея Пламмера. Спасибо, Андрей!",
        "nl": "Wijzigt de opdracht ‘Later verzenden’ (Ctrl+Shift+Return) in het berichtopstelvenster, zodat in plaats van alleen het bericht naar uw Postvak UIT te kopiëren en dit de volgende keer dat u online gaat of door ‘Niet-verzonden berichten verzenden’ te kiezen wordt verzonden, een dialoogvenster verschijnt waarmee u kunt opgeven wanneer het bericht wordt verzonden.\n\nU kunt een bepaalde tijd en datum opgeven, of op ‘15 min. later’, ‘30 min. later’ of ‘2 uur later’ klikken, of op ‘In Postvak UIT plaatsen’ klikken voor de ingebouwde functionaliteit voor ‘Later verzenden’ van Thunderbird (m.a.w. kopiëren naar Postvak UIT).\n\nZie de <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">gebruikershandleiding</a> voor aanvullende informatie.\n\nSchrijf u in voor de <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">mailinglijst</a>!\n\nSend Later gebruikt <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> van Andrew Plummer. Bedankt Andrew!",
        "en-US": "Changes the \"Send Later\" command (Ctrl+Shift+Return) in the message composition window, so that instead of merely copying the message into your Outbox so that it is sent the next time you go online or do \"Send Unsent Messages\", a dialog pops up which allows you to specify when the message will be sent.\n\nYou can specify a specific time and date, or click \"15 mins later\", \"30 mins later\" or \"2 hours later\", or click \"Put in Outbox\" to get the built-in Thunderbird \"Send Later\" functionality (i.e., copy to Outbox).\n\nFor additional information, see the <a href=\"http://blog.kamens.us/send-later\" rel=\"nofollow\">user guide</a>.\n\nJoin the <a href=\"http://groups.google.com/group/send-later-users\" rel=\"nofollow\">mailing list</a>!\n\nSend Later uses <a href=\"http://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> by Andrew Plummer. Thanks Andrew!",
        "ro": "Schimbă comanda „Trimite mai târziu” (Ctrl+Shift+Return) din fereastra de compunere a mesajului: în loc ca mesajul să fie doar pus în dosarul „De trimis” pentru a fi trimis la următoarea operațiune de trimitere, fie când aplicația revine online fie la „Trimite mesajele neexpediate”, se va deschide o fereastra care permite programarea trimiterii mesajului.\n\nSe poate selecta fie o anumita dată/oră, fie „peste 15 minute”, „peste 30 minute” sau „peste 2 ore”, fie „Pune în „De trimis”” pentru a obține funcționalitatea implicită din Thunderbird pentru „Trimite mai târziu” (adică copiere în „De trimis”).\n\nPentru informații suplimentare, vezi: <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">ghidul utilizatorului</a>.\n\nÎnscrie-te în <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">lista de corespondență</a>!\n\nSend Later folosește <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> de Andrew Plummer. Mulțumesc Andrew!",
        "pl": "Zmienia wbudowane polecenie \"Wyślij później\" (Ctrl + Shift + Return) w oknie tworzenia wiadomości, tak, że zamiast zwykłego umieszczenia wiadomości w skrzynce nadawczej aby były wysyłane przy następnym przejściu w tryb online lub użycia polecenia \"Wyślij niewysłane wiadomości\", wyskakuje okno dialogowe które pozwala określić, kiedy wiadomość zostanie wysłana.\n\nMożesz podać datę i godzinę wysłania, lub wybrać opóźnienie \"za 15 min.\", \"za 30 min.\", \"za 2 godz.\" albo użyć \"umieść w skrzynce nadawczej\" i pozwolić działać wbudowanej w Thunderibirda funkcjonalności \"Wyślij później\".\n\nPo dodatkowe informacje zajżyj do <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">instrukcji</a>.\n\nDołącz się i zapisz się do <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">listy mailingowej</a>!\n\nSend Later używa <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> autorstwa Andrew Plummer. Dzięki Andrew!",
        "fr": "Modifie la commande « Envoyer plus tard » (Ctrl + Maj + Retour) dans la fenêtre de composition de message, de sorte qu’au lieu de simplement envoyer le message, une boîte de dialogue apparaît qui vous permet d’indiquer quand le message sera envoyé. \n\nVous pouvez spécifier une date et heure précise ou cliquer sur « 15 minutes plus tard », « 30 minutes plus tard » ou « 2 heures plus tard » ou cliquer sur « Envoyer plus tard » pour utiliser la fonction native de Thunderbird (copie le message dans la boîte d'envoi).\n\nPour plus d’informations, consultez le <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\"> guide de l’utilisateur</a>.\n\nInscrivez-vous sur la <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\"> liste de diffusion </a>!\n\nEnvoyer plus tard utilise <a href=\"https://sugarjs.com/\" rel=\"nofollow\"> SugarJS</a> par Andrew Plummer. Merci Andrew!",
        "bg": "Променя командата \"Изпращане по-късно\" (Ctrl + Shift + Return) в прозореца за съставяне на съобщения, така че вместо просто да копира съобщението във вашата Изходяща кутия, за да бъде изпратено следващия път, когато отворите приложението или изпращате \"Изпращане на неизпратените писма\", отваря диалогов прозорец, който ви позволява да посочите, кога да бъде изпратено съобщението.\n\nМоже да зададете определено време и дата, или да щракнете върху \"15 минути по-късно\", \"30 минути по-късно\" или \"2 часа по-късно\", или да щракнете върху \"Поставяне в изходящи\", за да получите вградената в Thunderbird \"Изпращане по-късно\" функционалност (т.е., копиране в папка \"Изходяща кутия\").\n\nЗа допълнителна информация вижте <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">ръководство на потребителя</a>.\n\nПрисъединете се към <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">пощенския списък</a>!\n\nИзпращане по-късно използва <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> от Андрю Плъмър. Благодаря Андрю!",
        "de": "Verändert den „Später senden”-Befehl (Strg+Umschalt+Enter) im Entwurfs-Fenster so, dass die Nachricht nicht nur in den Postausgang kopiert und bei der nächsten Sitzung versendet wird oder mit „Nachrichten aus Postausgang senden” verschickt werden kann, sondern ein Dialog erscheint, in dem Sie genauer angeben können, wann die Nachricht versendet werden soll. \n\nSie können spezifische Zeit- und Datumsangaben machen oder entweder „in 15 Minuten”, „in 30 Minuten”, „in zwei Stunden” bzw. „In den Postausgang verschieben” auswählen, um die „Später senden”-Funktion von Thunderbird zu verwenden (d.h. die Nachricht in den Postausgang zu verschieben.) \n\nFür weitere Informationen lesen Sie <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">das Handbuch</a>.\n\nTreten Sie der <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">Mailing-Liste</a> bei!\n\nSpäter senden benutzt <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> von Andrew Plummer. Danke Andrew!",
        "hu": "Az üzenet-összetétel ablakban megváltoztatja a „Küldés később” parancsot (Ctrl+Shift+Enter), hogy ahelyett, hogy csak az üzeneteket másolná a Kimenő mappába, hogy elküldje a következő alkalommal, amikor online megy, vagy „Postázandó üzenetek elküldése”, megjelenik egy párbeszédablak, amely lehetővé teszi, hogy megadja, mikor küld az üzenet.\n\nMegadhat egy adott időpontot és dátumot, vagy kattintson a „15 perccel később”, „30 perccel később” vagy „2 órával később” gombra, vagy kattintson a „Kimenő üzenetek” gombra a beépített Thunderbird „Küldés később” funkciójának eléréséhez (azaz, másolja a Postázandó üzenetek mappába).\n\nTovábbi tájékoztatókért <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">kattintson ide a felhasználói útmutató megtekintéséhez</a>.\n\nCsatlakozzon a <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">levelezési listához</a>!\n\nA Küldés később használja a Plummer András által <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> készített alkalmazást. Köszönöm, András!",
        "pt-BR": "Altera o \"Enviar mais tarde\" (Ctrl + Shift + Return) na janela de composição da mensagem, de modo que em vez de simplesmente copiar a mensagem em sua caixa de saída para que ele seja enviada na próxima vez que estiver online ou \"Enviar mensagens não enviadas\", aparece uma janela que lhe permite especificar quando a mensagem será enviada.\n\nVocê pode especificar uma data e hora, ou clique em \"15 minutos mais tarde\", \"30 minutos mais tarde\" ou \"2 horas mais tarde\", ou clique em \"Coloque na Caixa de saída\" para obter o built-in Thunderbird \"Enviar mais tarde\" funcionalidade (ou seja, , copiar a caixa de saída).\n\nPara obter informações adicionais, consulte o <a href=\"http://blog.kamens.us/send-later/\" rel=\"nofollow\">guia do usuário</a>.\n\nJunte-se à <a href=\"https://groups.google.com/forum/#!forum/send-later-users\" rel=\"nofollow\">lista de discussão</a>!\n\nEnviar mais tarde usa <a href=\"http://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> por Andrew Plummer. Obrigado Andrew!",
        "nb-NO": "Endrer \"Send senere\" -kommandoen (Ctrl + Shift + Enter) i meldingsammensetningsvinduet, slik at i stedet for bare å kopiere meldingen til utgangen din slik at den sendes neste gang du går online eller gjør \"Send ikke sendte meldinger\" en dialogboks dukker opp som lar deg spesifisere når meldingen skal sendes.\n\nDu kan spesifisere en bestemt dato og klokkeslett, eller klikk \"15 minutter senere\", \"30 minutter senere\" eller \"2 timer senere\", eller klikk \"Sett inn i utgang\" for å få den innebygde Thunderbird \"Send later\" -funksjonaliteten (dvs., kopier til utgang).\n\nFor mer informasjon, se <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\"> brukerhåndboken </a>.\n\nBli med på <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\"> postlisten </a>!\n\nSend senere bruker <a href=\"https://sugarjs.com/\" rel=\"nofollow\"> SugarJS </a> av Andrew Plummer. Takk Andrew!",
        "ja": "メッセージ作成ウィンドウの\"後で送信\"コマンド(Ctrl+Shift+Return)を変更しました。\n単にメッセージを送信箱にコピーして次回オンラインになった時や\"未送信メッセージを送信する\"を実行したときにそのメッセージが送信されるようにする代わりに、ダイアログが表示され、メッセージをいつ送信するかを指定できるようになります。\n\n特定の日時を指定することもできますが、\"15分後\", \"30分後\"あるいは\"2時間後\", or click \"Put in Outbox\" to get the built-in Thunderbird \"Send Later\" functionality (i.e., copy to Outbox).\n\nさらに詳しい情報は<a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">ユーザーガイド</a>をご覧ください。\n\nSend Lateユーザーの<a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">メーリングリスト</a>に参加してください!\n\nSend LaterはAndrew Plummer氏による<a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a>を使用しています。ありがとうAndrew!",
        "he": "משנה את הפקודה \"שלח מאוחר יותר\" (Ctrl + Shift + Return) בחלון כתיבת הודעה, כך שבמקום להעתיק את ההודעה לתיבת הדואר היוצא היא תישלח בפעם הבאה שתתחבר לאינטרנט או שתבחר באפשרות \"שלח הודעות שלא נשלחו\", ותוצג תיבת דו שיח בה ניתן לציין מתי יש לשלוח את ההודעה.\n\nתוכל להגדיר תאריך ושעה ספציפיים, או ללחוץ \"בעוד 15 דקות\", \"בעוד 30 דקות\" או \"בעוד שעתיים\", או ללחוץ \"העבר לתיבת דואר יוצא\" כדי להשתמש בתכונה \"שלח מאוחר יותר\" המובנית של Thunderbird (כלומר, העתקה לתיבת דואר יוצא).\n\nלפרטים נוספים, עיין ב<a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">מדריך למשתמש</a>. \n\nהצטרף ל<a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">רשימת התפוצה</a>! \n\nSend Later משתמש ב- <a href=\"https://sugarjs.com/\" rel=\"nofollow\"> SugarJS</a> מאת אנדרו פלאמר. תודה, אנדרו!",
        "pt-PT": "Mudanças no comando (Ctrl+Shift+Return) \"Send Latter\"na janela de composição da mensagem. Invés de meramente copiar a mensagem para a caixa de entrada da próxima vez que entrar online ou fazer \"sent Unsent Messages\" uma caixa de dialogo aparece e que lhe irá permitir qual a mensagem que será enviada.\n\nPode especificar uma hora e uma data, ou escolher \"15min mais tarde\", \"30min lmais tarde\" or \"2h mais tarde\", ou clique em \"Put in Outbox\" para obter a funcionalidade do Thunderbird \"Send later\" (ex: copiar para a Outbox).\n\nPara mais informação veja  <a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">user guide</a>.\n\nJunte-se em  <a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">mailing list</a>!\n\n\"Send Later\" usa <a href=\"https://sugarjs.com/\" rel=\"nofollow\">SugarJS</a> by Andrew Plummer. Thanks Andrew!",
        "zh-TW": "在訊息編寫視窗更改“send later”命令（Ctrl + Shift + Return），這樣不單將該訊息複製到發件文件匣中，在上線時或“發送未發送消息”時發送消息，並會彈出一個對話框，允許您指定訊息何時發送。\n\n您可以指定一個特定的時間和日期，或者點擊“15分鐘後”，“30分鐘後”或“2小時後”，或者點擊“放入發件箱”，使用Thunderbird內置的“稍後發送”功能 （即複製到發件文件匣）。\n\n有關其他信息，請參閱<a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">用戶指南</a>。\n\n加入<a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">郵寄名單</a>！\n\nSend Later使用Andrew Plummer的<a href=\"https://sugarjs.com/\" rel=\"nofollow\"> SugarJS </a>。 謝謝Andrew！",
        "zh-CN": "在訊息編寫視窗更改“send later”命令（Ctrl + Shift + Return），這樣不單將該訊息複製到發件文件匣中，在上線時或“發送未發送消息”時發送消息，並會彈出一個對話框，允許您指定訊息何時發送。\n\n您可以指定一個特定的時間和日期，或者點擊“15分鐘後”，“30分鐘後”或“2小時後”，或者點擊“放入發件箱”，使用Thunderbird內置的“稍後發送”功能 （即複製到發件文件匣）。\n\n有關其他信息，請參閱<a href=\"https://blog.kamens.us/send-later\" rel=\"nofollow\">用戶指南</a>。\n\n加入<a href=\"https://groups.google.com/group/send-later-users\" rel=\"nofollow\">郵寄名單</a>！\n\nSend Later使用Andrew Plummer的<a href=\"https://sugarjs.com/\" rel=\"nofollow\"> SugarJS </a>。 謝謝Andrew！"
    },
    "developer_comments": {
        "el": "Παρακαλώ <a href=\"mailto:jik+sendlater3@kamens.us\"> στείλτε μου μήνυμα μέσω του ηλεκτρονικού ταχυδρομείου </a> αναφορές σφαλμάτων, εισηγήσεις, κλπ.",
        "ca": "Si us plau <a href=\"mailto:jik+sendlater3@kamens.us\">envia'm un correu</a> si trobes qualsevol problema, tens alguna suggerència, etc.",
        "it": "Ti prego di <a href=\"mailto:jik+sendlater3@kamens.us\">inviarmi via email</a> segnalazioni di bug, consigli, ecc.",
        "fi": "Ole hyvä ja <a href=\"mailto:jik+sendlater3@kamens.us\">lähetä minulle sähköpostia</a> virheistä, ehdotuksista jne.",
        "cs": "Prosím <a href=\"mailto:jik+sendlater3@kamens.us\">pošlete mi</a> hlášení o chybách, návrhy na vylepšení atd.",
        "sv-SE": "Vänligen <a href=\"mailto:jik+sendlater3@kamens.us\"> maila mig</a> felrapporter, förslag, etc.",
        "es": "<a href=\"mailto:jik+sendlater3@kamens.us\">Envíeme un correo</a> con problemas (bugs) o sugerencias... (preferiblemente en inglés).",
        "ru": "Пожалуйста, <a href=\"mailto:jik+sendlater3@kamens.us\">пишите мне</a> о возникших ошибках, предложениях и т.д.",
        "nl": "Bugrapporten, suggesties etc. zijn welkom <a href=\"mailto:jik+sendlater3@kamens.us\">via e-mail</a>.",
        "en-US": "Please <a href=\"mailto:jik+sendlater3@kamens.us\">email me</a> bug reports, suggestions, etc.",
        "ro": "Raportează erori sau trimite sugestii prin <a href=\"mailto:jik+sendlater3@kamens.us\">email</a>.",
        "pl": "Proszę <a href=\"mailto:jik+sendlater3@kamens.us\">przyślij mi</a> informację o błędach, swoje sugestie, itp.",
        "fr": "N'hésitez pas à <a href=\"mailto:jik+sendlater3@kamens.us\">m'envoyer</a> des rapports de bug, suggestions, etc.",
        "bg": "Моля, <a href=\"mailto:jik+sendlater3@kamens.us\">пишете ми</a> за възникнали грешки, предложения и др.",
        "de": "Bitte schreiben Sie mir für Fehlerberichte, Vorschläge und Ähnliches eine <a href=\"mailto:jik+sendlater3@kamens.us\">E-Mail</a>.",
        "hu": "Kérem, <a href=\"mailto:jik+sendlater3@kamens.us\">írjon nekem</a> hibajelentéseket, javaslatokat stb.",
        "pt-BR": "Envie-me por e-mail, relatórios de bugs, sugestões, etc, para <a href=\"mailto:jik+sendlater3@kamens.us\">jik+sendlater3@kamens.us</a>.",
        "nb-NO": "Vennligst <a href=\"mailto:jik+sendlater3@kamens.us\"> email meg </a> feilrapporter, forslag, etc.",
        "ja": "バグ報告や提案は<a href=\"mailto:jik+sendlater3@kamens.us\">こちらまで</a>ご連絡ください。",
        "he": "נא <a href=\"mailto:jik+sendlater3@kamens.us\">לשלוח לי</a> דיווחים על באגים, הצעות וכל דבר אחר.",
        "pt-PT": "Envie-me por <a href=\"mailto:jik+sendlater3@kamens.us\">email</a>, relatórios de bugs, sugestões, etc.",
        "zh-TW": "請給我發送<a href=\"mailto:jik+sendlater3@kamens.us\">電子郵件</a> ，提供錯誤報告及建議等。",
        "zh-CN": "請給我發送<a href=\"mailto:jik+sendlater3@kamens.us\">電子郵件</a> ，提供錯誤報告及建議等。"
    },
    "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/send-later-3/edit",
    "guid": "sendlater3@kamens.us",
    "has_eula": false,
    "has_privacy_policy": false,
    "homepage": {
        "el": "http://blog.kamens.us/send-later",
        "ca": "http://blog.kamens.us/send-later",
        "it": "http://blog.kamens.us/send-later",
        "fi": "http://blog.kamens.us/send-later",
        "cs": "http://blog.kamens.us/send-later",
        "sv-SE": "http://blog.kamens.us/send-later-3",
        "es": "http://blog.kamens.us/send-later",
        "ru": "http://blog.kamens.us/send-later",
        "nl": "http://blog.kamens.us/send-later",
        "en-US": "http://blog.kamens.us/send-later",
        "ro": "http://blog.kamens.us/send-later",
        "pl": "http://blog.kamens.us/send-later",
        "fr": "http://blog.kamens.us/send-later",
        "bg": "http://blog.kamens.us/send-later",
        "de": "http://blog.kamens.us/send-later",
        "hu": "http://blog.kamens.us/send-later",
        "pt-BR": "http://blog.kamens.us/send-later",
        "nb-NO": "http://blog.kamens.us/send-later",
        "ja": "http://blog.kamens.us/send-later",
        "he": "http://blog.kamens.us/send-later-3",
        "pt-PT": "http://blog.kamens.us/send-later",
        "zh-TW": "http://blog.kamens.us/send-later",
        "zh-CN": "http://blog.kamens.us/send-later"
    },
    "icon_url": "https://addons.thunderbird.net/user-media/addon_icons/195/195275-64.png?modified=1595252033",
    "icons": {
        "32": "https://addons.thunderbird.net/user-media/addon_icons/195/195275-32.png?modified=1595252033",
        "64": "https://addons.thunderbird.net/user-media/addon_icons/195/195275-64.png?modified=1595252033"
    },
    "is_disabled": false,
    "is_experimental": false,
    "is_featured": false,
    "is_source_public": true,
    "last_updated": "2020-05-28T13:46:56Z",
    "name": {
        "el": "Στείλετε αργότερα",
        "ca": "Enviar més tard",
        "it": "Invia Dopo",
        "fi": "Lähetä Myöhemmin",
        "cs": "Odeslat později",
        "sv-SE": "Skicka Senare",
        "es": "Enviar Más Tarde",
        "ru": "Send Later",
        "nl": "Send Later",
        "en-US": "Send Later",
        "ro": "Send Later",
        "pl": "Wyślij Później",
        "fr": "Envoyer Plus Tard",
        "bg": "Изпращане по-късно",
        "de": "Später Senden",
        "hu": "Küldés később",
        "pt-BR": "Enviar mais tarde",
        "nb-NO": "Send senere",
        "ja": "後で送信",
        "he": "שלח מאוחר יותר",
        "pt-PT": "Enviar mais tarde",
        "zh-TW": "延期發信",
        "zh-CN": "以后发送"
    },
    "previews": [
        {
            "id": 79000,
            "caption": {
                "en-US": "Send Later prompt window",
                "hu": ""
            },
            "image_size": [
                486,
                292
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/79/79000.png?modified=1564582160",
            "thumbnail_size": [
                320,
                192
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/79/79000.png?modified=1564582160"
        },
        {
            "id": 79002,
            "caption": {
                "en-US": "Send Later preferences window",
                "hu": ""
            },
            "image_size": [
                580,
                403
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/79/79002.png?modified=1564582160",
            "thumbnail_size": [
                288,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/79/79002.png?modified=1564582160"
        },
        {
            "id": 79004,
            "caption": {
                "en-US": "Send Later compose toolbar items",
                "hu": ""
            },
            "image_size": [
                428,
                412
            ],
            "image_url": "https://addons.thunderbird.net/user-media/previews/full/79/79004.png?modified=1564582160",
            "thumbnail_size": [
                208,
                200
            ],
            "thumbnail_url": "https://addons.thunderbird.net/user-media/previews/thumbs/79/79004.png?modified=1564582160"
        }
    ],
    "public_stats": true,
    "ratings": {
        "bayesian_average": 4.73917,
        "count": 178,
        "average": 4.7472,
        "text_count": 178
    },
    "ratings_url": "https://addons.thunderbird.net/en-US/thunderbird/addon/send-later-3/reviews/",
    "requires_payment": false,
    "review_url": "https://addons.thunderbird.net/en-US/reviewers/review/195275",
    "slug": "send-later-3",
    "status": "public",
    "summary": {
        "el": "Πραγματική «Στείλετε αργότερα» λειτουργικότητα για να προγραμματίσετε την ώρα για την αποστολή μηνύματοςμέσω ηλεκτρονικού ταχυδρομείου.",
        "ca": "“Enviar més tard” és la funció per programar quan vols fer l'enviament.",
        "it": "Una vera funzione di “Invia dopo” per pianificare quando inviare le e-mail.",
        "fi": "“Lähetä myöhemmin” toiminnallisuus lähetyksien ajastamiseksi",
        "cs": "„Odeslat později“ umožňuje naplánovat čas pro pozdější odeslání emailu.",
        "sv-SE": "“Skicka senare”-funktion som låter användaren schemalägga tidpunkten för sändning av ett e-brev.",
        "es": "La verdadera funcionalidad de \"Enviar Después\" para programar el envío de tus emails.",
        "ru": "“Send Later” - планировщик времени отправки сообщений электронной почты.",
        "nl": "Echte functionaliteit voor ‘Later verzenden’ om het verzendtijdstip van een e-mailbericht te plannen.",
        "en-US": "True \"Send Later\" functionality to schedule the time for sending an email.",
        "ro": "Funcționalitate completă \"Trimite mai târziu\" pentru a programa trimiterea unui email.",
        "pl": "Rozszerzenie \"Wyślij później\" pozwala na wysyłanie wiadomości o ustalonym wcześniej czasie.",
        "fr": "Fonction d'envoi de courrier différé permettant de programmer l'heure d'envoi d'un courriel.",
        "bg": "Истинска \"Изпращане по-късно\" функционалност за планиране на времето за изпращане на електронни съобщения.",
        "de": "Eine echte \"SendeSpäter\" Funktionalität zur Planung der Sendezeit von Emails.",
        "hu": "Teljes küldemény „Küldés később” az e-mail küldésének ütemezéséhez.",
        "pt-BR": "\"Enviar mais tarde\" agenda o dia e hora que deseja que o e-mail seja enviado.",
        "nb-NO": "Sann \"Send senere\" -funksjonalitet for å planlegge tiden for å sende en e-post.",
        "ja": "指定した時間にメールを送信する機能を提供します。",
        "he": "‫'שלח מאוחר יותר' משמש לשליחת הודעות במועד עתידי‬",
        "pt-PT": "Funcionalidade do “Enviar mais tarde” para marcar a hora de envio",
        "zh-TW": "用來預定傳送信件的時間寄信",
        "zh-CN": "以后发送用来预定发送消息的时间并延期发送"
    },
    "support_email": {
        "en-US": "jik+sendlater3@kamens.us"
    },
    "support_url": {
        "en-US": "http://blog.kamens.us/send-later"
    },
    "tags": [
        "firefox57",
        "message composing",
        "send later"
    ],
    "type": "extension",
    "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/send-later-3/",
    "weekly_downloads": 2002,
    "xpilib": {
        "ext_comp": {
            "mext": true,
            "comp68": true,
            "comp69plus": true,
            "comp61plus": true,
            "comp60pv": true,
            "comp60pv_date": "2017-12-14T19:57:28Z"
        }
    }
}