{
    "id": 986325,
    "authors": [
        {
            "id": 14156264,
            "name": "Beonex",
            "url": "https://addons.thunderbird.net/en-US/thunderbird/user/owl-beonex/",
            "username": "owl-beonex",
            "picture_url": null
        }
    ],
    "average_daily_users": 33456,
    "categories": {
        "thunderbird": [
            "composition",
            "message-and-news-reading"
        ],
        "android": [
            "other"
        ],
        "firefox": [
            "other"
        ]
    },
    "contributions_url": "",
    "created": "2018-10-20T01:02:38Z",
    "current_version": {
        "id": 2473912,
        "compatibility": {
            "thunderbird": {
                "max": "78.*",
                "min": "68.8.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/owl-for-exchange/versions/2473912",
        "files": [
            {
                "id": 1017074,
                "created": "2020-07-10T21:32:02Z",
                "hash": "sha256:7461cb9fa920aade75b6fefc094578598e6541657f8e7bbbbf9f1906453660e1",
                "is_restart_required": false,
                "is_webextension": true,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 255552,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/1017074/eule_fur_exchange-0.7.6-tb.xpi?src=",
                "permissions": [
                    "addressBooks",
                    "cookies",
                    "storage",
                    "tabs",
                    "webNavigation",
                    "webRequest",
                    "webRequestBlocking",
                    "https://*/*"
                ]
            }
        ],
        "is_strict_compatibility_enabled": false,
        "license": {
            "id": 7057,
            "name": {
                "en-US": "All Rights Reserved"
            },
            "url": null
        },
        "release_notes": null,
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/owl-for-exchange/versions/0.7.6",
        "version": "0.7.6"
    },
    "default_locale": "en-US",
    "description": {
        "ru": "Сова позволяет вам использовать учетную запись Exchange, поддерживающую Outlook Web Access (OWA), через Thunderbird. После настройки вы сможете увидеть свою учётную запись прямо в Thunderbird. Вы сможете писать и читать электронные письма, используя свой аккаунт Exchange.\n\nЭто платное дополнение, стоимость которого составляет 10€. Первый месяц пользования – бесплатный, поэтому вы всегда можете скачать и оценить приложение самостоятельно.\n\nРазработчики данного дополнения участвовали в разработке Thunderbird как Open Source, и они активно работали с Thunderbird и его предшественником в течение последних двадцати лет. Данное дополнение – это способ заработать на жизнь.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>",
        "fr": "Chouette vous permet d'utiliser vos adresses mail Exchange qui utilisent Outlook Web Access (OWA) avec Thunderbird. Après l'installation, votre compte devrait apparaître dans Thunderbird, tout comme les autres comptes. Vous pouvez désormais lire et écrire vos e-mails avec votre adresse mail Exchange.\n\nCette extension est payante. Elle coûte 10 EUR/an. Le premier mois est gratuit, pour que vous puissiez tester l'extension et voir si vous l'appréciez.\n\nLes développeurs de cette extension ont contribué à Thunderbird en tant qu'Open Source. Ils sont actifs autour de Thunderbird et ses prédécesseurs depuis de nombreuses années, en partie depuis presque 20 ans. Mais Chouette doit aussi gagner sa vie.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>",
        "de": "Ermöglicht Ihnen, Ihre Emails auf Exchange-Servern mit Outlook Web Access (OWA) über Thunderbird abzurufen. Nach dem Einrichten sollte Ihr Konto wie alle anderen Email-Konten in Thunderbird angezeigt werden. Sie können Ihre Emails lesen und schreiben.\n\nDies ist ein kostenpflichtiges Addon. Es kostet 10 Eur/Jahr. Der erste Monat ist kostenlos, damit Sie es testen können, ob es Ihnen gefällt.\n\nDie Entwickler dieses Addons haben etliche Teile von Thunderbird als Open-Source beigetragen, und sind seit vielen Jahren bei Thunderbird und seinem Vorgänger aktiv, teils seit fast 20 Jahren. Dies ist ein Versuch, den Lebensunterhalt zu verdienen.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>",
        "nl": "Maakt het mogelijk om Exchange e-mailaccounts die gebruik maken van Outlook Web Access (OWA) te gebruiken met Thunderbird. Na het installeren, zou uw account moeten verschijnen in Thunderbird zoals de andere accounts. U kunt emails lezen en schrijven met uw Exchange account.\n\nDit is een betaalde addon. Het kost 10 EUR/jaar. De eerste maand is gratis, zo kunt u proberen of het iets voor u is.\n\nDe ontwikkelaars van deze addon hebben bijgedragen aan onderdelen van Thunderbird als Open Source, en zij zijn sinds vele jaren actief rondom Thunderbird en zijn voorgangers, in gedeelten al bijna 20 jaar. Dit is een poging om de kost te verdienen.",
        "pt-PT": "A Coruja permite o uso das suas contas de e-mail Exchange que utilizam o Outlook Web Access (OWA) com o Thunderbird. Depois da configuração, a sua conta deve aparecer no Thunderbird como quaisquer outras contas de e-mail. Você pode ler e escrever e-mails com a sua conta Exchange.\n\nEsta é uma extensão paga. Ela custa 10 euros ao ano. O primeiro mês é gratuito para testar e ver se gostou da extensão.\n\nOs desenvolvedores dessa extensão contribuiram muito ao Thunderbird como Open Source, e eles são ativos na comunidade do Thunderbird e de seus antecessores há anos, mais especificamente há 20 anos. Esta é uma tentativa de ganhar a nossa vida.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>",
        "en-US": "Allows you to use your Exchange email accounts that use Outlook Web Access (OWA) with Thunderbird. After setup, your account should appear in Thunderbird just like the other accounts. You can read and write emails with your Exchange account.\n\nThis is a paid addon. It costs 10 EUR/year. The first month is free, so that you can test it and see whether you like it.\n\nThe developers of this addon have contributed many parts to Thunderbird as Open Source, and they are active around Thunderbird and its predecessor since many years, in part since almost 20 years. This is an attempt to earn a living.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>",
        "it": "Gufo ti permette di usare il tuo account email di Exchange che usa Outlook Web Access (OWA) con Thunderbird. Dopo averlo impostato, il tuo account apparirà su Thunderbird come ogni altro account. Potrai leggere e scrivere email con il tuo account Exchange.\n\nÈ un componente aggiuntivo a pagamento. Costa 10€ all’anno. Il primo mese è gratis, così potrai testarlo e vedere se ti è utile.\n\nGli sviluppatori di questo componente hanno contribuito in molti modi a Thundrbird come volontari Open Source e sono attivi su Thunderbird e il suo predecessore da tanti anni, alcuni da quasi 20 anni. È un modo per guadagnarsi da vivere.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>",
        "hu": "A Bagoly lehetővé teszi, hogy az Outlook Web Access (az Outlook webes hozzáférése, OWA) Exchange-fiókok használhatók legyenek a Thunderbird szolgáltatással. A telepítés után a fiókja a Thunderbirdben jelenik meg, mint a többi fiók. E-maileket olvashat és írhat az Exchange-fiókjával.\n\nEz egy fizetett kiegészítő. 10 euró évente költséget jelent. Az első hónap ingyenes, így tesztelheti és megnézheti, hogy tetszik-e.\n\nEnnek a bővítménynek a fejlesztőinek számos része nyílt forráskódként hozzájárult a Thunderbirdhez, és sok éve aktívak a Thunderbird és elődei körében, részben közel 20 éve.\n\n<a href=\"https://www.beonex.com/owl/?lang=hu\" rel=\"nofollow\">https://www.beonex.com/owl/?lang=hu</a>",
        "pt-BR": "A Coruja permite o uso das suas contas de e-mail Exchange que utilizam o Outlook Web Access (OWA) com o Thunderbird. Depois da configuração, a sua conta deve aparecer no Thunderbird como quaisquer outras contas de e-mail. Você pode ler e escrever e-mails com a sua conta Exchange.\n\nEsta é uma extensão paga. Ela custa 10 euros ao ano. O primeiro mês é gratuito para testar e ver se gostou da extensão.\n\nOs desenvolvedores dessa extensão contribuiram muito ao Thunderbird como Open Source, e eles são ativos na comunidade do Thunderbird e de seus antecessores há anos, mais especificamente há 20 anos. Esta é uma tentativa de ganhar a nossa vida.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>",
        "pl": "Sowa z poziomu Thunderbirda daje możliwość używania twoich kont e-mail w programie Exchange Server, które korzystają z Outlook Web Access (OWA). Po instalacji Twoje konto powinno pojawić się w Thunderbirdzie, podobnie jak inne konta. Możesz odbierać i wysyłać e-maile z konta Exchange.\n\nJest to płatny program, który kosztuje 10 EUR/rok. Pierwszy miesiąc jest darmowy, żeby przetestować program i upewnić się, że jest dla Ciebie odpowiedni.\n\nAutorzy tego programu opracowali wiele elementów Thunderbirda jako deweloperzy Open Source, pracują oni w otoczeniu Thunderbirda i jego poprzedników od wielu lat, przy niektórych elementach nawet od 20 lat. Chcemy symbolicznie zarobić w oparciu o naszą wiedzę i doświadczenie.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>",
        "ja": "フクロウは、Outlook Web Access (OWA) を使用するExchangeメールアカウントでThunderbirdも併用できるようにするものです。設定後、あなたのアカウントはThunderbirdに他のアカウントと同様に表示されます。 Exchangeアカウント上ではメールを読んだり書いたりすることができます。\n\nこれは有料のアドオンです。料金は年間10€です。最初の月の使用料は無料ですので、このプログラムに満足いただけるかどうかお試し期間として使用していただくことができます。\n\nこのアドオンの開発者はThunderbirdプログラムに関し、数多くの部分でオープンソースとして貢献しており、Thunderbird及びその前身に関して現役で何年もの間、人によっては20年近くも活動し続けています。そのため、フクロウは私たちがこれで生計を立てようという試みなのです。",
        "es": "Aluco le permite usar sus cuentas de correo electrónico de Exchange que usan Outlook Web Access (OWA) con Thunderbird. Después de la configuración, su cuenta debería aparecer en Thunderbird al igual que las otras cuentas. Puede leer y escribir correos electrónicos con su cuenta de Exchange.\n\nEste es un complemento pagado. Cuesta 10 EUR / año. El primer mes es gratis, para que pueda probarlo sin compromiso y ver si le gusta.\n\nLos desarrolladores de este complemento han contribuido en muchas partes en Thunderbird como Open Source y llevan activos alrededor de Thunderbird y su predecesor muchos años,  hace casi 20 años. Este es un intento de ganarse la vida.\n\n<a href=\"https://www.beonex.com/owl/\" rel=\"nofollow\">https://www.beonex.com/owl/</a>"
    },
    "developer_comments": null,
    "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/owl-for-exchange/edit",
    "guid": "owl@beonex.com",
    "has_eula": true,
    "has_privacy_policy": true,
    "homepage": {
        "ru": "https://www.beonex.com/owl/",
        "fr": "https://www.beonex.com/owl/",
        "de": "https://www.beonex.com/owl/",
        "nl": "https://www.beonex.com/owl/",
        "pt-PT": "https://www.beonex.com/owl/",
        "en-US": "https://www.beonex.com/owl/",
        "it": "https://www.beonex.com/owl/",
        "hu": "https://www.beonex.com/owl/",
        "pt-BR": "https://www.beonex.com/owl/",
        "pl": "https://www.beonex.com/owl/",
        "ja": "https://www.beonex.com/owl/",
        "es": "https://www.beonex.com/owl/"
    },
    "icon_url": "https://addons.thunderbird.net/user-media/addon_icons/986/986325-64.png?modified=61143e90",
    "icons": {
        "32": "https://addons.thunderbird.net/user-media/addon_icons/986/986325-32.png?modified=61143e90",
        "64": "https://addons.thunderbird.net/user-media/addon_icons/986/986325-64.png?modified=61143e90"
    },
    "is_disabled": false,
    "is_experimental": false,
    "is_featured": false,
    "is_source_public": false,
    "last_updated": "2020-07-10T21:39:12Z",
    "name": {
        "ru": "Сова для Exchange",
        "fr": "Chouette pour Exchange",
        "de": "Eule für Exchange",
        "nl": "Uil voor Exchange",
        "pt-PT": "Coruja para Exchange",
        "en-US": "Owl for Exchange",
        "it": "Gufo per Exchange",
        "hu": "Bagoly az Exchange számára",
        "pt-BR": "Coruja para Exchange",
        "pl": "Sowa dla Exchange",
        "ja": "Exchange用のフクロウ",
        "es": "Aluco de Exchange"
    },
    "previews": [],
    "public_stats": false,
    "ratings": {
        "bayesian_average": 4.38719,
        "count": 56,
        "average": 4.4107,
        "text_count": 56
    },
    "ratings_url": "https://addons.thunderbird.net/en-US/thunderbird/addon/owl-for-exchange/reviews/",
    "requires_payment": true,
    "review_url": "https://addons.thunderbird.net/en-US/reviewers/review/986325",
    "slug": "owl-for-exchange",
    "status": "public",
    "summary": {
        "ru": "Сова позволяет объединить Thunderbird с почтовыми серверами Exchange",
        "fr": "Chouette connecte Thunderbird aux serveurs e-mails d'Exchange.",
        "de": "Eule verbindet Thunderbird mit Ihrem Exchange-Konto",
        "nl": "Uil verbindt Thunderbird met uw Exchange e-mailaccount",
        "pt-PT": "Coruja conecta o Thunderbird aos servidores de e-mail Exchange",
        "en-US": "Allows you to use your Exchange email accounts that use Outlook Web Access (OWA) with Thunderbird",
        "it": "Gufo connette Thunderbird al server delle email di Exchange.",
        "hu": "A Bagoly összeköti a Thunderbirdet az Exchange e-mail kiszolgálókkal",
        "pt-BR": "Coruja conecta o Thunderbird aos servidores de e-mail Exchange",
        "pl": "Sowa łączy Thunderbird z programem Exchange Server",
        "ja": "フクロウはThunderbirdとExchangeメールサーバーを接続します。",
        "es": "Aluco conecta Thunderbird a los servidores de correo electrónico de Exchange."
    },
    "support_email": {
        "en-US": "owl.support@beonex.com"
    },
    "support_url": null,
    "tags": [
        "exchange",
        "firefox57"
    ],
    "type": "extension",
    "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/owl-for-exchange/",
    "weekly_downloads": 0,
    "xpilib": {
        "ext_comp": {
            "mext": true,
            "comp68": true,
            "comp69plus": true,
            "comp78plus": true,
            "comp61plus": true,
            "comp60pv": true,
            "comp60pv_date": "2019-02-13T16:36:13Z"
        }
    }
}