[
    {
        "id": 87052,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "56.*",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.1a1pre",
                "min": "1.0a"
            },
            "thunderbird": {
                "max": "3.2a1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/87052",
        "files": [
            {
                "id": 72198,
                "created": "2009-12-08T21:52:06Z",
                "hash": "sha256:def71d0cf829deaabd6eecc5dbf61ac578b5497a957b813d24473d944fa9204e",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 323584,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/72198/mr_tech_toolkit-6.0.4-fx+tb+sb+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "6.0.4 Released\n    *  Added: Plug-ins Now include reported version number Firefox 3.5 (might work with 3.0 though)   \n    *  Added: Initial support for Seamonkey 2.0 - manually re-enable Tools|Extension Options and Theme Switcher if they're not showing up\n    *  Added: Now supporting generic Gecko Toolkit version 1.9 should future proof for newer apps\n    *  Added: Codebase now detects and supports Postbox 1.0 and 1.1\n    *  Updated: Now sorting About Plug-ins list\n    *  Updated: JA locale updated, thanks Orro.\n    *  Updated: extensions.checkCompatibility updates for latest 3.6 branch and trunk builds\n    *  Updated: Total cleanup of legacy global namespace pollution\n    *  Updated: Addtional support for more nightlies brand names in a few spots\n    *  Fixed: Patched leakiness and startup sequencing in Extensions window\n    *  Fixed: Properly checking for Extensions and Themes filename extensions, allows archiving from AMO and other paths with querystring variables, etc. (must still have a file extension of either xpi or jar though)\n    *  Fixed: Now really supporting Sunbird 1.0pre/beta builds, main xul window location, etc\n    *  Fixed: About Plug-ins broken with Firefox Nightlies\n    *  Fixed: Title functionality now includes (Private Browsing) labeling when applicable\n    *  Fixed: 'Get More Extensions' linnks were not resolving due to changes in 3.7 codebase"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.4",
        "version": "6.0.4"
    },
    {
        "id": 72102,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.7a1pre",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.0b1",
                "min": "1.5a"
            },
            "thunderbird": {
                "max": "3.1a1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/72102",
        "files": [
            {
                "id": 57368,
                "created": "2009-07-02T07:53:54Z",
                "hash": "sha256:b23842f4aeead8352436bd7a1bd34ef7437925e61640384d6922155822f04708",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 319488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/57368/mr_tech_toolkit-6.0.3.4-fx+tb+sm+sb+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": {
            "id": 5,
            "name": {
                "el": "Mozilla Public License, έκδοση 1.1",
                "vi": "Giấy phép Công cộng Mozilla, phiên bản 1.1",
                "ca": "Llicència MPL (Mozilla Public License), versió 1.1",
                "it": "Licenza Mozilla Public License, versione 1.1",
                "cs": "Mozilla Public License, verze 1.1",
                "eu": "Mozilla Public License, 1.1 bertsioa",
                "id": "Mozilla Public License, versi 1.1",
                "es": "Licencia pública Mozilla, versión 1.1",
                "ru": "Mozilla Public License, версия 1.1",
                "nl": "Mozilla Public License, versie 1.1",
                "en-US": "Mozilla Public License Version 1.1",
                "pl": "Mozilla Public License, wersja 1.1",
                "fr": "Mozilla Public License Version 1.1",
                "bg": "Mozilla Публичен лиценз, версия 1.1",
                "de": "Mozilla Public License Version 1.1",
                "fa": "مجوز عمومی موزیلا، نسخهٔ ۱٫۱",
                "pt-BR": "Licença personalizada",
                "ja": "Mozilla Public License バージョン 1.1",
                "pt-PT": "Mozilla Public License, versão 1.1",
                "sr": "Мозилина јава лиценца, верзија 1.1",
                "sq": "Leje Publike Mozilla, version 1.1",
                "ko": "GPL/LGPL/MPL",
                "ga-IE": "Ceadúnas Poiblí Mozilla, leagan 1.1",
                "sk": "Mozilla Public License, verzia 1.1",
                "zh-CN": "Mozilla 公共许可协议，版本 1.1",
                "zh-TW": "Mozilla Public License，版本 1.1"
            },
            "text": {
                "pt-BR": "- You are allowed to use this Firefox Extension in unmodified form free of charge.\n- You may not modify it, re-distribute it or create derivative works containing this Extension or parts of it.\n- You are not allowed to use any parts of the Source code of this extension in other works.\n- This product is provided as-is without any warranties.",
                "en-US": "Copyright Buffer",
                "de": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\nSection 1 – Definitions.\n\n    Adapted Material means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n    Copyright and Similar Rights means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n    Effective Technological Measures means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n    Exceptions and Limitations means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n    Licensed Material means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n    Licensed Rights means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n    Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n    NonCommercial means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n    Share means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n    Sui Generis Database Rights means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n    You means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\nSection 2 – Scope.\n\n    License grant.\n        Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n            reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n            produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n        Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n        Term. The term of this Public License is specified in Section 6(a).\n        Media and formats; technical modifications allowed. The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n        Downstream recipients.\n            Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n            No downstream restrictions. You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n        No endorsement. Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\n    Other rights.\n        Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n        Patent and trademark rights are not licensed under this Public License.\n        To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\nSection 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\n    Attribution.\n\n        If You Share the Licensed Material, You must:\n            retain the following if it is supplied by the Licensor with the Licensed Material:\n                identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n                a copyright notice;\n                a notice that refers to this Public License;\n                a notice that refers to the disclaimer of warranties;\n                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n            indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n            indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n        For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n        You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n        If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\nSection 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\n    for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n    if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n    You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\nSection 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.\n    To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.\n\n    The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\nSection 6 – Term and Termination.\n\n    This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\n    Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n        automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n        upon express reinstatement by the Licensor.\n    For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n    For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n    Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\nSection 7 – Other Terms and Conditions.\n\n    The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n    Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\nSection 8 – Interpretation.\n\n    For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n    To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n    No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n    Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.",
                "ko": "이 확장은 3중 라이센스(GPL/LGPL/MPL)로 배포됩니다.\n- GPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/50f8213a635c55938b7d1800bca643361d3bf829794eec93a1147307a4cd596f/http%3A//www.gnu.org/licenses/gpl-3.0.html\">http://www.gnu.org/licenses/gpl-3.0.html</a>\n- LGPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/bda48979b4b7627c8af5d5cbe582e398a67786520fd8db4c2d25d11b31bd1e55/http%3A//www.gnu.org/licenses/lgpl-3.0.html\">http://www.gnu.org/licenses/lgpl-3.0.html</a>\n- MPL : <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f3c3e05134c74e7b840c6791fff96b27c89f15a62369e43a0fda8ffdbf9afd6e/https%3A//www.mozilla.org/en-US/MPL/2.0/\">https://www.mozilla.org/en-US/MPL/2.0/</a>",
                "fr": "Free for non-commercial personal use. Copyright of all graphics elemets designed for  this theme belongs to the author. Before any modifications and/or distribution of this work, please contact it and read the license file included inside the theme package."
            },
            "url": "http://www.mozilla.org/MPL/MPL-1.1.html"
        },
        "release_notes": {
            "en-US": "Bumping max versions"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.3.4",
        "version": "6.0.3.4"
    },
    {
        "id": 62616,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.6a1pre",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.0b1",
                "min": "1.5a"
            },
            "thunderbird": {
                "max": "3.1a1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/62616",
        "files": [
            {
                "id": 46913,
                "created": "2009-02-13T14:19:12Z",
                "hash": "sha256:9521957e84daa1cf9db17d0ec1bff21bfb42ba268c4be13bf7571170e67d24c9",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 319488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/46913/mr_tech_toolkit-6.0.3.3-fx+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Minor version bump"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.3.3",
        "version": "6.0.3.3"
    },
    {
        "id": 61987,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.1b3pre",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.0a3",
                "min": "1.5a"
            },
            "thunderbird": {
                "max": "3.1a1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/61987",
        "files": [
            {
                "id": 46244,
                "created": "2009-02-04T09:04:36Z",
                "hash": "sha256:4599a4727e9cd7bb0f96f2534fe738655911d4ad29cdd656da1fa87d82794ccc",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 319488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/46244/mr_tech_toolkit-6.0.3.2-fx+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Minor clean up and version bumping."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.3.2",
        "version": "6.0.3.2"
    },
    {
        "id": 56627,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.1b2pre",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.0a2",
                "min": "1.5a"
            },
            "thunderbird": {
                "max": "3.0b1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/56627",
        "files": [
            {
                "id": 40487,
                "created": "2008-11-03T11:48:28Z",
                "hash": "sha256:31c5d7836f433343e7d18902ccd6cc380148d276ca2c864e8676bff1bd07a17b",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 319488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/40487/mr_tech_toolkit-6.0.3.1-fx+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "6.0.3.1 Released\n*  Updated: added vi-VN locale and updated the rest\n*  Updated: More legacy code cleanup\n*  Fixed: Shredder support has been resolved"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.3.1",
        "version": "6.0.3.1"
    },
    {
        "id": 56409,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.1b2pre",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.0a2",
                "min": "1.5a"
            },
            "thunderbird": {
                "max": "3.0b1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/56409",
        "files": [
            {
                "id": 40255,
                "created": "2008-10-30T07:26:11Z",
                "hash": "sha256:63415f39cf95cacc9e3b8e4e1eb8741049fefecffa6f70d74481ca41a2dbe126",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 319488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/40255/mr_tech_toolkit-6.0.3-fx+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "6.0.3 Released\n    *  Updated: Finally updated all locales and have updated Babelzilla\n    *  Fixed: Debug message was breaking Add-ons for Thunderbird and possibly other non-browser related applications\n    *  Fixed: Locales where missing a string"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.3",
        "version": "6.0.3"
    },
    {
        "id": 56364,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.1b2pre",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.0a2",
                "min": "1.5a"
            },
            "thunderbird": {
                "max": "3.0b1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/56364",
        "files": [
            {
                "id": 40204,
                "created": "2008-10-29T10:38:22Z",
                "hash": "sha256:79bd6c756e1c832fca7259af744fd4273521da81fa35133217ca0ad55f84a233",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 311296,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/40204/mr_tech_toolkit-6.0.2.1-fx+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "6.0.2.1 Released\n  *  Fixed: Throbber click fix was triggering link for all toolbar buttons"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.2.1",
        "version": "6.0.2.1"
    },
    {
        "id": 56359,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.1b2pre",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.0a2",
                "min": "1.5a"
            },
            "thunderbird": {
                "max": "3.0b1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/56359",
        "files": [
            {
                "id": 40199,
                "created": "2008-10-29T10:06:34Z",
                "hash": "sha256:803ae9f092b421682e88145d5c5a7d78ec12f74962beab88e7d893229c496eb3",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 311296,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/40199/mr_tech_toolkit__formerly_local_install_-6.0.2-fx+tb+sb+sm+fn.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Release Notes:\n*  Added: Initial support for Mozilla Fennec (Mobile Firefox)\n*  Updated: bumped supported versions\n*  Fixed: Middle-clicking Extension or Theme toolbar button will now leave Add-ons tab open\n*  Fixed: Throbber support for Firefox 3.1 has been restored\n*  Fixed: about:about in SeaMonkey now uses built-in version fixing bustage\n*  Fixed: Spelling error in add-ons window"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.2",
        "version": "6.0.2"
    },
    {
        "id": 47674,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.1b1pre",
                "min": "2.0"
            },
            "seamonkey": {
                "max": "2.0a1",
                "min": "1.5a"
            },
            "thunderbird": {
                "max": "3.0b1pre",
                "min": "2.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/47674",
        "files": [
            {
                "id": 31159,
                "created": "2008-06-18T20:50:45Z",
                "hash": "sha256:fa5aeedf96c4176a55624b24e568bf1178213544545eac2cc0999612f231c4e5",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 306176,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/31159/mr_tech_toolkit__formerly_local_install_-6.0.1-fx+tb+sb+sm.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "6.0.1 Released\n*  Added: Option to hide the new Firefox 3.0 \"Get Add-ons\" search pane\n*  Fixed: Disable My Config, Sort Button or Field Filter in Add-ons toolbar were not working\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.1",
        "version": "6.0.1"
    },
    {
        "id": 47350,
        "channel": "listed",
        "compatibility": {},
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/47350",
        "files": [
            {
                "id": 30831,
                "created": "2008-06-17T13:57:34Z",
                "hash": "sha256:d8e5128f39f6e5e540e7006b4000f349abea029d7bea47195aefc3e46b1b127b",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 304128,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/30831/mr_tech_toolkit__formerly_local_install_-6.0.0.1-.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Minor fix."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0.0.1",
        "version": "6.0.0.1"
    },
    {
        "id": 47337,
        "channel": "listed",
        "compatibility": {},
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/47337",
        "files": [
            {
                "id": 30818,
                "created": "2008-06-17T08:48:43Z",
                "hash": "sha256:2f5780726109ac313762071b89408eda332c5bb24fc964b5d6eb4a82e821a6f9",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 304128,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/30818/mr_tech_local_install-6.0-.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Tons of updates, fixes and ready for 3.0.  Locales are not fully translated but should be soon."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/6.0",
        "version": "6.0"
    },
    {
        "id": 36925,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a9",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "2.0a1",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/36925",
        "files": [
            {
                "id": 20233,
                "created": "2007-10-18T11:05:53Z",
                "hash": "sha256:74a1f8751bf97173745f16fdc06daaec8f34022af57085b285cc7c028b0e8658",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 304128,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/20233/mr_tech_local_install-5.3.2.6-fx+mz+tb+sb+nvu+ns+sm+fl.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "- Updated: the following icons have been refreshed with newer versions: options, clear private data, view my config, add-ons add button\n- Updated: bumped Firefox to 3.0a9 and Sunbird to 0.7\n- Fixed: slight issue with the \"Get More ...\" links in main Help menu which fixes things with Sunbird"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3.2.6",
        "version": "5.3.2.6"
    },
    {
        "id": 34463,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a7",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "2.0a1",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/34463",
        "files": [
            {
                "id": 17740,
                "created": "2007-07-20T08:59:21Z",
                "hash": "sha256:25f3865513ee7e0b55a8f3cbb50c58ace7959980e546c608e2180448f5000a2f",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 279552,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/17740/mr_tech_local_install-5.3.2.5-fx+mz+tb+sb+nvu+ns+sm+fl.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Note: this may be the last version to support: Firefox 1.0, Nvu, Mozilla Suite and Older Versions of Netscape, SeaMonkey and Flock.  Only newer releases will be support with the next major version.\n\n5.3.2.5 Released\n- Added: el-GR, fy-NL, sv-SE locales\n- Added: \"Titlebar Tweaks\" to the list of extension to check for and prompt to uninstall as their features are already included with Local Install.\n- Updated: All locales have been updated\n- Updated: ExtensionsMirror labels and links are now pointing to new Add-ons Mirror site.\n- Fixed: About window display by removing Translators\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3.2.5",
        "version": "5.3.2.5"
    },
    {
        "id": 34210,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a7",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "2.0a1",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/34210",
        "files": [
            {
                "id": 17484,
                "created": "2007-07-10T17:01:20Z",
                "hash": "sha256:27200803a62663644b5975931c07ca2460034a2f7f4ab3d15161086f6bd676c3",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 265216,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/17484/mr_tech_local_install-5.3.2.4-fx+mz+tb+sb+nvu+ns+sm+fl.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "Version support bumped up for Firefox, Sunbird, Netscape and SeaMonkey."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3.2.4",
        "version": "5.3.2.4"
    },
    {
        "id": 27952,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a2",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "1.5a",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/27952",
        "files": [
            {
                "id": 2087,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:61af3350c8e729528819a36937ae5c434a97b46ceac6f4f8782990251b690fe0",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 265216,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2087/mr_tech_local_install-5.3.2.3-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.3.2.3/4 Released\n- Updated: version number needed a little bump for SeaMonkey\n- Updated: Removed unused locale that snuck in last build\n- Fixed: Issue with My Config - Save Text\n- Fixed: Help button in Local Install options menu now works and loads Local Install homepage.\n- Fixed: Visit Homepage link in Add-ons about window would not load (long standing issue), thanks menet.\n\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3.2.3",
        "version": "5.3.2.3"
    },
    {
        "id": 27911,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a2",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "1.5a",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/27911",
        "files": [
            {
                "id": 2086,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:a71ccbff6e48ef64c8d6cdda908397c688a013531674a4dd613739f2e4b59d73",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 265216,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2086/mr_tech_local_install-5.3.2.2-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.3.2.2 Release Notes\n- Added: \"About Menu\" to the list of extension to check for and prompt to uninstall as their features are already included with Local Install.\n- Updated: Bumped minimum Firefox support to 3.0a2 and Sunbird to 0.4a1\n- Updated: All locales have been updated\n- Fixed: Blank entry in Themes list for SeaMonkey, thanks to Philip Chee for pointing out the fix"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3.2.2",
        "version": "5.3.2.2"
    },
    {
        "id": 26250,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "1.5a",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/26250",
        "files": [
            {
                "id": 2085,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:50a2897f02e58ee2dbda32908db7efc59a2c895a5b8d71cae5694d77eeda9b8e",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 265216,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2085/mr_tech_local_install-5.3.2.1-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.3.2.1 Released\n- Fixed: Fix for the fix, one word in one line can bring down the house of cards "
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3.2.1",
        "version": "5.3.2.1"
    },
    {
        "id": 23682,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "1.5a",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/23682",
        "files": [
            {
                "id": 2084,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:70ef69ebd5b7561707d2a45de7b2dee4f1024f6a7bbb97b6d84bcf496280b9e6",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 260096,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2084/mr_tech_local_install-5.3.1.1-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.3.1.1\n- Resolves translation issue with tr-TR"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3.1.1",
        "version": "5.3.1.1"
    },
    {
        "id": 23611,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "1.5a",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/23611",
        "files": [
            {
                "id": 2083,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:36f817bd48ac1e2711fc9522382bb64935d077bb25c5a401aacb608caf23a2c6",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 260096,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2083/mr_tech_local_install-5.3.1-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.3.1 Released\n- Added: \"Clear Private Data... (Add-Ons)\" and \"QuickRestart\" to the list of extension to check for and prompt to uninstall as their features are already included with Local Install.\n- Added: tr-TR locale and updated several locale translations have been updated\n- Fixed: Misspelled \"safegaurd\" in disable install delay prompt, fixed again.\n- Fixed: Issue in My Config if show guid option was enabled and you had disabled extensions or themes"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3.1",
        "version": "5.3.1"
    },
    {
        "id": 22916,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "1.5a",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/22916",
        "files": [
            {
                "id": 2082,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:fab5ce8fcfbf5cf4de420369f8c0010dacc421baa6f3b30bcbf8f2df32220af5",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 254976,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2082/mr_tech_local_install-5.3-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.3 Released\n# Added: In the settings dialog there are now two distinct paths that can be set for doing extension/theme local installs and for doing extension/theme archiving\n# Added: \"Edit My Config\" toolbar button now has a matching right-click context menu so you can disable the dropdown without losing the menu options.\n# Added: Theme Switcher is now in the Extensions/Themes Toolbar right-click context menu\n# Added: \"My Config\" window now has drag-n-drop support for installing extensions and themes\n# Added: fa-IT and pt-PT locale translations\n# Updated: Added support for new \"Calendar\" branded Sunbird nightly builds\n# Updated: Added logic for preference observer to detect main window versus Extension/Theme/Addons manager windows\n# Updated: All locale translations have been updated\n# Updated: Removed \"stock\" right-click menu options in Local Install toolbar icons\n# Fixed: Could not clear Archive/Install paths, pref would not save in options window\n# Fixed: Remove Build ID toolbar button from Sunbird, can't really use it\n# Fixed: All Thunderbird, Nvu and Sunbird Toolbar button right-click context menus are now working :)\n# Fixed: \"Get More...\" links in Addons and Help menus were broken with latest 2.0 branch builds, due to Bug #348076 "
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.3",
        "version": "5.3"
    },
    {
        "id": 18284,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/18284",
        "files": [
            {
                "id": 2081,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:cd48148582ffef91dee027b40f45acc36d377435c7bf3175cce27e6e7e3807d2",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 238592,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2081/mr_tech_local_install-5.2-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.2 Released\n- Added: Option for previously hidden feature to right-align version number in Extension/Theme/Addons window in the Manager Hacks|Layout tab of the options window.  This version works with newer Addons window, previous hidden hack didn't.\n- Added: Option to hide Extension/Theme count in Extension/Theme/Addons window under Manager Hacks|Behavior tab of the options window.\n- Added: Option to remove text labels from the Addons Manager icon bar in the Manager Hacks|Layout tab of the options window.\n- Added: Option to hide the Install button in Extension/Theme/Addons window, this is due to Bugzilla #342656 where they have disabled showing the new Install button by default\n- Added: \"Simple Add-ons Button\" is now on the list of extensions to check and prompt you to uninstall when you open the extension manager window, as the functionality is already included in Local Install.\n- Added: bg-BG translation and updated a few others\n- Updated: Major refactoring of Extension/Theme/Addons window padding and margins, also consolidated some duplicate code\n- Updated: Additional disabling of unsupported features in the Options window based on version being used\n- Updated: Cleanup of quite a few pieces of code in the Options/Settings window \n- Updated: Updated list of non-local install preferences that should be exported/reset\n- Updated: Better fit for temporary status messages in Extension/Theme/Addons list when installing, updating, uninstalling, disabling or enabling and extension or theme (applied when either Slimmode or Align Version to the Right options are enabled)\n- Updated: Slight reorganizing of Manager Hacks|Layout tab, moved some options to the new Manager Hacks|Miscellaneous tab\n- Updated: Added support for recent changes to Addons when installing\n- Fixed: Addons window would not show previously opened list on restart\n- Fixed: Issue with hiding Extension/Theme manager window button images in Thunderbird and possibly other themes.\n- Fixed: Issue where hiding My Config image from Addons toolbar would temporarily remove it from main window toolbar till next restart.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.2",
        "version": "5.2"
    },
    {
        "id": 17989,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "1.0"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/17989",
        "files": [
            {
                "id": 2080,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:69e7329c75bd3ab880b786fa6a8e02e600c87da478eea33cdf570e5909a703d8",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 230400,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2080/mr_tech_local_install-5.1.1-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "ATTENTION 3.0 Users: AMO has dropped 3.0 extension/theme submission, so Minefield 3.0 users need to get your updates from my site here: <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/18849c04192aacc0fa63796575a6c02f327a9697b6e44d5e4ae894ecef874296/http%3A//www.mrtech.com/extensions/local_install.xpi\">http://www.mrtech.com/extensions/local_install.xpi</a>\n\n5.1.1 Released\n- Added: Option to hide all Extension/Theme/Addon window button text/labels (must reopen window to re-enable them)\n- Added: uk-UA translation and updated a few others\n- Fixed: Crappy code on my part caused issues with recent Addons string changes for \"Get More ...\" links which broke main window, extensions window and toolbar icons for Bon Echo 2.0 and Minefield 3.0, Bugilla #255724\n- Fixed: Temporary work around for Addons window issues with Minefield and Thunderbird Trunk builds.\n- Fixed: Throbber support for Nvu was a little off, even with the checks I had put in."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.1.1",
        "version": "5.1.1"
    },
    {
        "id": 17743,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/17743",
        "files": [
            {
                "id": 2079,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:a07f758cca0fd384611ba8d40f4926ca612cf782951cee8924f481de69aaf837",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 224256,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2079/mr_tech_local_install-5.1-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.1 Released\n- Added: Due to Bugzilla #329601 I have re-added full Throbber clicking functionality, with options to disable or change the url.  Options available under the Miscellaneous|Throbber tab and work with all mozilla applications.  Also middle-clicking will open in a new tab to match previous functionality.\n- Added: Added \"Enable Addons Compatibility Checking\" so that you can enable/disable it with latest Bon Echo 2.0 Branch and Minefield 3.0 Builds, for more inform see Bugzilla #330895.  Option available under the Miscellaneous|XPI Install Options tab.\n- Added: Hidden preference to Show Custom Update Throbber in Extension/Theme list during \"Find Updates\" can now be configured via the Settings dialog window.\n- Added: Hidden preference to Enable Session Manager/Crash recovery session restore on restart can now be configured via the Settings dialog window.\n- Added: Repair Extensions/Themes List in Help menu for Firefox/Thunderbird 1.5 and newer Mozilla based applications is now enabled by default and hidden menu option can now be configured via the Settings dialog window.  I've also added a confirmation prompt and information when menu item is selected.\n- Added: \"Get more Extensions\" and \"Get More Themes\" to Help menu for Thunderbird 1.5 and higher.\n- Added: \"Throbber Button\" is now on the list of extensions that will get checked and will be prompted to uninstall when you open up the Extensions/Addons manager since the functionality is now included in Local Install. - <a rel=\"nofollow\" href=\"https://addons.mozilla.org/firefox/2821/\">https://addons.mozilla.org/firefox/2821/</a>\n- Added: he-IL &amp; lt-LT translation\n- Updated: Better highlighting hack for JS Console &amp; Console², thanks to Thomas Tampe\n- Updated: Options dialog cleanup for options that are not available on 1.0 vs 1.5 based applications.\n- Updated: Converted Thunderbird Help|about:config menu entry from being programmatically generated to being generated statically and it now uses the localized labels that already existed.\n- Fixed: Resolved a few nits with Thunderbird and menu icons either not showing at all or not showing/hiding when menu icon options where selected."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.1",
        "version": "5.1"
    },
    {
        "id": 16870,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/16870",
        "files": [
            {
                "id": 2078,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:3b9a8ddfc12d62613d0befeec71214c136a08f3c3c9b63e2b3ffaacccff8475b",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 212992,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2078/mr_tech_local_install-5.0.4-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.0.4 Released\n- Added: da-DK, hr-HR and mk-MK locale translations\n- Added: \"Profile Folder\" by J. Newbry has been added to the Auto-Check Uninstall Prompt when you open the Extension manager window, as this functionality is already included with Local Install: <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/fc5650b64daabc0eb3d8acee8adfa8e48ba10745e7d5bf529d5d16c866c2d0f5/http%3A//webdesigns.ms11.net/chromeditp.html\">http://webdesigns.ms11.net/chromeditp.html</a>\n- Updated: Extensions/Themes/Addons Manager window Links menu options can now be fully customized by translators.\n- Updated: Tighter layout for new Addons window.\n- Updated: Optimized xpi locale files shaving 11k from full installer (before new locales where added).\n- Updated: Optimized JavaScript Console and View Source overlay code shaving 1k from installer.\n- Updated: Many locale translations have been updated or cleaned out.\n- Fixed: JavaScript/Error Console errors with Firefox 3.0 trunk builds"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.0.4",
        "version": "5.0.4"
    },
    {
        "id": 16354,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/16354",
        "files": [
            {
                "id": 2077,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:555dddaf616414f867ab533a944ee70978e0ee383e3777a0fbf709f5304f5de6",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 218112,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2077/mr_tech_local_install-5.0.3-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.0.3 Released\n- Added: mk-MK locale\n- Added: Chrome Editor now supports userChrome.js extension (default test will appear if no userChrome.js file is found)\n- Updated: Chrome Editor's \"prefs.js\" tab now has button to load Chrome Editor settings\n- Updated: Chrome Editor settings are now in their own subtab under the main My Config tab \n- Updated: it-IT, pl-PL and ru-RU locales updated\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.0.3",
        "version": "5.0.3"
    },
    {
        "id": 16076,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/16076",
        "files": [
            {
                "id": 2076,
                "created": "2007-03-05T13:12:04Z",
                "hash": "sha256:15a65e6ec0996269f10e4b3b9893e5d464c45f842fce6fa804d308813b37b63e",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 211968,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2076/mr_tech_local_install-5.0.2-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.0.2 Released\n- Added: Thunderbird 1.5 and above nows have a about:config toolbar button with dropdown menu, only supported about: functions are listed in the dropdown.\n- Added: Thunderbird 1.5 and above nows have a \"Clear Cache\" toolbar button, this clears memory used for caching xul elements images, etc and Extension/Theme update manifests.\n- Added: \"Add-ons Sidebar\" is now on the list to prompt to uninstall since the functionality is already included in Local Install, <a rel=\"nofollow\" href=\"https://addons.mozilla.org/firefox/2549/\">https://addons.mozilla.org/firefox/2549/</a>\n- Updated: de-DE &amp; sk locales updated\n- Updated: If \"Show button bar above list\" is enabled, then \"Show Theme Preview Below Theme List\" is now automatically enabled too, it has to be this way or Show button bar option will not work\n- Fixed: Really, truly fixed the command bar button issue, it will now show up on top if preference is enabled\n- Fixed: Couldn't open EM/TM in Netscape\n- Fixed: \"Unknown\" error message with Override maxVersion feature was borked\n- Fixed: Show Install Button Image will now automatically hide if EM/TM window is open and changing options"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.0.2",
        "version": "5.0.2"
    },
    {
        "id": 16031,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/16031",
        "files": [
            {
                "id": 2075,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:1afe8ee0fe74edaaaa93dbc09129d3ed84de74989c117118fef6bf9a3622c7d3",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 210944,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2075/mr_tech_local_install-5.0.1-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "5.0.1 Released\n- Updated: es-ES, fi-FI &amp; fr-FR locales updated\n- Updated: If \"Show Button bar above list\" is selected, the hide command bar will be reverted back to false after first use\n- Fixed: Issue where \"Override 'maxVersion' compatibility checking\" was choking with Firefox 1.5 builds, (still works with 2.0 &amp; 3.0)\n- Fixed: Toggle sidebar off if open was busted with 5.0\n- Fixed: In the Extension/Theme/Addons manager \"Show Button bar above list\" should now work properly with all builds and themes\n- Fixed: My Config dropdown option changes were not being applied till restart, changing this preference will now apply instantly without restarting.\n- Fixed: \"All-In-One Sidebar\" compatibility issue when \"Show Button bar above list\" was enabled (still working on an install conflict)\n- Fixed: Cleaned up some duplicate variable declarations\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.0.1",
        "version": "5.0.1"
    },
    {
        "id": 15988,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/15988",
        "files": [
            {
                "id": 2074,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:3fdf0629c250e0ba070d52c2f512163e83d1dddbb6970c8eb13b916aec5e357f",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 208896,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2074/mr_tech_local_install-5.0-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "[b]5.0 Released[/b]\n Added: Massive updates to support new Addons interface for Extensions and Themes, should be 99.9999% compatible with Bon Echo 2.0 and Minefield 3.0\n Added: Hidden hack to hide Menu icons has now been super-streamlined and added as a preference in the Menu Options|Miscellaneous tab of the Options window (css hack no longer needed and reusing hidden pref of \"local_install.hideMenuIcons\")\n Added: You can now add \"Tab Count\" and \"Window Count\" to the customized window title, for example (${TabCount}/${WindowCount}) would yield (5/2) if five tabs were open in the current window and there were two browser windows open, check General|Window Title Options in the Local Install options window\n Added: You can now move the Extension/Themes/Addons button bar above the list view, check Manager Hacks|Layout in the Local Install options window (currently not compatible with Bon Echo 2.0 but works with 1.0.x, 1.5 &amp; 3.0 builds)\n Added: \"Show Extension Directory\" is now on the list of extensions to prompt to uninstall when you open the Extension manager window as this functionality is included with Local Install.\n Added: For Sunbird users \"about:config\" is now a toolbar icon\n Added: Hidden setting to Show Attachment box for Email Compose window now has a Option window setting in the Miscellaneous tab\n Added: Hidden setting to Always save Chrome Editor files now has a Option window setting in the My Config|Chrome Editor tab\n Updated: Properly setting options tabs when no archive directory is set and user selects Archive from context menu\n Updated: Now hiding Nightly Tester Tool button image if hide default images settings is enabled\n Updated: about:plugins and about:config toolbar context menus now include recently added about: functions\n Updated: removed some unused Sunbird context menus till I get a chance to fix them, saving about 2k\n Updated: fr-FR locale updated\n Updated: Moved \"Hide 'Paste userAgent/Build ID' from Textbox/Input Context Menu\" to the Menu Options|Miscellaneous tab of the Options window\n Fixed: Long standing issue with duplicate tabs being created for the Extension &amp; Theme manager when installing and already having a tab open and additionally updated to include any time Extension/Theme is viewed in a tab it will refocus there despite target preference\n Fixed: Slight issue with supporting custom locale useragent in Disable XPI Delay install dialog \n Fixed: Theme switch was broken with older Firefox/Thunderbird 1.0.x &amp; Netscape 8.x versions\n Fixed: Opening My Config to sidebar from the Extension/Theme Manager menu icon was not working if EM/TM was loaded in a window. \n Fixed: Text flicker on Extension install dialog if Nightly Tester Tools was installed also\n Fixed: bogus \"gExtensionsView.selected\" error message in Extension/Themes manager with context menus\n Fixed: properly hiding \"Make Compatible\" if no extension/theme is selected\n Fixed: disabling Extension Options and Theme Switcher for Mozilla Suite/Seamonkey in preferences as these options are not available with those apps\n Fixed: Preference listener leak in My Config window (found using Leak Monitor,<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/95989e230f57b8727dd66a228efc9f4ab18fb253ba9cb68fe60afec68b54f133/http%3A//dbaron.org/mozilla/leak-monitor/%29\">http://dbaron.org/mozilla/leak-monitor/)</a>"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/5.0",
        "version": "5.0"
    },
    {
        "id": 15281,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/15281",
        "files": [
            {
                "id": 2073,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:9f73f7847dc8f3758876251dc67c5344a023c50b9e3f877dd12f0832dffe4cb6",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 203776,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2073/mr_tech_local_install-4.6.4-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.6.4 Build Released\n- Added: Officially added \"about:about\" protocol which will list all the currently available \"about:\" options in a webpage (ala old school Mozilla Suite and Seamonkey)\n- Added: \"about:about\" and \"about:myconfig\" have been added to the Help|About:? menu\n- Added: \"Chrome Plus\" and \"Chrome 2\" have been added to the list of extensions to prompt you to uninstall when you open the Extension manager as these features are already included with Local Install.  <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/fc5650b64daabc0eb3d8acee8adfa8e48ba10745e7d5bf529d5d16c866c2d0f5/http%3A//webdesigns.ms11.net/chromeditp.html\">http://webdesigns.ms11.net/chromeditp.html</a>\n- Updated: Changed \"Edit My Config\" toolbar button from just a menu to a menu-button, the default action for the button is to open the Chrome Editor.\n- Fixed: With the \"Edit My Config\" toolbar update above, recent Trunk build issues with dropdowns in menu toolbar buttons are gone.\n- Fixed: Support for \"About:Config\" extension for older Thunderbird versions has been restored."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.6.4",
        "version": "4.6.4"
    },
    {
        "id": 15142,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/15142",
        "files": [
            {
                "id": 2072,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:649621aa4f05deb077fe6d348c0d5323a513091849327f550ebdcc331ea12a49",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 200704,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2072/mr_tech_local_install-4.6.3-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.6.3 Build Released\n- Updated: de-DE &amp; zh-CN locale translations\n- Fixed: Theme Switching preference listener was causing slowdowns on some extensions when updating preferences"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.6.3",
        "version": "4.6.3"
    },
    {
        "id": 14886,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "seamonkey": {
                "max": "1.0",
                "min": "1.0"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/14886",
        "files": [
            {
                "id": 2071,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:870dcc079429f08af2afea9aad232ef615066bff4400911238fec2c4db5883ac",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 201728,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2071/mr_tech_local_install-4.6.2-fx+fl+mz+ns+nv+zm+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.6.2 Build Released\n- Updated: Chrome Editor now includes default userChrome.css and userContent.css if none are available.\n- Updated: es-AR &amp; fr-FR locale translations\n- Updated: Now creating Archive directory if the one specified in the settings does not exist\n- Updated: Now supporting popup menu \"event.stopPropagation();\" to fix dropped support for \"event.preventBubble();\" in latest trunk builds \n- Fixed: Corrected BB Code formatting issues with My Config\n\n** Added: Highly Experimental \"Repair Extensions/Themes\" hidden Help Menu option for Firefox/Thunderbird 1.5 and up as well as Sunbird 0.2 and above.\n- This should only be used in case of emergency.\n- To show the Help menu option set \"local_install.showRepairExtensions\" preference to true.\n- Please close the Extension/Theme manager window before using this feature.\n- This option will delete the contents of the \"staged-xpis\" subdirectory of the \"extensions\" folder as well as the \"extensions.rdf\", \"extensions.ini\" and \"extensions.cache\" files.\n- After restarting the program, you will have to run \"Make All Compatible\" for any extensions or themes that had previously had maxversion bumped.\n- The lists will also need to be resorted.\n- Only use this when you have an extensions that is stuck and won't update or your extensions/themes list shows up blank, etc.\n- Note: this menu option will NOT be localized.\n"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.6.2",
        "version": "4.6.2"
    },
    {
        "id": 14636,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/14636",
        "files": [
            {
                "id": 2070,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:269161e1f48187bc51846b83c9426ae7a029392ff26a1ddb3d1ef98b29168c05",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 198656,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2070/mr_tech_local_install-4.6.1-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.6.1 Build Released\n- Added: Middle-clicking JavaScript Console or \"Console\" toolbar button will now open it in the sidebar (mimicking ConsoleÂ² behavior)\n- Added: Now supporting custom links (JavaScript, etc) in Extensions Options menu and Extensions Toolbar button for option dialog windows.  Tested and working with: All-in-One Gestures and Internote, but should work with other extensions that may not use \"chrome\" urls for the options window.\n- Added: \"An Options Toolbar\" is now on the list to check and prompt you to uninstall when you open the Extension manager as this functionality is already included with Local Install. <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/2bd1a449cb3370735d8fffc1b4cfd7dd301924d555136e91ba76c02533fbd94e/http%3A//www.nu22.com/firefox/optionsb\">http://www.nu22.com/firefox/optionsb</a> \n- Updated: Better testing for Extension and Theme filenames in context menu options as well as archiving options\n- Updated: fi-FI, fr-FR, it-IT, ja &amp; pl-PL locale translations\n- Fixed: Several compatibility issues that Local Install caused when Nightly Tester Tools where and where not installed, sorry \n- Fixed: In Sunbird the Help|about: menu options could not be enabled/disabled in the settings dialog"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.6.1",
        "version": "4.6.1"
    },
    {
        "id": 14401,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/14401",
        "files": [
            {
                "id": 2069,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:6260dd6f3677dba93a8c673809f3f698545b3553298154837e97caa873358b6b",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 197632,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2069/mr_tech_local_install-4.6-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.6 Build Released\n- Added: New option \"Chrome Editor\" (with UTF-8 support) under the \"Edit My Config\" menu, \"Config\" dropdown and Extension/Theme manager \"Edit My Config\" menu.  This will allow you to edit the userChrome.css, userContent.css and user.js files as well as view the prefs.js file on one page, ala ChromEdit ;) ...\n- Added: Middle-clicking on \"Config\" toolbar will now open \"Chrome Editor\" in a new tab\n- Added: \"Chrome Editor\" window target: new tab, new window or current window options to the My Config|Edit My Config tab of the Local Install options window, default is new window\n- Added: Hidden preference of \"local_install.chromeEditor.alwaysSaveOnExit\" which will always save the userChrome.css, userContent.css and user.js files when closing \"Chrome Editor\", default is false\n- Added: With new \"Chrome Editor\" feature added \"ChromEdit\" and \"Config Files Editor\" to the autocheck prompt to uninstall when opening the extension manager since this functionality is now in Local Install: <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/e4671a85082e0a2d83613f46b5c18d5e8707cb1665f109619587a43aea81da31/http%3A//cdn.mozdev.org/chromedit/\">http://cdn.mozdev.org/chromedit/</a> and <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/0ecc31a6b4f55cac59c2b07d1e861e3b2a2d735006d064412e3628bc2e64c16f/http%3A//www.minutedesign.com/extensions/confedit/\">http://www.minutedesign.com/extensions/confedit/</a>\n- Added: For Sunbird, new \"about:config\" and several other compatible \"about:...\" menu options to the Tools menu with alt-c to open about:config (fyi: about:plugins doesn't work on Sunbird)\n- Added: \"About:Config (Sunbird)\" extension to the autocheck prompt to uninstall when opening the extension manager since this functionality is now in Local Install: <a rel=\"nofollow\" href=\"https://addons.mozilla.org/extensions/moreinfo.php?id=1210&amp;application=sunbird\">https://addons.mozilla.org/extensions/moreinfo.php?id=1210&amp;application=sunbird</a>\n- Added: \"Restart Thunderbird\" has been added to the autocheck prompt to uninstall when opening the extension manager since this functionality is already in Local Install: <a rel=\"nofollow\" href=\"https://addons.mozilla.org/extensions/moreinfo.php?id=2288&amp;application=thunderbird\">https://addons.mozilla.org/extensions/moreinfo.php?id=2288&amp;application=thunderbird</a>\n- Updated: Optimized how the autocheck prompt worked as to minimize impact across different applications\n- Updated: Cleaned up some of the menu hiding/showing code\n- Fixed: Hiding \"Extension Options\" and \"Theme Switcher\" features from Tools menu in Mozilla Suite and Seamonkey since these features are not compatible with these applications.\n- Fixed: Start preferences and Options window errors for Mozilla Suite and Seamonkey with recent builds causing several features to break"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.6",
        "version": "4.6"
    },
    {
        "id": 14291,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/14291",
        "files": [
            {
                "id": 2068,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:16c9ed1d2755cdae92634812edda58f9eaf8d3c63b60f45e46b116964d87d06f",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 195584,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2068/mr_tech_local_install-4.5.1-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.5.1 Build Released\n- Updated: es-ES, it-IT &amp; pl-PL locale translations\n- Updated: Close button in My Config now only shown if in a new window, this resolves issue if My Config is the only page being viewed in browser window and close button would close Firefox, etc completely\n- Fixed: My Config would open two new tabs with certain tab settings where in place\n- Fixed: My Config is now properly encoded to UTF-8 all the time :)\n- Fixed: Revamped all code to \"open\" folder for Profile, Chrome, \"Browser install directory\", etc in an attempt to resolve Linux compatibility issues. \n- Fixed: Minor error message in console if My Config was open and changing My Config Options\n- Fixed: \"Local Install Settings\" under Extension manager Tools menu now works\n- Fixed: Potentially fixed: My Config links load very briefly in the same tab before switching back to My Config (sometimes with corrupt style)"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.5.1",
        "version": "4.5.1"
    },
    {
        "id": 14161,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/14161",
        "files": [
            {
                "id": 2067,
                "created": "2007-03-05T13:12:03Z",
                "hash": "sha256:86084bd0f55325688d6e1fabe3f914a2ba0e712d73fd4e7c08432817e725133b",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 195584,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2067/mr_tech_local_install-4.5-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.5 Build Released\n- Added: New \"about:myconfig\" protocol will load My Config window in the current view, just type it in the url/location bar and press enter or create a bookmark\n- Added: Officially added \"about:kitchensink\" protocol thus adding the \"about:kitchensink\" extension to my uninstall auto-check prompting when you open the extension manager window\n- Added: \"My Config\" option to hide the toolbar button drop-down menu, check in the My Config|Miscellaneous tab of the Local Install options\n- Added: Option to view \"My Config\" in the sidebar, with option in the View|Sidebar menu :)\n- Added: Middle-clicking on the following toolbar icons will open them up in a tab: Extensions, Themes, My Config, about:config and about:plugins (only for browser based apps like Firefox, Flock and Navigator)\n- Added: GUID can now be added to the My Config output for each Extension and Theme, option is off by default.\n- Added: Support for Session Manager's extension \"resume_session_once\" preference when using my Restart feature. This is to allow tab/window restoration after restarting.  Hidden pref in Local Install to disable this feature just set \"local_install.enableSessionManagerResume\" to false\n- Updated: Removed \"Nightly Tester Tools\" from my uninstall auto-check prompting as it has evolved with many more features, also remove hidden preference to disable checking for NTT\n- Updated: Slight enhancements to \"Make All Compatible\" and \"Enable/Disable All\" features in the Tools menu of the Extensions/Themes manager window\n- Updated: Additional compatibility fixes to have Local Install and Nightly Tester Tools work together nicely\n- Updated: pl-PL locale updated\n- Updated: Revalidated HTML output with TIDY and now W3C Validator (<a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/7ec113f3c7612b26baa5f1d033fbd3bf0b7596e9e83acc5914d0d7adf04ab79a/http%3A//validator.w3.org/\">http://validator.w3.org/</a>)\n- Fixed: Make Compatible and Make All Compatible now work with latest Bon Echo Alpha 1 Release\n- Fixed: Restored Slim Mode option in Extension/Theme manager for older Mozilla applications, without sacrificing the speed enhancements added with Local Install v4.2 for newer Mozilla applications\n- Fixed: New My Config character encoding code caused HTML output to become invalid, now properly reading current character set to fix \"http-equiv\" meta tag. \n- Fixed: Style sheet rule for My Config had a silly typo generating a \"marign\" error message, oops\n- Fixed: Clicking links when My Config is viewed in a tab will now open in new window or tab based on your \"New Window Open\" or tab extension preferences.\n- Fixed: Opening My Config from EM/TM window was slightly busted\n- Fixed: My Config filename will not show \"(null)\" for Profile Name in output filename in older Mozilla applications\n- Fixed: Slight performance enhancement when opening Extension/Theme manager and having several tabs open. Large/huge number of tabs will have no impact if opening in new window, new tab or current tab (sidebar was not affected by this)"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.5",
        "version": "4.5"
    },
    {
        "id": 14073,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/14073",
        "files": [
            {
                "id": 2066,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:8d129877b145ee70f2b2fcb18bfc126dcf15978392df5049f20fc4aefb128782",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 193536,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2066/mr_tech_local_install-4.4-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.4 Build Released\n- Added: Enable/Disable All to Theme manager tools menu, this will skip the default theme on disable\n- Added: New \"Save\" &amp; \"Copy\" buttons in \"My Config\" window with options popup menus (Removed the 3 old \"Save -...\" buttons)   \n- Added: \"My Config\" file output will now default to your local character set and html output has the html http-equiv=\"Content-Type\" and charset defined\n- Added: \"My Config\" now has a preference listener so that you can keep the My Config options open, make chagnes and click the \"Apply\" to see the updates without having to manually exit the options and refresh \n- Added: \"Local Install Settings\" options to Extension manager Tools menu to have it be consistent with Theme manager menu\n- Updated: Changed Enable/Disable All Extensions to just Enable/Disable All  \n- Updated: Enable/Disable All Extensions will no longer disable MR Tech Local Install :)  \n- Updated: fi-FI, fr-FR &amp; pt-BR locales have been updated\n- Updated: About window for Local Install will now only show current locale contributor for locale specific installs\n- Updated: Local Install description in the Extension manager now has current locale at the end and in About window\n- Fixed: Previous version mistakenly added an unfinished Enable/Disable All Extensions to the Themes manager Tools menu, this has been finished and fix now.\n- Fixed: Minor issues with previous \"Enable/Disable All\" tweak in Extension Manager"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.4",
        "version": "4.4"
    },
    {
        "id": 14022,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "3.0a1",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "3.0a1",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/14022",
        "files": [
            {
                "id": 2065,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:74eb525091fe9ee3de10e1be122189c2b8b54e7f7477e4deacc422bd48ce8f4a",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 192512,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2065/mr_tech_local_install-4.3.2-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.3.2 Build Released\n- Added: You can now add Profile name to window title, just add ${Profile} to the title template, this works for newer version of Firefox, Thunderbird, etc.\n- Added: My Config file to save now has profile name, this works for newer version of Firefox, Thunderbird, etc.\n- Added: My Config output file now has profile name in html title, this works for newer version of Firefox, Thunderbird, etc.\n- Added: F5 will now refresh My Config window.\n- Updated: Bumped version support to 3.0 for Firefox and Thunderbird, enjoy\n- Updated: es-ES locales have been updated\n- Fixed: Regresssion with v4.3 where the paragraph formatting dropdown in Thunderbird compose window would not populate\n- Fixed: Removed toolbar button toggling when window are open/close as several themes do not display properly"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.3.2",
        "version": "4.3.2"
    },
    {
        "id": 13936,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/13936",
        "files": [
            {
                "id": 2064,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:a6b0a4dc42b374eddafb21235d7f8ef9c52e22a7c111dbe99f91f46eef4107c0",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 192512,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2064/mr_tech_local_install-4.3.1-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.3.1 Build Released\n Added: My Config toolbar button now has a dropdown with save and copy options\n Updated: Slight cleanup in chrome.manifest for locale specific installers\n Updated: Links in My Config window will no longer steal focus allowing you to click on several links to open up in the background\n Updated: it-IT and sk locales have been updated\n Fixed: Hidding Tools|Local Install Settings also hid new Extensions Options menu\n Fixed: Using theme switcher dropdown would reset toolbar till next restart\n Fixed: Links in My Config now load properly from window and tabs\n Fixed: My Config report now has a title and has zero TIDY errors in HTML mode :)\n Fixed: Additionaly slight workaround to get Nightly Tester Tools extension installation to work with Local Install"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.3.1",
        "version": "4.3.1"
    },
    {
        "id": 13905,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/13905",
        "files": [
            {
                "id": 2063,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:b3c6e80664573468ab1d8076971695a85202cfc5c08d6d711be2c19e917d5609",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 192512,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2063/mr_tech_local_install-4.3-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.3 Build Release Notes\n- Added: New \"Extension Options\" menu in main window Tools menu (which reuses code from my Extension toolbar dropdown menu), with option to hide in the settings\n- Added: New \"Theme Switcher\" menu in main window Tools menu (which reuses code from my Theme toolbar dropdown menu), with option to hide in the settings \n- Added: With the new \"Extension Options\" menu, I've added the \"Options Menu\" extension to the list of extensions to check and prompt you to uninstall when you open the Extension Manager\n- Added: \"Sanitize\" extension is now on the list of extensions to check and prompt you to uninstall when you open the Extension Manager, since this feature is already included in Local Install\n- Added: Now showing version number in the menu item and description in the tooltip for the Extension and Theme manager toolbar dropdowns and new \"Extension Options\" and \"Theme Switcher\" Tools menu\n- Added: Hidden pref \"local_install.disableNightlyTesterExtensionCheck\" (default=false) to disable uninstall prompt checking for Nightly Tester Tool when opening Extension Manager, as it has recently been updated to include features not covered by Local Install  \n- Updated: Minor Extension/Theme dropdown menu code cleanup and uncaught XUL formatting error\n- Updated: If any Local Install feature is targeting \"New Tab\" and the current window/tab is \"about:blank\", the feature will load there instead of creating a new tab.\n- Updated: Removed Littlebird, Nautipolis &amp; Walnut Themes custom EM/TM hacks css file as the latest versions are now back to normal \n- Fixed: Finally fixed for random Restart issues\n- Fixed: Small bug in Theme dropdown on older Firefox &amp; Thunderbird builds\n- Fixed: Extension installation compatibility issue with Nightly Tester Tool, it can be installed without breaking the extension confirmation dialog"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.3",
        "version": "4.3"
    },
    {
        "id": 13782,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/13782",
        "files": [
            {
                "id": 2062,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:01564454adbf37ea4b7d876fc027975ff8be92fa2e679b3bc4c4ffbd28dedfb6",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 191488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2062/mr_tech_local_install-4.2.6.2-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.6.2 Build Released\n- Added: Open archive folders to File menu in Extension and Theme manager windows. Note: these entries are still also under Tools|Edit My Config, but figured it would make it easier to add them to the File menu too.\n- Added: Experimental hidden preference \"local_install.bypassInstallDelay\" this will bypass the Install Prompt altogether, do not set this to true unless you are absolutely sure of what you are doing. Note: the install prompt will flash for a split second and then close and continue without stopping.\n- Added: Hidden preference \"local_install.showAttachmentBox\" set to false be default.  This will always show the attachment box in Thunderbird's email compose window, just one of my pet peeves since I like clicking in that area to attach files.\n- Updated: Optimized generating Theme Toolbar button dropdown menu, in comparison it's lighting fast now when many themes are installed \n- Updated: Settings export/import will now default to .txt if no filename extension is given\n- Fixed: Regression in Extension/Theme Update Wizard for older 1.0.x based programs"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.6.2",
        "version": "4.2.6.2"
    },
    {
        "id": 13661,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/13661",
        "files": [
            {
                "id": 2061,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:3b4feb7105738fd21159fb2ef67d93e6b5b4fc9b28978ee0b0cfb68dab94ecfb",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 191488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2061/mr_tech_local_install-4.2.6-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.6 Build Released\n- Added: If enabled, Auto-Archiving now works for Update Notifier\n- Added: If enabled, Auto-Archiving Extensions that have been remotely installed with the \"Override 'maxVersion' compatibility checking\" feature\n- Updated: Restored remembering previous local install directory, but it is no longer tied to the auto-archive directory from the settings dialog\n- Updated: Slight updates for Extension installation maxVersion compatibility checking code\n- Fixed: \"Browse install directory\" for Extensions/Themes context menu now works for non-guid id's (basically newer email address based id's)\n- Fixed: Slight issue with Tools|View mode in Theme manager window"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.6",
        "version": "4.2.6"
    },
    {
        "id": 13603,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/13603",
        "files": [
            {
                "id": 2060,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:137fcbf17f4383085a3d8ea537f6ea8f3d5cacd52fc9c7e802b1cd28b2d9d420",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 191488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2060/mr_tech_local_install-4.2.5.1-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.5.1 Build Released\n- Updated: No longer updating Auto Archive directory on manual local installs \n- Updated: If slimmode is enabled Extension/Theme description is flexed as to not explode the scrollbars and cause massive scrolling left and right.\n- Updated: If Slimmode is enabled, hiding EM/TM \"More Information\" in newer trunk/test builds\n- Updated: de-DE, fi-FI, pl-PL, sk &amp; ru-RU locales\n- Fixed: Slight code change to add compatibility with Session Manager and the restart functionality"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.5.1",
        "version": "4.2.5.1"
    },
    {
        "id": 13244,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/13244",
        "files": [
            {
                "id": 2059,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:f8c2e523d8f9eacf5b9f9c0624d1bec746bd68968c3776c7f2309cc6d41772a7",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 191488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2059/mr_tech_local_install-4.2.5-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.5 Build Released\n- Updated: Big round of cleanup in the Local Install settings dialog with options that should be disabled for Thunderbird, Nvu &amp; Sunbird\n- Updated: Code cleanup \"Enable/Disable All Extensions\" in Extension Manager window, slight improvement in Extension enabling code too\n- Updated: Added restart prompt to \"Enable/Disable All Extensions\" feature in Extension Manager window\n- Updated: Bumped up Thunderbird maxVersion to 3.1 since 3.0 alpha is the latest version number (download from my site)\n- Updated: Now prefixing \"Export/Import\" Local Install settings filename with the program name, ie: firefox_li_prefs.txt, thunderbird_li_prefs.txt, etc.\n- Updated: es-ES &amp; it-IT locales\n- Fixed: Added 6 missing preferences from new Local Install \"Export/Import/Defaults\" settings feature in the Options window\n- Fixed: Corrected and assigned 7 missing default values to preferences"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.5",
        "version": "4.2.5"
    },
    {
        "id": 13098,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/13098",
        "files": [
            {
                "id": 2057,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:17821c25da9deca4e38e8bf5ba80ef922b82e2f4c76c61ed37e2440d8270fb7f",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 191488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2057/mr_tech_local_install-4.2.3.1-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.3.1 Build Released\n- Updated: Silvermel theme enhancements: Tighter EM/TM Slimmode support, EM/TM \"Find Updates\" progress throbber &amp; Compact Menus icon fix\n- Updated: de-DE &amp; fi-FI locales\n- Updated: Sunbird min/max install version are now all squared away, nightly updates should work and users can install from UMO or my site\n- Updated: Reoptimized toolbar and menu images\n- Fixed: Chrome Registration error with Mozilla and Seamonkey with version 4.2.3"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.3.1",
        "version": "4.2.3.1"
    },
    {
        "id": 12997,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/12997",
        "files": [
            {
                "id": 2056,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:e3d65d4b6113f0c19f3fd191d6e88042c9e62c8bd8e56656f0d7c18a546682e6",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 191488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2056/mr_tech_local_install-4.2.3-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.3 Build:\n- Added: New \"My Config\" window target preference under the My Config|Miscellaneous tab\n- Added: \"Nightly Tester Tools Lite\" extension to the Uninstall Auto-Checklist of extensions that Local Install handles - <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/f25893308f67524a41149ef1c1461f5445bfb40daf45198b4ca9b51e81a828d9/http%3A//grayson.servehttp.com%3A8080/extension/%23nightly\">http://grayson.servehttp.com:8080/extension/#nightly</a> \n- Updated: Slight optimization with new \"Update Check Disabled\" in reading update check preference values\n- Updated: it-IT &amp; JA locales\n- Fixed: Potential fix for Extension/Theme list sorting not staying sorted, please let me know if manually sorting doesn't keep list sorted after reopening Extension/Theme manager thanks.\n- Fixed: Error and other potential extension issues with Local Install v4.2.2 or newer and Thunderbird 1.5, known issue with Contact Sidebar has been resolved with this update.\n- Fixed: \"Update Check Disabled\" option in Extension manager Tools|View menu was not properly filtering extensions with newer \"email\" or text based extensions id's."
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.3",
        "version": "4.2.3"
    },
    {
        "id": 12957,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/12957",
        "files": [
            {
                "id": 2055,
                "created": "2007-03-05T13:12:02Z",
                "hash": "sha256:e64cc1e4c9863a9f85779ec9935c8115315c940bdb8a6c5997e5aac83d9c7af7",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 191488,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2055/mr_tech_local_install-4.2.2.1-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.2.1 Build Released\n- Updated: Several locale updates, additionally \"sk-SK\" locale has been converted to just \"sk\"\n- Fixed: Auto Uninstall \"don't bother me\" flag was not being honored with 4.2.2\n- Fixed: Minor error when switching preferences in Thunderbird\n- Fixed: Now properly supporting context-menu options for \"Disable Update Check\" in Extension manager window on Nvu and older app versions\n- Fixed: Thunderbird Compose window wouldn't launch some commands/toolbar buttons\n- Fixed: In Thunderbird multiple \"about:config\" entries under the Help menu were creeping in"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.2.1",
        "version": "4.2.2.1"
    },
    {
        "id": 12909,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/12909",
        "files": [
            {
                "id": 2054,
                "created": "2007-03-05T13:12:01Z",
                "hash": "sha256:97560784c898af762249c15cf009d72d08118941247bb4f313f94286f7ab1344",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 190464,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2054/mr_tech_local_install-4.2.2-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.2 Build Released\n- Added: New feature to Extension manager window context-menu to allow you to Disable/Enable update checking for specific extensions. Though similar to \"HideUpdate\" extension, my implementation which has been planned since the early Local Install 3.0 release relies solely on the preference settings that are native to the Extension update process and works with 1.0.x based apps. Note: these menu options has not been translated to other locales.\n- Added: A new Tools menu called \"View\" in the Extension Manager window, you can switch between: Only Enabled, Only Disabled, Update Check Disabled and All. The previous view is remembered across EM sessions and the title is updated with the current view. Special attention was taken as to not impact performance when the default \"All\" view is being used. Let me know if you want any future views and enjoy. Note: these menu options has not been translated to other locales.\n- Added: \"HideUpdate\" extension to the Uninstall Auto-Checklist of extensions that Local Install handles and my implementation works with Firefox/Thunderbird 1.0.x based builds - <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/2aed2d1748c3e45b7785f42762ef4064651e1eb9498dd967d2ea416b3ccd2c74/http%3A//dafizilla.sourceforge.net/hideupdate\">http://dafizilla.sourceforge.net/hideupdate</a>\n- Added: about:config in the Help menu for Thunderbird 1.5 or newer builds\n- Added: \"Local Install Settings\" to Tools menu in Theme manager window (already in Options menu for Extension Manager)"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.2",
        "version": "4.2.2"
    },
    {
        "id": 12674,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/12674",
        "files": [
            {
                "id": 2053,
                "created": "2007-03-05T13:12:01Z",
                "hash": "sha256:d007924ec2ad6f1c5b56540712c435c9d2d3509239494e9aec1f57fb873b30ff",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 189440,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2053/mr_tech_local_install-4.2.1.3-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "[b]4.2.1.3 Build Released[/b]\n Added: AboutPlug extension to the Uninstall Auto-Checklist of extensions that Local Install handles - <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/cea3e356439e31d359f437fa817f07e3418f75625418ea5e13a026cf99dc4156/http%3A//www.jasnapaka.com/mozilla/aboutplugins/\">http://www.jasnapaka.com/mozilla/aboutplugins/</a>\n Updated: Finally an update for the Romanian locale thanks to ultravioletu (Dragos)\n Updated: Mozilla/Seamonkey installer version updated (keep forgetting)"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.1.3",
        "version": "4.2.1.3"
    },
    {
        "id": 12517,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/12517",
        "files": [
            {
                "id": 2052,
                "created": "2007-03-05T13:12:01Z",
                "hash": "sha256:54c4c91519bc4c8c731cbfe00cc38454016b87c371f933ed343e6e32a34ccde5",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 187392,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2052/mr_tech_local_install-4.2.1.2-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.1.2 Build Released\n# Added: Code snippet and hidden preference \"local_install.hideMenuIcons\" to hide Local Install menu icons (more info here: <a rel=\"nofollow\" href=\"https://outgoing.prod.mozaws.net/v1/eed9417fc9c054aaca1811d8f1f44a326d6946f76e066f0b2df2f911d6ed5aa7/http%3A//www.mrtech.com/extensions/local_install/hacks.html\">http://www.mrtech.com/extensions/local_install/hacks.html</a> )\n# Fixed: Small preference/layout EM/TM patch for older based apps Fx/Tb 1.0.x, Nvu, Netscape, etc\n\nCode:\n/* Hide menu icons,  \"local_install.hideMenuIcons\" preference must also be false\nNote: May hide Local Install menu arrow indicator for My Config, etc\n(MUST be placed ABOVE the @namespace entry) */\n@import url(\"chrome://local_install/skin/hidemenuicons.css\");"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.1.2",
        "version": "4.2.1.2"
    },
    {
        "id": 12486,
        "channel": "listed",
        "compatibility": {
            "firefox": {
                "max": "1.5.0.*",
                "min": "0.9"
            },
            "thunderbird": {
                "max": "1.5.0.*",
                "min": "1.0"
            }
        },
        "edit_url": "https://addons.thunderbird.net/en-US/developers/addon/mr-tech-toolkit/versions/12486",
        "files": [
            {
                "id": 2051,
                "created": "2007-03-05T13:12:01Z",
                "hash": "sha256:53e2f3f5451bb251051030783a20a3a22e2b70e3b78723ef245573179f9f89c0",
                "is_restart_required": true,
                "is_webextension": false,
                "is_mozilla_signed_extension": false,
                "platform": "all",
                "size": 187392,
                "status": "public",
                "url": "https://addons.thunderbird.net/thunderbird/downloads/file/2051/mr_tech_local_install-4.2.1.1-fx+fl+mz+ns+nv+sb+tb.xpi?src=",
                "permissions": []
            }
        ],
        "is_strict_compatibility_enabled": true,
        "license": null,
        "release_notes": {
            "en-US": "4.2.1.1 Build Released\n- Updated: Removed unused images from xpi installer\n- Updated: Simplified Chinese Locale updated\n- Fixed: Better support for \"miniFox\", \"miniFoxFlat\" and \"minibird\" themes in the Options/Settings dialog"
        },
        "reviewed": null,
        "url": "https://addons.thunderbird.net/en-US/thunderbird/addon/mr-tech-toolkit/versions/4.2.1.1",
        "version": "4.2.1.1"
    }
]